-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-06-20 19:05:13
-- @Last Modified time  : 2022-07-15 13:57:55
return {
    {
        id = 3,
        nid = 'c9MIH_CdFBorTUJuLyWwV',
        uid = 1,
        创建时间 = 1652436983,
        删除时间 = 0,
        登出时间 = 0,
        登录时间 = 0,
        地图 = 66744,
        x = 900,
        y = 500,
        外形 = 2,
        种族 = 1, --人仙魔
        性别 = 1, --男女
        名称 = '1',
        头像 = 1,
        称谓 = nil,
        帮派 = nil,
        等级 = 1,
        经验 = 0,
        气血 = 0,
        魔法 = 0,
        体力 = 10,
        活力 = 10,
        声望 = 10,
        战绩 = 10,
        最大声望 = 10,
        最大战绩 = 10,
        银子 = 100,
        存银 = 100,
        根骨 = 1,
        灵性 = 1,
        敏捷 = 1,
        力量 = 1,
        潜力 = 4,
        转生 = 0,
        飞升 = 0,
        师贡 = 0,
        称谓列表 = "{}",
        转生记录 = "{}",
        技能 = "{}",
        其它 = "{}",
        -- 技能 = {
        --     {
        --         名称 = '迷魂醉',
        --         熟练上限 = 10000,
        --         熟练度 = 1
        --     },
        --     {
        --         名称 = '百日眠',
        --         熟练上限 = 10000,
        --         熟练度 = 0
        --     },
        --     {
        --         名称 = '反间之计',
        --         熟练上限 = 10000,
        --         熟练度 = 111
        --     },
        --     {
        --         名称 = '情真意切',
        --         熟练上限 = 10000,
        --         熟练度 = 10000
        --     },
        --     {
        --         名称 = '谗言相加',
        --         熟练上限 = 10000,
        --         熟练度 = 0
        --     },
        --     {
        --         名称 = '借刀杀人',
        --         熟练上限 = 10000,
        --         熟练度 = 1
        --     }
        -- },

        -- 称谓列表 = {
        --     '武林新丁',
        --     '江湖小虾',
        --     '后起之秀',
        --     '武林高手',
        --     '风尘奇侠',
        --     '无双隐士',
        --     '世外高人',
        --     '江湖侠隐',
        --     '无敌圣者',
        --     '三界贤君'
        -- }
    }
}
