-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2022-09-07 14:09:38
-- @Last Modified time  : 2023-04-22 04:13:49
return {
    编号 = 0,
    名称 = "",
    创始人="",
    帮主 = "",
    等级 = 1,
    帮派资金 = 0,
    成员数量 = 0,
    战绩值=0,
    建设度=0,
    名望值=0,
    威望值=0,
    帮战次数=0,
    帮战胜利=0,
    帮战失败=0,
    帮战等级="辛级",
    雇佣信息={召唤兽={雇佣=false,期限=0},坐骑={雇佣=false,期限=0}},
    成员列表 = {},
    最大成员数量 = 150,
    核心成员={},
    战队={},
    响应列表 = {},
    帮派仓库 = {},
    申请列表 = {},
    宗旨 = "帮主很懒，什么也没写",
    创建时间 = 0,
    贸易金库 = 0,
    响应 = 1,
    守护 = {}
}
