-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2024-04-20 21:38:56
-- @Last Modified time  : 2024-08-01 09:36:32
return {
    {name = '鼠', 外形 = 4001 , 名称颜色 = 569384191},
    {name = '牛', 外形 = 4002 , 名称颜色 = 569384191},
    {name = '虎', 外形 = 4003 , 名称颜色 = 569384191},
    {name = '兔', 外形 = 4004 , 名称颜色 = 569384191},
    {name = '龙', 外形 = 4005 , 名称颜色 = 569384191},
    {name = '蛇', 外形 = 4006 , 名称颜色 = 569384191},
    {name = '马', 外形 = 4007 , 名称颜色 = 569384191},
    {name = '羊', 外形 = 4008 , 名称颜色 = 569384191},
    {name = '猴', 外形 = 4009 , 名称颜色 = 569384191},
    {name = '鸡', 外形 = 4010 , 名称颜色 = 569384191},
    {name = '狗', 外形 = 4011 , 名称颜色 = 569384191},
    {name = '猪', 外形 = 4012 , 名称颜色 = 569384191}
}
