-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2023-04-11 04:21:54
-- @Last Modified time  : 2023-11-01 16:37:02

return {
    武器 = {
        [1] = { 名称 = "附加攻击", 下限 = 150, 上限 = 1000 },
        [2] = { 名称 = "速度", 下限 = 2, 上限 = 12 },
        [3] = { 名称 = "力量", 下限 = 2, 上限 = 15 },
        [4] = { 名称 = "根骨", 下限 = 2, 上限 = 15 },
        [5] = { 名称 = "灵性", 下限 = 2, 上限 = 15 },
        [6] = { 名称 = "敏捷", 下限 = 2, 上限 = 15 },

        [7] = { 名称 = "加强雷", 下限 = 1, 上限 = 8 },
        [8] = { 名称 = "加强风", 下限 = 1, 上限 = 8 },
        [9] = { 名称 = "加强水", 下限 = 1, 上限 = 8 },
        [10] = { 名称 = "加强火", 下限 = 1, 上限 = 8 },
        [11] = { 名称 = "加强封印", 下限 = 1, 上限 = 8 },
        [12] = { 名称 = "加强昏睡", 下限 = 1, 上限 = 8 },
        [13] = { 名称 = "加强混乱", 下限 = 1, 上限 = 8 },
        [14] = { 名称 = "加强中毒", 下限 = 1, 上限 = 8 },

        [15] = { 名称 = "忽视抗雷", 下限 = 1, 上限 = 5 },
        [16] = { 名称 = "忽视抗风", 下限 = 1, 上限 = 5 },
        [17] = { 名称 = "忽视抗水", 下限 = 1, 上限 = 5 },
        [18] = { 名称 = "忽视抗火", 下限 = 1, 上限 = 5 },
        [19] = { 名称 = "忽视抗封", 下限 = 1, 上限 = 5 },
        [20] = { 名称 = "忽视抗睡", 下限 = 1, 上限 = 5 },
        [21] = { 名称 = "忽视抗混", 下限 = 1, 上限 = 5 },
        [22] = { 名称 = "忽视抗毒", 下限 = 1, 上限 = 5 },

        [23] = { 名称 = "反击次数", 下限 = 1, 上限 = 10 },
        [24] = { 名称 = "连击次数", 下限 = 1, 上限 = 10 },

        [25] = { 名称 = "水系狂暴几率", 下限 = 1, 上限 = 10 },
        [26] = { 名称 = "火系狂暴几率", 下限 = 1, 上限 = 10 },
        [27] = { 名称 = "风系狂暴几率", 下限 = 1, 上限 = 10 },
        [28] = { 名称 = "雷系狂暴几率", 下限 = 1, 上限 = 10 },
        [29] = { 名称 = "加成攻击", 下限 = 4, 上限 = 20 },
    },
    项链 = {
        [1] = { 名称 = "附加攻击", 下限 = 150, 上限 = 1000 },
        [2] = { 名称 = "速度", 下限 = 4, 上限 = 20 },
        [3] = { 名称 = "力量", 下限 = 5, 上限 = 30 },
        [4] = { 名称 = "根骨", 下限 = 5, 上限 = 30 },
        [5] = { 名称 = "灵性", 下限 = 5, 上限 = 30 },
        [6] = { 名称 = "敏捷", 下限 = 5, 上限 = 30 },

        [7] = { 名称 = "加强雷", 下限 = 1, 上限 = 8 },
        [8] = { 名称 = "加强风", 下限 = 1, 上限 = 8 },
        [9] = { 名称 = "加强水", 下限 = 1, 上限 = 8 },
        [10] = { 名称 = "加强火", 下限 = 1, 上限 = 8 },
        [11] = { 名称 = "加强封印", 下限 = 1, 上限 = 8 },
        [12] = { 名称 = "加强昏睡", 下限 = 1, 上限 = 8 },
        [13] = { 名称 = "加强混乱", 下限 = 1, 上限 = 8 },
        [14] = { 名称 = "加强中毒", 下限 = 1, 上限 = 8 },

        [15] = { 名称 = "忽视抗雷", 下限 = 1, 上限 = 5 },
        [16] = { 名称 = "忽视抗风", 下限 = 1, 上限 = 5 },
        [17] = { 名称 = "忽视抗水", 下限 = 1, 上限 = 5 },
        [18] = { 名称 = "忽视抗火", 下限 = 1, 上限 = 5 },
        [19] = { 名称 = "忽视抗封", 下限 = 1, 上限 = 5 },
        [20] = { 名称 = "忽视抗睡", 下限 = 1, 上限 = 5 },
        [21] = { 名称 = "忽视抗混", 下限 = 1, 上限 = 5 },
        [22] = { 名称 = "忽视抗毒", 下限 = 1, 上限 = 5 },

        [23] = { 名称 = "水系狂暴几率", 下限 = 1.5, 上限 = 30 },
        [24] = { 名称 = "火系狂暴几率", 下限 = 1.5, 上限 = 30 },
        [25] = { 名称 = "风系狂暴几率", 下限 = 1.5, 上限 = 30 },
        [26] = { 名称 = "雷系狂暴几率", 下限 = 1.5, 上限 = 30 },

        [27] = { 名称 = "物理吸收", 下限 = 3, 上限 = 20 },

        [28] = { 名称 = "每回合HP", 下限 = 20, 上限 = 200 },

        [29] = { 名称 = "反震率", 下限 = 3, 上限 = 20 },
        [30] = { 名称 = "反震程度", 下限 = 3, 上限 = 20 },

        [31] = { 名称 = "加成攻击", 下限 = 4, 上限 = 20 },
        [32] = { 名称 = "躲闪率", 下限 = 3, 上限 = 20 },
        [33] = { 名称 = "抗雷", 下限 = 4, 上限 = 25 },
        [34] = { 名称 = "抗火", 下限 = 4, 上限 = 25 },
        [35] = { 名称 = "抗风", 下限 = 4, 上限 = 25 },
        [36] = { 名称 = "抗水", 下限 = 4, 上限 = 25 },

        [37] = { 名称 = "抗混乱", 下限 = 3, 上限 = 20 },
        [38] = { 名称 = "抗昏睡", 下限 = 3, 上限 = 20 },
        [39] = { 名称 = "抗封印", 下限 = 3, 上限 = 20 },
        [40] = { 名称 = "抗中毒", 下限 = 3, 上限 = 20 },


    },

    帽子 = {

        [1] = { 名称 = "物理吸收", 下限 = 1, 上限 = 10 },

        [2] = { 名称 = "抗雷", 下限 = 4, 上限 = 25 },
        [3] = { 名称 = "抗火", 下限 = 4, 上限 = 25 },
        [4] = { 名称 = "抗风", 下限 = 4, 上限 = 25 },
        [5] = { 名称 = "抗水", 下限 = 4, 上限 = 25 },

        [6] = { 名称 = "抗混乱", 下限 = 3, 上限 = 20 },
        [7] = { 名称 = "抗封印", 下限 = 3, 上限 = 20 },
        [8] = { 名称 = "抗昏睡", 下限 = 3, 上限 = 20 },
        [9] = { 名称 = "抗中毒", 下限 = 4, 上限 = 25 },

        [10] = { 名称 = "加成攻击", 下限 = 5, 上限 = 20 },
        [11] = { 名称 = "连击率", 下限 = 3, 上限 = 20 },
        [12] = { 名称 = "致命几率", 下限 = 9, 上限 = 30 },
        [13] = { 名称 = "狂暴几率", 下限 = 9, 上限 = 30 },

        [14] = { 名称 = "反震率", 下限 = 9, 上限 = 30 },
        [15] = { 名称 = "反震程度", 下限 = 9, 上限 = 30 },

        [16] = { 名称 = "速度", 下限 = 2, 上限 = 12 },
        [17] = { 名称 = "力量", 下限 = 2, 上限 = 15 },
        [18] = { 名称 = "根骨", 下限 = 2, 上限 = 15 },
        [19] = { 名称 = "灵性", 下限 = 2, 上限 = 15 },
        [20] = { 名称 = "敏捷", 下限 = 2, 上限 = 15 },
        [21] = { 名称 = "附加气血", 下限 = 225, 上限 = 650 },
        [22] = { 名称 = "附加魔法", 下限 = 225, 上限 = 650 },
        [23] = { 名称 = "附加攻击", 下限 = 75, 上限 = 500 },
        [24] = { 名称 = "每回合HP", 下限 = 20, 上限 = 200 },
    },

    衣服 = {
        [1] = { 名称 = "物理吸收", 下限 = 1, 上限 = 10 },

        [2] = { 名称 = "抗雷", 下限 = 4, 上限 = 25 },
        [3] = { 名称 = "抗火", 下限 = 4, 上限 = 25 },
        [4] = { 名称 = "抗风", 下限 = 4, 上限 = 25 },
        [5] = { 名称 = "抗水", 下限 = 4, 上限 = 25 },

        [6] = { 名称 = "抗混乱", 下限 = 3, 上限 = 20 },
        [7] = { 名称 = "抗封印", 下限 = 3, 上限 = 20 },
        [8] = { 名称 = "抗昏睡", 下限 = 3, 上限 = 20 },
        [9] = { 名称 = "抗中毒", 下限 = 4, 上限 = 25 },

        [10] = { 名称 = "加成攻击", 下限 = 5, 上限 = 20 },
        [11] = { 名称 = "连击率", 下限 = 3, 上限 = 20 },
        [12] = { 名称 = "致命几率", 下限 = 9, 上限 = 30 },
        [13] = { 名称 = "狂暴几率", 下限 = 9, 上限 = 30 },

        [14] = { 名称 = "反震率", 下限 = 9, 上限 = 30 },
        [15] = { 名称 = "反震程度", 下限 = 9, 上限 = 30 },

        [16] = { 名称 = "速度", 下限 = 2, 上限 = 12 },
        [17] = { 名称 = "力量", 下限 = 2, 上限 = 15 },
        [18] = { 名称 = "根骨", 下限 = 2, 上限 = 15 },
        [19] = { 名称 = "灵性", 下限 = 2, 上限 = 15 },
        [20] = { 名称 = "敏捷", 下限 = 2, 上限 = 15 },
        [21] = { 名称 = "附加气血", 下限 = 225, 上限 = 650 },
        [22] = { 名称 = "附加魔法", 下限 = 225, 上限 = 650 },
        [23] = { 名称 = "附加攻击", 下限 = 75, 上限 = 500 },
        [24] = { 名称 = "每回合HP", 下限 = 20, 上限 = 200 },
    },

    鞋子 = {

       
        [1] = { 名称 = "物理吸收", 下限 = 1, 上限 = 8 },

        [2] = { 名称 = "抗雷", 下限 = 2, 上限 = 12 },
        [3] = { 名称 = "抗火", 下限 = 2, 上限 = 12 },
        [4] = { 名称 = "抗风", 下限 = 2, 上限 = 12 },
        [5] = { 名称 = "抗水", 下限 = 2, 上限 = 12 },

        [6] = { 名称 = "抗混乱", 下限 = 1, 上限 = 8 },
        [7] = { 名称 = "抗封印", 下限 = 1, 上限 = 8 },
        [8] = { 名称 = "抗昏睡", 下限 = 1, 上限 = 8 },
        [9] = { 名称 = "抗中毒", 下限 = 1, 上限 = 10 },

        [10] = { 名称 = "加成攻击", 下限 = 1, 上限 = 4 },
        [11] = { 名称 = "连击率", 下限 = 3, 上限 = 20 },
        [12] = { 名称 = "致命几率", 下限 = 3, 上限 = 20 },
        [13] = { 名称 = "命中率", 下限 = 3, 上限 = 20 },
        [14] = { 名称 = "狂暴几率", 下限 = 3, 上限 = 20 },
        [15] = { 名称 = "反击率", 下限 = 3, 上限 = 20 },
        [16] = { 名称 = "躲闪率", 下限 = 3, 上限 = 20 },

        [17] = { 名称 = "速度", 下限 = 4, 上限 = 25 },
        [18] = { 名称 = "力量", 下限 = 2, 上限 = 12 },
        [19] = { 名称 = "根骨", 下限 = 5, 上限 = 12 },
        [20] = { 名称 = "灵性", 下限 = 5, 上限 = 12 },
        [21] = { 名称 = "敏捷", 下限 = 5, 上限 = 25 },
        [22] = { 名称 = "每回合HP", 下限 = 10, 上限 = 100 },
        [23] = { 名称 = "附加气血", 下限 = 450, 上限 = 1300 },
        [24] = { 名称 = "附加魔法", 下限 = 450, 上限 = 1300 },
        [25] = { 名称 = "附加攻击", 下限 = 30, 上限 = 200 },


    },
}
