-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2023-09-14 17:02:20
-- @Last Modified time  : 2024-05-07 23:18:36

return {
    银索金铃 = { 名称 = "银索金铃", 主人 = "紫霞", 阴阳 = "阴", 灵气 = 600 , 灵气上限 = 600 , 道行 =0 , 等级 = 1 },
    将军令 = { 名称 = "将军令", 主人 = "秦琼", 阴阳 = "阳", 灵气 = 600 , 灵气上限 = 600 , 道行 =0 , 等级 = 1 },
    大势锤 = { 名称 = "大势锤", 主人 = "天一神将", 阴阳 = "阳", 灵气 = 600 , 灵气上限 = 600 , 道行 =0 , 等级 = 1 },
    七宝玲珑塔 = { 名称 = "七宝玲珑塔", 主人 = "李靖", 阴阳 = "阴", 灵气 = 600 , 灵气上限 = 600 , 道行 =0 , 等级 = 1 },
    黑龙珠 = { 名称 = "黑龙珠", 主人 = "东海龙王", 阴阳 = "阳", 灵气 = 600 , 灵气上限 = 600 , 道行 =0 , 等级 = 1 },
    幽冥鬼手 = { 名称 = "幽冥鬼手", 主人 = "阎罗王", 阴阳 = "阴", 灵气 = 600 , 灵气上限 = 600 , 道行 =0 , 等级 = 1 },
    大手印 = { 名称 = "大手印", 主人 = "三大王", 阴阳 = "阳", 灵气 = 600 , 灵气上限 = 600 , 道行 =0 , 等级 = 1 },
    绝情鞭 = { 名称 = "绝情鞭", 主人 = "嫦娥", 阴阳 = "阴", 灵气 = 600 , 灵气上限 = 600 , 道行 =0 , 等级 = 1 },
    情网 = { 名称 = "情网", 主人 = "春三十娘", 阴阳 = "阴", 灵气 = 600 , 灵气上限 = 600 , 道行 =0 , 等级 = 1 },
    宝莲灯 = { 名称 = "宝莲灯", 主人 = "杨戬", 阴阳 = "阳", 灵气 = 600 , 灵气上限 = 600 , 道行 =0 , 等级 = 1 },
    金箍儿 = { 名称 = "金箍儿", 主人 = "玄奘", 阴阳 = "阳", 灵气 = 600 , 灵气上限 = 600 , 道行 =0 , 等级 = 1 },
    --番天印 = { 名称 = "番天印", 主人 = "镇元大仙", 阴阳 = "阴", 灵气 = 600 , 灵气上限 = 600 , 道行 =0 , 等级 = 1 },
    锦襕袈裟 = { 名称 = "锦襕袈裟", 主人 = "观音姐姐", 阴阳 = "阳", 灵气 = 600 , 灵气上限 = 600 , 道行 =0 , 等级 = 1 },
    白骨爪 = { 名称 = "白骨爪", 主人 = "晶晶姑娘", 阴阳 = "阴", 灵气 = 600 , 灵气上限 = 600 , 道行 =0 , 等级 = 1 },
    化蝶 = { 名称 = "化蝶", 主人 = "彩翼仙子", 阴阳 = "阴", 灵气 = 600 , 灵气上限 = 600 , 道行 =0 , 等级 = 1 }
}
