-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2023-04-16 18:07:25
-- @Last Modified time  : 2023-05-02 06:04:18

function 取随机配饰(等级)
    local 配饰表={}
    配饰表[1]={"灵草戒指","流纨束带","昆仑奴面具","蝉翼纱巾","一口钟","草莺斗篷"}
    配饰表[2]={"盘古之戒","辟邪腰带","杀手头巾","梨花带雨","鱼袋斗篷","翠云裘"}
    配饰表[3]={"黑木戒指","辟寒犀带","粉墨人生","花旦面具","紫鸯披风","蓝鸳披风"}
    配饰表[4]={"珊瑚瓣","月影犀带","行军眼罩","落梅妆","抹月披风","沙图什"}
    配饰表[5]={"冥灵戒指","黄琅腰带","龙纹","鎏金额饰","天篷披风","檐牙斗篷"}
    配饰表[6]={"血瓷戒指","星辰之约","黑曜石冠","月牙梳","冰河披风","尺玉披肩"}
    配饰表[7]={"翠玉扳指","祥云流带","琅琊梦断","半面妆","流火披风","红萼斗篷"}
    return 配饰表[等级][取随机数(1,#配饰表[等级])]
end

function 取下级配饰名称(名称)
    local 配饰={"水苍玉佩","怀梦香囊","黄琅如意","落雪风铃","流景扬辉","霁月古镜","伽蓝碎雨","灵草戒指","盘古之戒","黑木戒指","珊瑚瓣","冥灵戒指","血瓷戒指","翠玉扳指","灵草戒指 ","盘古之戒 ","黑木戒指 ","珊瑚瓣 ","冥灵戒指 ","血瓷戒指 ","翠玉扳指 ","流纨束带","辟邪腰带","辟寒犀带","月影犀带","黄琅腰带","星辰之约","祥云流带","昆仑奴面具","杀手头巾","粉墨人生","行军眼罩","龙纹","黑曜石冠","琅琊梦断","蝉翼纱巾","梨花带雨","花旦面具","落梅妆","鎏金额饰","月牙梳","半面妆","一口钟","鱼袋斗篷","紫鸯披风","抹月披风","天篷披风","冰河披风","流火披风","草莺斗篷","翠云裘","蓝鸳披风","沙图什","檐牙斗篷","尺玉披肩","红萼斗篷"}
    local 满级配饰={"伽蓝碎雨","翠玉扳指 ","翠玉扳指","祥云流带","琅琊梦断","半面妆","流火披风","红萼斗篷"}
    for i=1,#满级配饰 do
        if 名称==满级配饰[i] then
            return
        end
    end
    for i=1,#配饰 do
        if 名称==配饰[i] then
            return 配饰[i+1]
        end
    end
end

function 取默契属性(属性,默契,属性数量)
    if 属性== "抗中毒" or 属性== "抗封印" or 属性== "抗混乱" or 属性== "抗昏睡" or 属性== "抗鬼火" or 属性== "抗遗忘" then
        return math.ceil(math.sqrt(默契)/属性数量*0.26*10)/10
    elseif 属性=="反震率" or 属性== "反震程度" or 属性== "命中率" or 属性== "连击率" or 属性== "躲闪率" then
        return math.ceil(math.sqrt(默契)/属性数量*0.34*10)/10
    elseif 属性=="致命几率" or 属性== "狂暴几率" then
        return math.ceil(math.sqrt(默契)/属性数量*0.36*10)/10
    elseif 属性=="抗震慑" then
        return math.ceil(math.sqrt(默契)/属性数量*0.15*10)/10
    elseif 属性=="抗毒伤害" then
        return math.ceil(math.sqrt(默契)/属性数量*80)
    elseif 属性=="每回合HP" then
        return math.ceil(math.sqrt(默契)/属性数量*50)
    elseif 属性=="抗三尸虫" then
        return math.ceil(math.sqrt(默契)/属性数量*52)
    elseif 属性=="连击次数" then
        return math.ceil(math.sqrt(默契)/属性数量*0.08)
    elseif 属性=="物理吸收" then
        return math.ceil(math.sqrt(默契)/属性数量*0.32*10)/10
    elseif 属性=="附加速度" then
        return math.ceil(math.sqrt(默契)/属性数量*0.6)
    elseif 属性=="灵性" or 属性== "根骨" or 属性== "力量" or 属性== "敏捷" then
        -- print(默契,属性数量)
        return math.ceil(math.sqrt(默契)/属性数量*0.3)
    elseif 属性=="尘埃落定" or 属性== "化血成碧" or 属性== "上善若水" or 属性== "灵犀一点" or 属性== "明珠有泪" or 属性== "美人迟暮" or 属性== "抗反震" then
        return math.ceil(math.sqrt(默契)/属性数量*200)
    end
    return 0
end

function 默契面具属性( )
    return {"命中率","连击率","抗封印","抗昏睡","抗混乱","附加速度","抗遗忘","抗鬼火","抗三尸虫","连击次数"}
end

function 默契披风属性( )
    return {"附加速度","抗遗忘","抗鬼火","抗三尸虫","每回合HP","反震率","躲闪率","狂暴几率"}
end

function 默契挂件属性( )
    return {"致命几率","抗封印","抗昏睡","抗混乱","附加速度","反震程度","狂暴几率"}
end

function 默契腰带属性( )
    return {"连击率","抗震慑","附加速度","抗遗忘","抗鬼火","抗三尸虫","每回合HP","反震率","反震程度","狂暴几率"}
end

function 默契戒指属性( )
    return {"力量","灵性","根骨","敏捷","附加速度","抗毒伤害","物理吸收","抗反震","尘埃落定","化血成碧","上善若水","灵犀一点","明珠有泪","美人迟暮"}
end

function 无默契面具属性( )
    return {"命中率","狂暴几率","连击率","附加速度","抗中毒","抗封印","抗昏睡","抗混乱","每回合HP","反击率","附加气血","抗遗忘","抗鬼火","抗三尸虫","反震程度"}
end

function 无默契面具数值( )
    return {15,12,15,25,7.5,7.5,7.5,7.5,200,14,4000,7.5,7.5,1300,14}
end

function 无默契披风属性( )
    return {"躲闪率","致命几率","连击次数","物理吸收","反击次数","加成攻击","火系吸收","雷系吸收","附加速度","抗遗忘","抗鬼火","抗三尸虫"}
end

function 无默契披风数值( )
    return {15,12,5,14,5,10,7.5,7.5,25,7.5,7.5,7.5,7.5,1300}
end

function 无默契挂件属性( )
    return {"致命几率","抗致命几率","物理吸收","反震率","抗中毒","抗封印","抗昏睡","抗混乱","加成攻击","附加攻击","附加速度"}
end

function 无默契挂件数值( )
    return {12,15,14,14,7.5,7.5,7.5,7.5,7.5,7.5,7.5,7.5,10,1000,25}
end

function 无默契腰带属性( )
    return {"抗致命几率","狂暴几率","反震率","反震程度","抗震慑","附加攻击","每回合HP","附加速度","附加气血","抗遗忘","抗鬼火"}
end

function 无默契腰带数值( )
    return {15,12,14,14,4,1000,200,25,4000,7.5,7.5,1300}
end

function 无默契戒指属性( )
    return {"力量","灵性","根骨","敏捷","附加速度","抗毒伤害","尘埃落定","化血成碧","上善若水","灵犀一点","明珠有泪","美人迟暮","抗反震"}
end

function 无默契戒指数值( )
    return {7.5,7.5,7.5,7.5,25,1200,2400,2400,2400,2400,2400,2400,2400}
end