-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2023-04-06 19:05:22
-- @Last Modified time  : 2024-10-26 21:17:43

local 任务 = {
    名称 = '称谓8_一万三千年之前',
    别名 = '一万三千年之前(八称)',
    类型 = '称谓剧情',
    是否可取消 = false,
	是否可追踪 = true
}

function 任务:任务初始化(玩家, ...)
    self.挑战 = {天 = 0, 地 = 0, 人 = 0}
    self.当前目标=''
end

function 任务:任务上线(玩家)
    --self:删除()
end

function 任务:任务更新(玩家, sec)

end

local _详情 = {
	'  前往#Y龙窟七层#W找#u#G#m({龙窟七层,22,50})孙悟空#m#u#W谈谈！',
	'  前往#Y凤巢六层#W击败#u#G#m({凤巢六层,22,50})三大战神#m#u#W，就可以唤醒#u#G#m({凤巢七层,105,59})小白#m#u#W的肉身。#Y（ALT+A攻击战神，挑战完3位战神后到凤七层唤醒#Y小白#Y的肉身。) ',
	'  前往#Y龙窟七层#W将金箍棒交给#u#G#m({龙窟七层,22,50})孙悟空#m#u#W。(将金箍棒ALT+G给予孙悟空）'
}
local _追踪描述 = {
	'  前往#Y龙窟七层#W找#u#G#m({龙窟七层,22,50})孙悟空#m#u#W谈谈！',
	'  前往#Y凤巢六层#W击败#u#G#m({凤巢六层,22,50})三大战神#m#u#W，就可以唤醒#u#G#m({凤巢七层,105,59})小白#m#u#W的肉身。#Y（ALT+A攻击战神，挑战完3位战神后到凤七层唤醒#Y小白#Y的肉身。) ',
	'  前往#Y龙窟七层#W将金箍棒交给#u#G#m({龙窟七层,22,50})孙悟空#m#u#W。#Y(将金箍棒ALT+G给予孙悟空）'
}

function 任务:任务取追踪(玩家)
    return _追踪描述[self.进度+1]
end
function 任务:任务取详情(玩家)
    return _详情[self.进度 + 1]
end

local _台词 = {
    '有意思，像你这样能走到这里来的家伙可不多---看来你一定找我很久了。没错，我就是大闹天宫的齐天大~~~~~~~圣!看起来很落魄吧?',
    --1
    '哇，你怎么会变成这样?',
    --2
    '哼，要不是我上了菩提和如来那两个老小子的当，我也不会落到今天这个地步。我会连观音那小丫头也斗不过?老孙我一万五千年前在道上混的时候，她还是个小毛孩子呢... ...',
    --3
    '那为什么你现在会这么不济呢?',
    --4
    '该死的九生九死，让我连全盛时期的十分之一的力量也发挥不出来，就算我打破琉璃盏把小白的灵魂救了出来，就算我穿梭时空，三界也不容许我俩在一起...只要我不能发挥全部的力量，我就斗不过天宫和佛祖那帮人....',
    --5
    '你想怎么办?',
    --6
    '现在唯一的办法，如果拿到我的#R金箍棒#W，我也许能够多恢复一些功力。但金箍和金箍棒都在小白的肉身之上，小白的肉身被沉在#R凤巢七层#W的熔岩里， 已经经历一万多年，那里有功力绝高的#R天、地、人守护神#W在守护，要同时打败他们三个才能唤醒小白，凭我现在的功力是进不去了，你能见到我也许你可以做的到？',
    --7
    '我试试看吧。',
    --8
    '真了不起，你能打破三界战神的守护来到这里，在三界里也算是数一数二的实力了。你终于见到了我，三界闻之色变的大魔头，一万三千年前升天而去，杀尽众神的纯阴女妖，白骨尸魔.....呵呵，可是他们没有告诉你我为什么会变成那样。',
    --9
    '对，我正想问你，你究竟是怎么炼成纯阴妖气，又为什么要上天杀尽众神呢?',
    --10
    '你一定也听说了，我和孙悟空之间那不为三界所容的感情，当我们的感情被发现以后，我被师傅菩提囚禁了起来，当时，满心期待地等看孙悟空来救我的我并不知道他已经经历了九生九死的磨难，当我看到孙悟空历尽千辛万苦走到我的面前，然后又受无感情地拂手离开，我惊呆了。当我看到孙悟空被招安，成为天宫的仙官，和另一个叫做紫霞的女人在一起的时候， 我彻底绝望了，于是我抛弃了原有的人性，变成了魔，而天界的劫难也就此开始... ',
    --11
    '可是他为什么会在经历了那么辛苦的考验之后又丢下你不管呢?',
    --12
    '后来之事也只有天宫那些神仙们知道了。',
    --13
    '小白说的没错，想要恢复我的全部力量，单靠金箍棒还不够，还需要另一样东西。就是金箍，可是这个金箍我却不知道在哪里... ...'
    --14
}

function 任务:任务NPC对话(玩家, NPC)
    if NPC.名称 == '孙悟空' and NPC.台词 then
         NPC.头像 = NPC.外形
        if self.进度 == 0 then
            self.对话进度 = 0
            NPC.台词 = _台词[1]
            NPC.结束 = false
        elseif self.进度 == 2 then
                local a =  玩家:取物品是否存在("金箍棒")
                if a  then
                else
                    NPC.台词 = "我要的东西呢？"
                    return
                end
                local  b =    玩家:取物品是否存在("金箍棒")
                if  b then
                        b:减少(1)
                end

                    NPC.台词 = _台词[14]
                    self.对话进度 = 0
                    NPC.头像 = NPC.外形
                    self:完成(玩家)
                    玩家:刷新追踪面板()

        end
    elseif NPC.名称 == '小白' and NPC.台词 then
        if self.进度 == 1 then
            if self:挑战检测(玩家) then
                self.对话进度 = 0
                NPC.台词 = _台词[9]
                NPC.结束 = false
            end
        end
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
    if NPC.名称 == '孙悟空' then
        if self.进度 == 0 then
            if self.对话进度 == 0 then
                self.对话进度 = 1
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[2]
                NPC.结束 = false
            elseif self.对话进度 == 1 then
                self.对话进度 = 2
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[3]
                NPC.结束 = false
            elseif self.对话进度 == 2 then
                self.对话进度 = 3
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[4]
                NPC.结束 = false
            elseif self.对话进度 == 3 then
                self.对话进度 = 4
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[5]
                NPC.结束 = false
            elseif self.对话进度 == 4 then
                self.对话进度 = 5
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[6]
                NPC.结束 = false
            elseif self.对话进度 == 5 then
                self.对话进度 = 6
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[7]
                NPC.结束 = false
            elseif self.对话进度 == 6 then
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[8]
                NPC.结束 = nil
                self.进度 = 1
                玩家:刷新追踪面板()
            end
        end
    elseif NPC.名称 == '小白' then
        if self.进度 == 1 then
            if self.对话进度 == 0 then
                self.对话进度 = 1
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[10]
                NPC.结束 = false
            elseif self.对话进度 == 1 then
                self.对话进度 = 2
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[11]
                NPC.结束 = false
            elseif self.对话进度 == 2 then
                self.对话进度 = 3
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[12]
                NPC.结束 = false
            elseif self.对话进度 == 3 then
                self.对话进度 = 4
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[13]
                NPC.结束 = nil
                玩家:添加物品({生成物品 {名称 = '金箍棒', 数量 = 1}})
                self.进度 = 2
                玩家:刷新追踪面板()
            end
        end
    end
end

function 任务:完成(玩家)
    玩家:添加声望(7000)
    玩家:常规提示('#Y你帮助孙悟空找到了金箍棒，你在这个世界的声望提升了，你获得了7000点声望。')
    local r = 玩家:取任务('引导_升级检测')
    if r then
        r:八称完成检测(玩家, '金箍')
    end
    self:删除()
end

function 任务:任务NPC给予(玩家, NPC, cash, items)
    -- if NPC.名称 == '孙悟空' then
        if self.进度 == 2 then
            if items[1] and items[1].名称 == '金箍棒' then --
                if items[1].数量 >= 1 then
                    items[1]:接受(1)
					玩家:常规提示('#Y给予了'..NPC.名称..items[1].名称)
					玩家:常规提示('#Y小白说的没错，想要恢复我的全部力量，单靠金箍棒还不够，还需要另一样东西。就是金箍，可是这个金箍我却不知道在哪里... ...')
                    self.对话进度 = 0
                    NPC.头像 = NPC.外形
                    self:完成(玩家)
                    玩家:刷新追踪面板()
                end
            end
        end
    -- end
end

function 任务:挑战检测(玩家)
    if self.挑战.天 == 1 and self.挑战.地 == 1 and self.挑战.人 == 1 then
        return true
    end
    return false
end
function 任务:任务攻击事件(玩家, NPC)
    if NPC.名称 == '天之战神' then
        if self.进度 == 1 and self.挑战.天 == 0 then
            self.当前目标='天之战神'
            local r = 玩家:进入战斗('scripts/task/称谓剧情/称谓8_一万三千年之前.lua', self)
            if r then
                self.当前目标=''
                self.挑战.天 = 1
                玩家:添加银子(69451)
                玩家:添加经验(880000)
                玩家:常规提示('#Y你打败了天之战神获得了880000经验和69451银两。')
            end
        end
    elseif NPC.名称 == '地之战神' then
        if self.进度 == 1 and self.挑战.地 == 0 then
            self.当前目标='地之战神'
            local r = 玩家:进入战斗('scripts/task/称谓剧情/称谓8_一万三千年之前.lua', self)
            if r then
                self.当前目标=''
                self.挑战.地 = 1
                玩家:添加银子(69451)
                玩家:添加经验(880000)
                玩家:常规提示('#Y你打败了地之战神获得了880000经验和79451银两。')
            end
        end
    elseif NPC.名称 == '人之战神' then
        if self.进度 == 1 and self.挑战.人 == 0 then
            self.当前目标='人之战神'
            local r = 玩家:进入战斗('scripts/task/称谓剧情/称谓8_一万三千年之前.lua', self)
            if r then
                self.当前目标=''
                self.挑战.人 = 1
                玩家:添加银子(69451)
                玩家:添加经验(880000)
                玩家:常规提示('#Y你打败了人之战神获得了880000经验和69451银两。')
            end
        end
    end
end

local _怪物 = {
    {
        { 名称 = "天之战神", 外形 = 2072, 等级=80, 血初值 = 7300, 法初值 = 1500, 攻初值 = 1600, 敏初值 = 350,技能={'天诛地灭','电闪雷鸣'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'借刀杀人'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'借刀杀人'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'电闪雷鸣'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'借刀杀人'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'电闪雷鸣'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'借刀杀人'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'电闪雷鸣'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'借刀杀人'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'借刀杀人'}}
        },
    {
        { 名称 = "地之战神", 外形 = 2072, 等级=80, 血初值 = 7300, 法初值 = 1500, 攻初值 = 1600, 敏初值 = 350,技能={'阎罗追命','销魂蚀骨'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'借刀杀人'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'借刀杀人'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'电闪雷鸣'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'借刀杀人'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'电闪雷鸣'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'借刀杀人'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'电闪雷鸣'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'借刀杀人'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'借刀杀人'}}
        },
    {
        { 名称 = "人之战神", 外形 = 2072, 等级=80, 血初值 = 7300, 法初值 = 1500, 攻初值 = 1600, 敏初值 = 350,技能={'失心狂乱','借刀杀人'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'借刀杀人'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'借刀杀人'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'电闪雷鸣'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'借刀杀人'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'电闪雷鸣'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'借刀杀人'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'电闪雷鸣'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'借刀杀人'}},
        { 名称 = "野蛮王", 外形 = 2026, 等级=80, 血初值 = 400, 法初值 = 500, 攻初值 = 400, 敏初值 = 180,技能={'借刀杀人'}}
        }
}

function 任务:战斗初始化(玩家)--生成战斗怪物(生成怪物属性(怪物[1],'简单'))
    local r = 玩家:取任务('称谓8_一万三千年之前')
    if r then
        if r.当前目标=='天之战神' then
            for i = 1, math.random(5,9) do
                local 难度='中等'
                if i == 1 then 难度='困难' end
                local r = 生成战斗怪物(生成怪物属性(_怪物[1][i],难度))
                self:加入敌方(i, r)
            end
        elseif r.当前目标=='地之战神' then
            for i = 1, math.random(5,9) do
                local 难度='中等'
                if i == 1 then 难度='困难' end
                local r = 生成战斗怪物(生成怪物属性(_怪物[2][i],难度))
                self:加入敌方(i, r)
            end
        elseif r.当前目标=='人之战神' then
            for i = 1, math.random(5,9) do
                local 难度='中等'
                if i == 1 then 难度='困难' end
                local r = 生成战斗怪物(生成怪物属性(_怪物[3][i],难度))
                self:加入敌方(i, r)
            end
        end
    end
end

function 任务:战斗回合开始(dt)
end

function 任务:战斗结束(x, y)
end

return 任务
