-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2023-04-06 19:05:22
-- @Last Modified time  : 2024-10-26 20:59:23

local 任务 = {
    名称 = '称谓7_拯救唐僧',
    别名 = '拯救唐僧(七称)',
    类型 = '称谓剧情',
    是否可取消 = false,
	是否可追踪 = true
}

function 任务:任务初始化(玩家, ...)
    self.挑战 = {翻天鬼 = 0, 冰风怪 = 0}
    self.索要物品 = {龙鳞 = 0, 绿烟如梦 = 0}
    self.当前目标=''
end

function 任务:任务上线(玩家)
    --self:删除()
end

function 任务:任务更新(玩家, sec)
end

local _详情 = {
	'  前往#Y化生寺#W找#u#G#m({玄空僧房,16,10})玄空#m#u#W谈谈！',
	'  前往#Y潮音洞#W找#u#G#m({潮音洞,26,16})观音姐姐#m#u#W看看有什么办法！',
	'  去#Y北俱芦洲#W找到#u#G#m({北俱芦洲,197,148})冰风怪#m#u#W要#R经烟如梦#W、#u#G#m({北俱芦洲,75,123})翻天鬼#m#u#W要#R龙鳞#W交给龙窟的、#u#G#m({龙窟四层,46,42})天一神将#m#u#W( ALT+A攻击冰风怪、翻天鬼，得到龙鳞和绿烟如梦后ALT+G给予天一神将)',
	'  前往#Y化生寺#W将仙露交给#u#G#m({玄空僧房,19,10})玄奘#m#u',
	'  完成了观音姐姐的嘱托，是回去找#u#G#m({潮音洞,26,16})观音姐姐#m#u#W的时候了'
}

local _追踪描述 = {
	'  前往#Y化生寺#W找#u#G#m({玄空僧房,16,10})玄空#m#u#W谈谈！',
	'  前往#Y潮音洞#W找#u#G#m({潮音洞,26,16})观音姐姐#m#u#W看看有什么办法！',
	'  去#Y北俱芦洲#W找到#u#G#m({北俱芦洲,197,148})冰风怪#m#u#W要#R经烟如梦#W、#u#G#m({北俱芦洲,75,123})翻天鬼#m#u#W要#R龙鳞#W交给龙窟的、#u#G#m({龙窟四层,46,42})天一神将#m#u#W( ALT+A攻击冰风怪、翻天鬼，得到龙鳞和绿烟如梦后ALT+G给予天一神将)',
	'  前往#Y化生寺#W将仙露交给#u#G#m({玄空僧房,19,10})玄奘#m#u',
	'  完成了观音姐姐的嘱托，是回去找#u#G#m({潮音洞,26,16})观音姐姐#m#u#W的时候了'
}

function 任务:任务取追踪(玩家)
    return _追踪描述[self.进度+1]
end
function 任务:任务取详情(玩家)
    return _详情[self.进度 + 1]
end

local _台词 = {
    '大师兄#R玄奘#W不知道什么缘故染上了怪病，这几天发了高热，一直昏迷不醒，危在旦夕，我们找了许多草药都不管用，医生也说大师兄快不行了... ...',
    --1
    '玄奘可是佛祖钦点的取经人，他要是死了怎么办? ',
    --2
    '我想，现在唯一的办法，只有去求南海普陀山潮音洞的#R观音大士#W，也许她还能救大师兄一命。',
    --3
    '你的来意我已经知道了。可以告诉你，现世没有任何药物可以去治玄奘现在所患的病，实际上，玄奘得的并不是病，而是#R因果#W。',
    --4
    '(观音姐姐真是厉害啊) 什么因果?说来听听?',
    --5
    '因为孙悟空带着白骨仙回到了500年前，而500年前，金蝉子还没有转世成为玄奘，孙悟空想趁这个时机和牛魔王联手，他们之所以想吃掉玄奘的前世金蝉子，因为金蝉子的肉可以祛除孙悟空身上因为九生九死的考验而染上的妖气，恢复纯阳之体。前世的金蝉子遭遇危机，今生的玄奘才会生命垂危... ...',
    --6
    '那玄奘岂不是没救了?',
    --7
    '无论如何，玄奘是佛祖选中的取经之人，绝不能死，我会用法力扭转时空回到500年前，收复孙悟空这只妖猴，而在这之前，你无论如何也要保住玄奘的性命。',
    --8
    '我该怎么做？',
    --9
    '光靠我的净瓶中的仙露是不足以救人的。你到#R北俱芦洲#W的冰原上去找， 那里有两只妖魔，一只叫做#R冰风怪#W一只叫做#R翻天鬼#W在他们身上，藏有#R绿烟如梦#W和#R龙鳞#W，你得到这两样东西以后，交给#R龙窟#W里的#R天一神将#W ，他会帮你把两药融合到我的净瓶仙露中，然后你再拿仙露回去给玄奘服下，应该可以让他支持一段时间，办完了这些事以后你再来找我吧。',
    --10
    '观音大士托嘱我告诉你快带着仙露去救治玄奘。',
    --11
    '多谢，我感觉好多了....真奇怪，我想我可能快要好了。',
    --12
    '恩，在你为仙露奔波的时候，我已经回到500年前收复了孙悟空，他的人格分裂成了两个部分，一部分回到现世，重新轮回，现在是五指山#R斧头帮帮主#W了，而另一部分则损失了大部分的法力，留在不变的常世，陪伴者白骨仙的肉身。',
    --13
    '常世与现世?什么意思?',
    --14
    '你不用明白----哎，可惜他的这份感情是绝不会为三界所容的，谁也帮不了他。'
    --15
}

function 任务:任务NPC对话(玩家, NPC)
     NPC.头像 = NPC.外形
    if NPC.名称 == '玄空' and NPC.台词 then
        if self.进度 == 0 then
            self.对话进度 = 0
            NPC.台词 = _台词[1]
            NPC.结束 = false
        end
    elseif NPC.名称 == '观音姐姐' and NPC.台词 then
        if self.进度 == 1 then
            self.对话进度 = 0
            NPC.台词 = _台词[4]
            NPC.结束 = false
        elseif self.进度 == 4 then
            self.对话进度 = 0
            NPC.台词 = _台词[13]
            NPC.结束 = false
        end
    elseif NPC.名称 == '玄奘' and NPC.台词 then
        if self.进度 == 3 then
                local a =  玩家:取物品是否存在("仙露")
                if a  then
                else
                    NPC.台词 = "我要的东西呢？"
                    return
                end
                local  b =    玩家:取物品是否存在("仙露")
                if  b then
                        b:减少(1)
                end
                    NPC.台词 = _台词[12]
                    self.进度 = 4
                    玩家:刷新追踪面板()

        end
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
    if NPC.名称 == '玄空' then
        if self.进度 == 0 then
            if self.对话进度 == 0 then
                self.对话进度 = 1
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[2]
                NPC.结束 = false
            elseif self.对话进度 == 1 then
                self.进度 = 1
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[3]
                NPC.结束 = nil
                玩家:刷新追踪面板()
            end
        end
    elseif NPC.名称 == '观音姐姐' then
        if self.进度 == 1 then
            if self.对话进度 == 0 then
                self.对话进度 = 1
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[5]
                NPC.结束 = false
            elseif self.对话进度 == 1 then
                self.对话进度 = 2
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[6]
                NPC.结束 = false
            elseif self.对话进度 == 2 then
                self.对话进度 = 3
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[7]
                NPC.结束 = false
            elseif self.对话进度 == 3 then
                self.对话进度 = 4
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[8]
                NPC.结束 = false
            elseif self.对话进度 == 4 then
                self.对话进度 = 5
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[9]
                NPC.结束 = false
            elseif self.对话进度 == 5 then
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[10]
                NPC.结束 = nil
                self.进度 = 2
                玩家:刷新追踪面板()
            end
        elseif self.进度 == 4 then
            if self.对话进度 == 0 then
                self.对话进度 = 1
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[14]
                NPC.结束 = false
            elseif self.对话进度 == 1 then
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[15]
                NPC.结束 = nil
                self:完成(玩家)
                玩家:刷新追踪面板()
            end
        end
    end
end

function 任务:完成(玩家)
    玩家:添加声望(5500)
    玩家:常规提示('#Y因为你挽救了取经人玄裝的性命，你在这个世界的声望值获得了提升，你得到了5500点声望。')
    local r = 玩家:取任务('引导_升级检测')
    if r then
        r:七称完成检测(玩家, '唐僧')
    end
    self:删除()
end

function 任务:任务NPC给予(玩家, NPC, cash, items)
    if self.进度 == 2 then
        if items[1] and (items[1].名称 == '龙鳞' or items[1].名称 == '绿烟如梦') then --
            if items[1].数量 >= 1 then
                local k = items[1].名称
                items[1]:接受(1)
                self.索要物品[k] = 1
				玩家:常规提示('#Y给予了'..NPC.名称..items[1].名称)
                if self.索要物品.龙鳞 == 1 and self.索要物品.绿烟如梦 == 1 then
                    self.进度 = 3
                    玩家:刷新追踪面板()
                    玩家:添加物品({生成物品 {名称 = '仙露', 数量 = 1}})
                    NPC.头像 = NPC.外形
                    NPC.台词 = _台词[11]
                end
            end
        end
    elseif self.进度 == 3 then
            if items[1] and items[1].名称 == '仙露' then --
                if items[1].数量 >= 1 then
                    items[1]:接受(1)
    				玩家:常规提示('#Y给予了'..NPC.名称..items[1].名称)
                    NPC.头像 = NPC.外形
                    NPC.台词 = _台词[12]
                    self.进度 = 4
                    玩家:刷新追踪面板()
                end
            end
    end
end

function 任务:任务攻击事件(玩家, NPC)
    if NPC.名称 == '翻天鬼' then
        if self.进度 == 2 and self.挑战.翻天鬼 == 0 then
            self.当前目标='翻天鬼'
            local r = 玩家:进入战斗('scripts/task/称谓剧情/称谓7_拯救唐僧.lua', self)
            if r then
                self.当前目标=''
                self.挑战.翻天鬼 = 1
                玩家:添加物品({生成物品 {名称 = '龙鳞', 数量 = 1}})
                玩家:添加银子(4218)
                玩家:添加经验(678000)
                玩家:常规提示('#R你获得678000经验和4218两银子！')
            end
        end
    elseif NPC.名称 == '冰风怪' then
        if self.进度 == 2 and self.挑战.冰风怪 == 0 then
            self.当前目标='冰风怪'
            local r = 玩家:进入战斗('scripts/task/称谓剧情/称谓7_拯救唐僧.lua', self)
            if r then
                self.当前目标=''
                self.挑战.冰风怪 = 1
                玩家:添加物品({生成物品 {名称 = '绿烟如梦', 数量 = 1}})
                玩家:添加银子(4218)
                玩家:添加经验(678000)
                玩家:常规提示('#R你获得678000经验和4218两银子！')
            end
        end
    end
end

local _怪物 = {
    {
        { 名称 = "冰风怪", 外形 = 2072, 气血 = 164000, 魔法 = 8000, 攻击 = 13000, 速度 = 460,抗性={物理吸收=50} },
        { 名称 = "白虎", 外形 = 2038, 气血 = 14000, 魔法 = 18000, 攻击 = 13000, 速度 = 460,抗性={物理吸收=10} },
        { 名称 = "白虎", 外形 = 2038, 气血 = 14000, 魔法 = 18000, 攻击 = 13000, 速度 = 460,抗性={物理吸收=10 },},
        { 名称 = "两角怪", 外形 = 2013, 气血 = 14000, 魔法 = 18000, 攻击 = 13000, 速度 = 460,抗性={物理吸收=10} },
        { 名称 = "两角怪", 外形 = 2013, 气血 = 14000, 魔法 = 18000, 攻击 = 13000, 速度 = 460,抗性={物理吸收=10} },
        { 名称 = "冰熊", 外形 = 2040, 气血 = 14000, 魔法 = 18000, 攻击 = 13000, 速度 = 460,抗性={物理吸收=10} }
        },
    {
        { 名称 = "翻天鬼", 外形 = 2074, 气血 = 84000, 魔法 = 8000, 攻击 = 13000, 速度 = 460,抗性={物理吸收=50} },
        { 名称 = "白虎", 外形 = 2038, 气血 = 14000, 魔法 = 18000, 攻击 = 13000, 速度 = 460,抗性={物理吸收=10} },
        { 名称 = "白虎", 外形 = 2038, 气血 = 14000, 魔法 = 18000, 攻击 = 13000, 速度 = 460,抗性={物理吸收=10 }, },
        { 名称 = "两角怪", 外形 = 2013, 气血 = 14000, 魔法 = 18000, 攻击 = 13000, 速度 = 460,抗性={物理吸收=10} },
        { 名称 = "两角怪", 外形 = 2013, 气血 = 14000, 魔法 = 18000, 攻击 = 13000, 速度 = 460,抗性={物理吸收=10} },
        { 名称 = "冰熊", 外形 = 2040, 气血 = 14000, 魔法 = 18000, 攻击 = 13000, 速度 = 460,抗性={物理吸收=10} }
        }
}
function 任务:战斗初始化(玩家)
    local r = 玩家:取任务('称谓7_拯救唐僧')
    if r then
        if r.当前目标=='翻天鬼' then
            for i = 1, 6 do
                local r = 生成战斗怪物(_怪物[2][i])
                self:加入敌方(i, r)
            end
        elseif r.当前目标=='冰风怪' then
            for i = 1, 6 do
                local r = 生成战斗怪物(_怪物[1][i])
                self:加入敌方(i, r)
            end
        end
    end

end

function 任务:战斗回合开始(dt)
end

function 任务:战斗结束(x, y)
end

return 任务
