-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2023-04-11 04:21:56
-- @Last Modified time  : 2024-10-26 22:38:20

local 任务 = {
    名称 = '称谓10_九生九死',
    别名 = '九生九死(十称)',
    类型 = '称谓剧情',
    是否可取消 = false,
	是否可追踪 = true
}

function 任务:任务初始化(玩家, ...)
    self.菩提进程 = 1
end

function 任务:任务上线(玩家)
    --self:删除()
end

function 任务:任务更新(玩家, sec)
end

local _详情 = {
    '	将金箍交给#Y龙窟七层#W的#u#G#m({龙窟七层,25,51})孙悟空#m#u#W，劝他走上取经之路。(请将金箍ALT+G给予孙悟空后对话)',
    '	去#Y蟠桃园后#W找#u#G#m({蟠桃园后,25,195})鸿蒙老祖#m#u#W接受九生九死的考验。（战斗考验）',
    '	回#Y龙窟七层#W劝说#u#G#m({龙窟七层,25,51})孙悟空#m#u#W，带上金箍。'
}
local _追踪描述 = {
    '	将金箍交给#Y龙窟七层#W的#u#G#m({龙窟七层,25,51})孙悟空#m#u#W，劝他走上取经之路。(请将金箍ALT+G给予孙悟空后对话)',
    '	去#Y蟠桃园后#W找#u#G#m({蟠桃园后,25,195})鸿蒙老祖#m#u#W接受九生九死的考验。（战斗考验）',
    '	回#Y龙窟七层#W劝说#u#G#m({龙窟七层,25,51})孙悟空#m#u#W，带上金箍。'
}

function 任务:任务取追踪(玩家)
    return _追踪描述[self.进度+1]
end
function 任务:任务取详情(玩家)
    return _详情[self.进度 + 1]
end

local _台词 = {
    '嘿嘿嘿，我当然知道，要想恢复我真正的力量，必须要戴上金箍，可一戴上这鬼玩意儿，就不能再留念尘世间的情欲......如来这个老小子，又设这种圈套让我钻。',
    --1
    '可是，观音姐姐也说了，这是唯一的解决之道。',
    --2
    '什么唯一，那个女人不过是害怕惹事上身而已.- ...这样吧，除非你能像我样通过九生九死的考验，我就答应你戴上这个金箍再保唐僧!',
    --3
    '一言为定，我也正想看看那个考验有多厉害，见证一下自己的实力呢。但是要怎么才能接受九生九死的考验呢?',
    --4
    '你去#R蟠桃园#W找一个叫做#R鸿蒙老祖#W的仙人，他从三界创造之时就在那里了，他会给你考验的。',
    --5
    '这一万年来除了孙悟空以外从没有人通过这九生九死之考验，你真要尝试吗？\nmenu\n1|是，我要尝试\n99|不，我再想想',
    --6
    '一万多年来，除了我以外，你是第二个能够通过九生九死之考验的人，也许我真的应该相信你',
    --7
    '你愿意戴上这金箍，保护取经人了吗?',
    --8
    '我答应你，如果取经人准备好了，我会保护他去西天。但，这并不是悔悟，我只想去亲自见一见佛祖，问他一个问题。',
    --9
    '你想问什么?',
    --10
    '我想知道:为什么出身不同的人不能相爱，为什么相爱不能相守，为什么当初的一见钟情两小无猜，需要一万年的痛苦折磨来作为代偿，为什么一万年的痛苦折磨，换来的只是悔恨和欺骗。',
    --11
    '....... ........ .......',
    --12
    '如果天与地都不能与我公道，那我就不怕与天地为敌，与佛祖为敌。就算成为最后的大魔王，也无所畏惧，小心一点，也许我见佛的那一天，就是灭佛的那一天。'
    --13
}

function 任务:任务NPC对话(玩家, NPC)
    if NPC.名称 == '鸿蒙老祖' and NPC.台词 then
        NPC.头像 = NPC.外形
        if self.进度 == 1 then
            NPC.台词 = _台词[6]
        end
    elseif NPC.名称 == '孙悟空' and NPC.台词 then
        if self.进度 == 0 then
                 local a =  玩家:取物品是否存在("金箍")
                if a  then
                else
                    NPC.台词 = "我要的东西呢？"
                    return
                end
                local  b =    玩家:取物品是否存在("金箍")
                if  b then
                        b:减少(1)
                end
                    self.对话进度 = 0
                    NPC.头像 = NPC.外形
                     NPC.台词 = _台词[1]
                    NPC.结束 = false
        elseif self.进度 == 2 then
            self.对话进度 = 0
            NPC.台词 = _台词[7]
            NPC.结束 = false
        end
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
    if NPC.名称 == '孙悟空' then
        if self.进度 == 1 then
            if self.对话进度 == 0 then
                self.对话进度 = 1
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[2]
                NPC.结束 = false
            elseif self.对话进度 == 1 then
                self.对话进度 = 2
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[3]
                NPC.结束 = false
            elseif self.对话进度 == 2 then
                self.对话进度 = 3
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[4]
                NPC.结束 = false
            elseif self.对话进度 == 3 then
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[5]
                self.进度 = 1
                玩家:刷新追踪面板()
                NPC.结束 = nil
            end
        elseif self.进度 == 2 then
            if self.对话进度 == 0 then
                self.对话进度 = 1
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[8]
                NPC.结束 = false
            elseif self.对话进度 == 1 then
                self.对话进度 = 2
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[9]
                NPC.结束 = false
            elseif self.对话进度 == 2 then
                self.对话进度 = 3
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[10]
                NPC.结束 = false
            elseif self.对话进度 == 3 then
                self.对话进度 = 4
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[11]
                NPC.结束 = false
            elseif self.对话进度 == 4 then
                self.对话进度 = 5
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[12]
                NPC.结束 = false
            elseif self.对话进度 == 5 then
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[13]
                NPC.结束 = nil
                self:完成(玩家)
                玩家:刷新追踪面板()
            end
        end
    elseif NPC.名称 == '鸿蒙老祖' then
        if self.进度 == 1 then
            if i == '1' then
                self:任务攻击事件(玩家, NPC)
            end
        end
    end
end

function 任务:完成(玩家)
    玩家:添加声望(60000)
    玩家:常规提示('#Y你终于让孙悟空回心转意踏上了取经之路，大圣归位，你完成了这几乎不可能的任务，三界都将感谢你所做出的贡献，获得60000的声望。')
    local r = 玩家:取任务('引导_升级检测')
    if r then
        r:十称完成检测(玩家, '悟空')
    end
    self:删除()
end

function 任务:任务NPC给予(玩家, NPC, cash, items)
    -- if NPC.名称 == '孙悟空' then
        if self.进度 == 0 then
            if items[1] and items[1].名称 == '金箍' then
                if items[1].数量 >= 1 then
                    self.进度 = 1
                    玩家:刷新追踪面板()
                    self.对话进度 = 0
                    NPC.头像 = NPC.外形
						玩家:常规提示( '嘿嘿嘿，我当然知道，要想恢复我真正的力量，必须要戴上金箍，可一戴上这鬼玩意儿，就不能再留念尘世间的情欲......如来这个老小子，又设这种圈套让我钻。')
                    NPC.结束 = false
                end
            end
        end
    -- end
end

function 任务:任务攻击事件(玩家, NPC)
    if NPC.名称 == '鸿蒙老祖' then
        if self.进度 == 1 then
            -- local r = 玩家:进入战斗('scripts/task/称谓剧情/称谓10_九生九死.lua',self)
            while true do
                local r = 玩家:进入战斗('scripts/task/称谓剧情/称谓10_九生九死.lua',self)
                if r then
                    self.菩提进程 = self.菩提进程 + 1
                else
                    self.菩提进程 = 1
                    break
                end
                if self.菩提进程 == 10 then
                    self.进度 = 2
                    玩家:添加经验(4000000)
                    玩家:添加银子(27000)
                    玩家:常规提示('#Y你得到4000000点经验和27000两银子')
                    break
                end
            end
            -- if r then--菩提进程默认是1,每次胜利+1,进程为9时完成战斗
            --     self.菩提进程 = self.菩提进程 + 1
            --     if self.菩提进程 == 9 then
            --         self.进度 = 2
            --         玩家:添加经验(4000000)
            --         玩家:添加银子(27000)
            --         玩家:常规提示('#Y你得到4000000点经验和27000两银子')
            --     else
            --         玩家:进入战斗('scripts/task/称谓剧情/称谓10_九生九死.lua',self)
            --     end
            -- else
            --     self.菩提进程 = 1
            -- end
        end
    end
end

local _怪物 = {
    [1] = {
        {名称 = "独眼巨人", 外形 = 2018, 等级 = 1, 血初值 = 1, 法初值 = 1800, 攻初值 = 1300, 敏初值 = 180,施法几率 = 50 },
        {名称 = "喽啰", 外形 = 2074, 等级 = 1, 血初值 = 1, 法初值 = 1800, 攻初值 = 300, 敏初值 = 130,施法几率 = 50 },
        {名称 = "喽啰", 外形 = 2073, 等级 = 1, 血初值 = 1, 法初值 = 1800, 攻初值 = 300, 敏初值 = 130,施法几率 = 50 },
    },
    [2] = {
        {名称 = "夜叉", 外形 = 2072, 等级 = 1, 血初值 = 1, 法初值 = 1800, 攻初值 = 1400, 敏初值 = 200,施法几率 = 50 },
        {名称 = "喽啰", 外形 = 2074, 等级 = 1, 血初值 = 1, 法初值 = 1800, 攻初值 = 400, 敏初值 = 150,施法几率 = 50 },
        {名称 = "喽啰", 外形 = 2073, 等级 = 1, 血初值 = 1, 法初值 = 1800, 攻初值 = 400, 敏初值 = 150,施法几率 = 50 },
    },
    [3] = {
        {名称 = "地狱战神", 外形 = 2074, 等级 = 1, 血初值 = 1, 法初值 = 1800, 攻初值 = 1500, 敏初值 = 220,施法几率 = 50 },
        {名称 = "喽啰", 外形 = 2074, 等级 = 1, 血初值 = 1, 法初值 = 1800, 攻初值 = 500, 敏初值 = 170,施法几率 = 50 },
        {名称 = "喽啰", 外形 = 2073, 等级 = 1, 血初值 = 1, 法初值 = 1800, 攻初值 = 500, 敏初值 = 170,施法几率 = 50 },
    },
    [4] = {
        {名称 = "巨灵神", 外形 = 2088, 等级 = 1, 血初值 = 1, 法初值 = 1800, 攻初值 = 1600, 敏初值 = 240,施法几率 = 50 },
        {名称 = "喽啰", 外形 = 2074, 等级 = 1, 血初值 = 1, 法初值 = 1800, 攻初值 = 600, 敏初值 = 190,施法几率 = 50 },
        {名称 = "喽啰", 外形 = 2073, 等级 = 1, 血初值 = 1, 法初值 = 1800, 攻初值 = 600, 敏初值 = 190,施法几率 = 50 },
    },
    [5] = {
        {名称 = "龙太子",  外形 = 2287, 等级 = 1, 血初值 = 1, 法初值 = 1900, 攻初值 = 1700, 敏初值 = 260,施法几率 = 50 },
        {名称 = "喽啰", 外形 = 2074, 等级 = 1, 血初值 = 1, 法初值 = 1900, 攻初值 = 700, 敏初值 = 210,施法几率 = 50 },
        {名称 = "喽啰", 外形 = 2073, 等级 = 1, 血初值 = 1, 法初值 = 1900, 攻初值 = 700, 敏初值 = 210,施法几率 = 50 },
    },
    [6] = {
        {名称 = "复活女娲",  外形 = 2288, 等级 = 1, 血初值 = 1, 法初值 = 1900, 攻初值 = 1800, 敏初值 = 280,施法几率 = 50 },
        {名称 = "喽啰", 外形 = 2074, 等级 = 1, 血初值 = 1, 法初值 = 1900, 攻初值 = 800, 敏初值 = 230,施法几率 = 50 },
        {名称 = "喽啰", 外形 = 2073, 等级 = 1, 血初值 = 1, 法初值 = 1900, 攻初值 = 800, 敏初值 = 230,施法几率 = 50 },
    },
    [7] = {
        {名称 = "符咒女娲",  外形 = 2292, 等级 = 1, 血初值 = 1, 法初值 = 1900, 攻初值 = 1900, 敏初值 = 300,施法几率 = 50 },
        {名称 = "喽啰", 外形 = 2074, 等级 = 1, 血初值 = 1, 法初值 = 1900, 攻初值 = 900, 敏初值 = 250,施法几率 = 50 },
        {名称 = "喽啰", 外形 = 2073, 等级 = 1, 血初值 = 1, 法初值 = 1900, 攻初值 = 900, 敏初值 = 250,施法几率 = 50 },
    },
    [8] = {
        {名称 = "火神女娲",  外形 = 2291, 等级 = 1, 血初值 = 1, 法初值 = 1900, 攻初值 = 2000, 敏初值 = 320,施法几率 = 50 },
        {名称 = "喽啰", 外形 = 2074, 等级 = 1, 血初值 = 1, 法初值 = 1900, 攻初值 = 1000, 敏初值 = 270,施法几率 = 50 },
        {名称 = "喽啰", 外形 = 2073, 等级 = 1, 血初值 = 1, 法初值 = 1900, 攻初值 = 1000, 敏初值 = 270,施法几率 = 50 },
    },
    [9] = {
        {名称 = "战神女娲",  外形 = 2289, 等级 = 1, 血初值 = 1, 法初值 = 1900, 攻初值 = 2100, 敏初值 = 340,施法几率 = 50 },
        {名称 = "喽啰", 外形 = 2074, 等级 = 1, 血初值 = 1, 法初值 = 1900, 攻初值 = 1100, 敏初值 = 290,施法几率 = 50 },
        {名称 = "喽啰", 外形 = 2073, 等级 = 1, 血初值 = 1, 法初值 = 1900, 攻初值 = 1100, 敏初值 = 290,施法几率 = 50 },
    },
}

function 任务:战斗初始化(玩家,v)
    local 进程
    if v.菩提进程 then
        进程 = v.菩提进程
    else
        local r = 玩家:取任务('称谓10_九生九死')
        if r then
            进程 = r.菩提进程
        end
    end
    print(进程)
    if 进程 then
        for i=1,3 do
            local 法术,难度 = '中级法术','中等'
            if i == 1 then 法术 = '高级法术' 难度 = '困难' end
            local r = 生成战斗怪物(生成怪物属性(_怪物[进程][i] , 难度 , nil , 法术))
            self:加入敌方(i, r)
        end
    end
end

function 任务:战斗回合开始(dt)
end

function 任务:战斗结束(x, y)
end

return 任务
