-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2023-04-06 19:05:22
-- @Last Modified time  : 2024-10-26 21:11:59

local 任务 = {
    名称 = '称谓8_妙法莲华经',
    别名 = '妙法莲华经(八称)',
    类型 = '称谓剧情',
    是否可取消 = false,
	是否可追踪 = true
}

function 任务:任务初始化(玩家, ...)
end

function 任务:任务上线(玩家)
    --self:删除()
end

function 任务:任务更新(玩家, sec)
end

local _详情 = {
	'  前往#Y傲来国#W找#u#G#m({傲来国,318,36})紫霞#m#u#W谈谈！',
	'  去#Y金山寺#W问问#u#G#m({金山寺大殿,23,16})法明方丈#m#u#W“妙法莲华经”',
	'  去#Y龙窟#W击败#u#G#m({龙窟六层,30,60})断情蛛#m#u#W。#W，夺回妙法莲华经#W。#Y（ALT+A攻击断情蛛）',
	'  将妙法莲华经交给#u#G#m({傲来国,318,36})紫霞#m#u#W。(请将妙法莲华经ALT+G给予紫霞）'
}
local _追踪描述 = {
	'  前往#Y傲来国#W找#u#G#m({傲来国,318,36})紫霞#m#u#W谈谈！',
	'  去#Y金山寺#W问问#u#G#m({金山寺大殿,23,16})法明方丈#m#u#W“妙法莲华经”',
	'  去#Y龙窟#W击败#u#G#m({龙窟六层,30,60})断情蛛#m#u#W。#W，夺回妙法莲华经#W。#Y（ALT+A攻击断情蛛）',
	'  将妙法莲华经交给#u#G#m({傲来国,318,36})紫霞#m#u#W。(请将妙法莲华经ALT+G给予紫霞）'
}

function 任务:任务取追踪(玩家)
    return _追踪描述[self.进度+1]
end
function 任务:任务取详情(玩家)
    return _详情[self.进度 + 1]
end

local _台词 = {
    '我想，你一定很奇怪我，孙悟空，小白，我们三个人之间的关系。',
    --1
    '对。到底是怎么回事？',
    --2
    '我本是佛祖前的一颗灯芯，一万三千年前我遇到了那个叫做孙悟空的男人，曾经是灯芯的我，拥有窥视人心的能力，我隐约能够看到孙悟空黑暗的过去,当时他的内心被禁咒封锁，忘记了一切。',
    --3
    '你是说他有一段时间丧失了记忆？',
    --4
    '没错。只有妙法莲华经能找回孙悟空的记忆,听说此经书现在就是金山寺',
    --5
    '妙法莲华经被#R龙窟六层的断情蛛#W偷走了，那是只夺天地造化的可怕巨大蜘蛛，我劝你还是算了吧！',
    --6
    '受人之托，忠人之事，怎么能算了呢？',
    --7
    '谢谢你为我取来经书。我终于可以解脱。既然悟空并不爱我，那我也不会再留恋这凡尘俗世了,毫........... 作为报答，我会告诉你-一万三千年前的一些事情，如果你想知道的话。',
    --8
    '当然想知道啊！'
    --9
}

function 任务:任务NPC对话(玩家, NPC)
    if NPC.名称 == '紫霞' and NPC.台词 then
        if self.进度 == 0 then
            self.对话进度 = 0
			NPC.头像 = NPC.外形
            NPC.台词 = _台词[1]
            NPC.结束 = false
        elseif self.进度 == 3 then
                local a =  玩家:取物品是否存在("妙法莲华经")
                if a  then
                else
                    NPC.台词 = "我要的东西呢？"
                    return
                end
                local  b =    玩家:取物品是否存在("妙法莲华经")
                if  b then
                        b:减少(1)
                end
                    self.对话进度 = 0
                    NPC.台词 = _台词[8]
                    NPC.头像 = NPC.外形
                    NPC.结束 = false

        end
    elseif NPC.名称 == '法明方丈' and NPC.台词 then
        if self.进度 == 1 then
            self.对话进度 = 0
			NPC.头像 = NPC.外形
            NPC.台词 = _台词[6]
            NPC.结束 = false
        end
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
    if NPC.名称 == '紫霞' then
        if self.进度 == 0 then
            if self.对话进度 == 0 then
                self.对话进度 = 1
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[2]
                NPC.结束 = false
            elseif self.对话进度 == 1 then
                self.对话进度 = 2
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[3]
                NPC.结束 = false
            elseif self.对话进度 == 2 then
                self.对话进度 = 3
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[4]
                NPC.结束 = false
            elseif self.对话进度 == 3 then
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[5]
                NPC.结束 = nil
                self.进度 = 1
                玩家:刷新追踪面板()
            end
        elseif self.进度 == 3 then
            if self.对话进度==0 then
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[9]
                NPC.结束 = nil
                self:完成(玩家)
                玩家:刷新追踪面板()
            end
        end
    elseif NPC.名称 == '法明方丈' then
        if self.进度 == 1 then
            if self.对话进度 == 0 then
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[7]
                NPC.结束 = nil
                self.进度 = 2
                玩家:刷新追踪面板()
            end
        -- body
        end
    end
end

function 任务:完成(玩家)
    玩家:添加声望(7000)
    玩家:常规提示('#Y你帮助紫霞仙子归位，你在这个世界的声望提升了，你获得了7000的声望。')
    local r = 玩家:取任务('引导_升级检测')
    if r then
        r:八称完成检测(玩家, '妙法')
    end
    self:删除()
end

function 任务:任务NPC给予(玩家, NPC, cash, items)
    -- if NPC.名称 == '紫霞' then
        if self.进度 == 3 then
            if items[1] and items[1].名称 == '妙法莲华经' then --
                if items[1].数量 >= 1 then
                    items[1]:接受(1)
                    self.对话进度 = 0
					玩家:常规提示('#Y给予了'..NPC.名称..items[1].名称)
					玩家:常规提示('#Y与紫霞仙子对话')
                    NPC.头像 = NPC.外形
                    NPC.结束 = false
                end
            end
        end
    -- end
end

function 任务:任务攻击事件(玩家, NPC)
    if NPC.名称 == '断情蛛' then
        if self.进度 == 2 then
            local r = 玩家:进入战斗('scripts/task/称谓剧情/称谓8_妙法莲华经.lua', self)
            if r then
                玩家:添加物品({生成物品 {名称 = '妙法莲华经', 数量 = 1}})
                玩家:添加银子(51066)
                玩家:添加经验(938000)
                玩家:常规提示('#Y你得到938000点经验和51066两银子和妙法莲华经。')
                self.进度 = 3
                玩家:刷新追踪面板()
            end
        end
    end
end

local _怪物 = {
    { 名称 = "断情蛛", 外形 = 2065, 等级=80, 血初值 = 3300, 法初值 = 500, 攻初值 = 1000, 敏初值 = 300},
    { 名称 = "地狱战神", 外形 = 2074, 等级=80, 血初值 = 200, 法初值 = 500, 攻初值 = 400, 敏初值 = 180},
    { 名称 = "地狱战神", 外形 = 2074, 等级=80, 血初值 = 200, 法初值 = 500, 攻初值 = 400, 敏初值 = 180},
    { 名称 = "地狱战神", 外形 = 2074, 等级=80, 血初值 = 200, 法初值 = 500, 攻初值 = 400, 敏初值 = 180},
    { 名称 = "地狱战神", 外形 = 2074, 等级=80, 血初值 = 200, 法初值 = 500, 攻初值 = 400, 敏初值 = 180},
    { 名称 = "地狱战神", 外形 = 2074, 等级=80, 血初值 = 200, 法初值 = 500, 攻初值 = 400, 敏初值 = 180},
    { 名称 = "地狱战神", 外形 = 2074, 等级=80, 血初值 = 200, 法初值 = 500, 攻初值 = 400, 敏初值 = 180},
    { 名称 = "地狱战神", 外形 = 2074, 等级=80, 血初值 = 200, 法初值 = 500, 攻初值 = 400, 敏初值 = 180},
    { 名称 = "地狱战神", 外形 = 2074, 等级=80, 血初值 = 200, 法初值 = 500, 攻初值 = 400, 敏初值 = 180},
    { 名称 = "地狱战神", 外形 = 2074, 等级=80, 血初值 = 200, 法初值 = 500, 攻初值 = 400, 敏初值 = 180}
}

function 任务:战斗初始化(玩家)
    for i = 1, math.random(5,9) do
        local 随机法术='低级法术'
        if i==1 then 随机法术='中级法术' end
        local r = 生成战斗怪物(生成怪物属性(_怪物[i],'中等',nil,随机法术))
        self:加入敌方(i, r)
    end
end

function 任务:战斗回合开始(dt)
end

function 任务:战斗结束(x, y)
end

return 任务
