-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2023-04-11 04:21:56
-- @Last Modified time  : 2024-10-26 22:43:06

local 任务 = {
    名称 = '称谓9_抹杀孙悟空',
    别名 = '抹杀孙悟空(九称)',
    类型 = '称谓剧情',
    是否可取消 = false,
	是否可追踪 = true
}

function 任务:任务初始化(玩家, ...)
    self.玉帝进程 = 0
end

function 任务:任务上线(玩家)
    --self:删除()
end

function 任务:任务更新(玩家, sec)
end

local _详情 = {
	'  前往#Y凌霄宝殿#W找#u#G#m({凌霄宝殿,61,45})玉皇大帝#m#u#W谈谈！',
	'  前往#Y龙窟七层#W击杀#u#G#m({龙窟七层,25,47})孙悟空#m#u',
	'  去#Y方寸山#W找#u#G#m({方寸大殿,16,10})菩提祖师#m#u#W了解详情',
    '  揭穿天界的阴谋，打败#u#G#m({凌霄宝殿,61,45})玉皇大帝#m#u#Y（需要战斗三次）',
	'  去#Y凌霄宝殿#W找#u#G#m({凌霄宝殿,61,45})玉皇大帝#m#u#W谈谈！'
}

local _追踪描述 = {
	'  前往#Y凌霄宝殿#W找#u#G#m({凌霄宝殿,61,45})玉皇大帝#m#u#W谈谈！',
	'  前往#Y龙窟七层#W击杀#u#G#m({龙窟七层,25,47})孙悟空#m#u',
	'  与#G孙悟空#W对话后去#Y方寸山#W找#u#G#m({方寸大殿,16,10})菩提祖师#m#u#W了解详情',
    '  揭穿天界的阴谋，打败#u#G#m({凌霄宝殿,61,45})玉皇大帝#m#u#Y（需要战斗三次）',
	'  去#Y凌霄宝殿#W找#u#G#m({凌霄宝殿,61,45})玉皇大帝#m#u#W谈谈！'
}

function 任务:任务取追踪(玩家)
    return _追踪描述[self.进度+1]
end
function 任务:任务取详情(玩家)
    return _详情[self.进度 + 1]
end

local _台词 = {
    '你已经消灭了孙悟空流散在人界的几个身外身，现在留在常世的孙悟空已经不剩多少力量了，不过为了以防万一，天界仍旧一致决定彻底抹杀孙悟空的存在，毕竟这才是一劳永逸的解决办法-...',
    --1
    '真的要这么赶尽杀绝吗?',
    --2
    '当然!你之前为天界解决了不少问题，这是最后一个任务了，完成它你就能成为真正的大罗天仙长生不死，成为我们的一员。快去吧!彻底消灭孙悟空这个让三界不安的存在!',
    --3
    '真郁闷，我的实力真的已经弱的这个地步了吗?但是你会比我更危险！',
    --4
    '天界给我命令是要杀死你！危险的反而是我？为什么？',
    --5
    '还不明白?你可真迟钝，你既然已经能够打败我，天界那些人也绝对不会放过你的。',
    --6
    '天界... ...真的如此黑暗? ( 不敢相信，那我究竟是在做什么..... )',
    --7
    '你终于又回来了，没错。九生九死是天庭的一个局。它能叫人不入轮回而改变命格。孙悟空若是败了，便被他们除去，若是通过了法阵，纯阳之体便会被改变，再也无法对天庭造成成胁。',
    --8
    '一个天衣无缝的法子。可是他们低估了一个女人愤怒的力量。最终也给自己带来了不可挽回的灾难。',
    --9
    '我们已经知道你去过了菩提老祖那里，也知道你虽然打败了孙悟空，但并没有彻底消灭他。',
    --10
    '不对的是你们!',
    --11
    '这世界本没有什么对与不对，力量才是一切。你不应该知道这么多秘密的，本来一介凡夫俗子能做到这个地步也不容易，但你自己要来送死那也是没办法。',
    --12
    '你... ...居然能够胜过天界最强的力量......',
    --13
    '我不会再受你们摆布了。我会帮助悟空，让他能够和小白在一起 。',
    --14
    '你不懂，这一切，都是为了三界的平衡.---.那只猴子忤逆不驯，总有一天，他会再次给三界带来大祸... ...除非，你真的可以让他回心转意走上取经之路',
    --15
    '我会做到的！'
    --16
}

function 任务:任务NPC对话(玩家, NPC)
    if NPC.名称 == '玉皇大帝' and NPC.台词 then
        NPC.头像 = NPC.外形
        if self.进度 == 0 then
            self.对话进度 = 0
            NPC.台词 = _台词[1]
            NPC.结束 = false
        elseif self.进度 == 3 then
            self.对话进度 = 0
            NPC.台词 = _台词[10]
            NPC.结束 = false
        elseif self.进度 == 4 then
            self.对话进度 = 0
            NPC.台词 = _台词[13]
            NPC.结束 = false
        end
    elseif NPC.名称 == '菩提祖师' and NPC.台词 then
        if self.进度 == 2 then
            self.对话进度 = 0
            NPC.台词 = _台词[8]
            NPC.结束 = false
        end
    elseif NPC.名称 == '孙悟空' and NPC.台词 then
        if self.进度 == 2 then
           if self.对话进度 == 0 then
            self.对话进度 = 1
            NPC.台词 = _台词[4]
            NPC.结束 = false
         end
        end
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
    if NPC.名称 == '玉皇大帝' then
        if self.进度 == 0 then
            if self.对话进度 == 0 then
                self.对话进度 = 1
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[2]
                NPC.结束 = false
            elseif self.对话进度 == 1 then
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[3]
                NPC.结束 = nil
                self.进度 = 1
                玩家:刷新追踪面板()
            end
        elseif self.进度 == 3 then
            if self.对话进度 == 0 then
                self.对话进度 = 1
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[11]
                NPC.结束 = false
            elseif self.对话进度 == 1 then
                self.对话进度 = 2
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[12]
                NPC.结束 = false
            elseif self.对话进度 == 2 then
                任务:任务攻击事件(玩家, NPC)
            end
        elseif self.进度 == 4 then
            if self.对话进度 == 0 then
                self.对话进度 = 1
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[14]
                NPC.结束 = false
            elseif self.对话进度 == 1 then
                self.对话进度 = 2
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[15]
                NPC.结束 = false
            elseif self.对话进度 == 2 then
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[16]
                NPC.结束 = nil
                self:完成(玩家)
                玩家:刷新追踪面板()
            end
        end
    elseif NPC.名称 == '菩提祖师' then
        if self.进度 == 2 then
            if self.对话进度 == 0 then
                NPC.台词 = _台词[9]
                self.进度 = 3
                玩家:刷新追踪面板()
            end
        end
    elseif NPC.名称 == '孙悟空' then
        if self.进度 == 2 then
            if self.对话进度 == 1 then
                self.对话进度 = 2
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[5]
                NPC.结束 = false
            elseif self.对话进度 == 2 then
                self.对话进度 = 3
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[6]
                NPC.结束 = false
            elseif self.对话进度 == 3 then
                self.对话进度 = 4
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[7]
                NPC.结束 = nil
            end
        end
    end
end

function 任务:完成(玩家)
    玩家:添加声望(20000)
    --提示框1#Y你得到了万里追云履
    玩家:常规提示('#Y你揭开了九生九死的真正奥秘，你在这个世界的声望提升你获得了20000的声望')
    local r = 玩家:取任务('引导_升级检测')
    if r then
        r:九称完成检测(玩家, '悟空')
    end
    self:删除()
end

function 任务:任务NPC给予(玩家, NPC, cash, items)

end

function 任务:任务攻击事件(玩家, NPC)
    if NPC.名称 == '孙悟空' then
        if self.进度 == 1 then
            local r = 玩家:进入战斗('scripts/task/称谓剧情/称谓9_抹杀孙悟空.lua')
            if r then
                玩家:添加经验(3000000)
                玩家:常规提示('#R你打败了孙悟空，获得3000000经验。')
				玩家:常规提示('与孙悟空对话')
                玩家:刷新追踪面板()
                self.对话进度 = 0
                NPC.头像 = NPC.外形
                NPC.结束 = false
                self.进度 = 2
            end
        end
    elseif NPC.名称 == '玉皇大帝' then
        if self.进度 == 3 then
            local r = 玩家:进入战斗('scripts/task/称谓剧情/称谓9_抹杀孙悟空.lua')
            if r then
                self.玉帝进程 = self.玉帝进程 + 1
                if self.玉帝进程 == 3 then
                    self.进度 = 4
                    玩家:刷新追踪面板()
                    玩家:添加经验(2000000)
                else
                   玩家:进入战斗('scripts/task/称谓剧情/称谓9_抹杀孙悟空.lua')
                end
            else
                self.玉帝进程 = 1
            end
        end
    end
end

function 任务:战斗初始化(玩家)
    local 进度,进程
    if self.进度 then
        进度 = self.进度
        进程 = self.玉帝进程
    else
        local r = 玩家:取任务('称谓9_抹杀孙悟空')
        if r then
            进度 = r.进度
            进程 = r.玉帝进程
        end
    end
    if 进度 then
        if 进度 == 1 then
            local 怪物属性 = {
                外形 = 2090,
                名称 = '孙悟空',
                等级 = 90,
                气血 = 630000,
                魔法 = 18000,
                攻击 = 45000,
                速度 = 420,
                抗性 = { 金 = 20, 木 = 20, 水 = 20, 火 = 20, 土 = 20, 连击率 = 66, 忽视防御几率 = 80, 忽视防御程度 = 100, 连击次数 = 6,狂暴几率 = 50, 致命几率 = 50, 抗混乱 = 80, 抗封印 = 30 },
            }
            self:加入敌方(1, 生成战斗怪物(怪物属性))
        elseif 进度 == 3 then
            if 进程 == 0 then
                local 怪物属性 = {
                    外形 = 2088,
                    名称 = '巨灵神',
                    等级 = 90,
                    气血 = 43000,
                    魔法 = 18000,
                    攻击 = 35000,
                    速度 = 320,
                    抗性 = { 金 = 20, 木 = 20, 水 = 20, 火 = 20, 土 = 20, 连击率 = 66, 忽视防御几率 = 60, 忽视防御程度 = 100, 连击次数 = 3,狂暴几率 = 30, 致命几率 = 30, 抗混乱 = 60, 抗封印 = 10 },
                }
                self:加入敌方(1, 生成战斗怪物(怪物属性))
            elseif 进程 == 1 then
                local 怪物属性 = {
                    外形 = 2289,
                    名称 = '战神女娲',
                    等级 = 90,
                    气血 = 48000,
                    魔法 = 18000,
                    攻击 = 5000,
                    速度 = 420,
                    抗性 = { 金 = 20, 木 = 20, 水 = 20, 火 = 20, 土 = 20, 抗混乱 = 80, 抗封印 = 60 },
                    技能 = {'天诛地灭','电闪雷鸣'}
                }
                self:加入敌方(1, 生成战斗怪物(怪物属性))
            elseif 进程 == 2 then
                local 怪物属性 = {
                    外形 = 2070,
                    名称 = '蛟龙',
                    等级 = 90,
                    气血 = 58000,
                    魔法 = 18000,
                    攻击 = 5000,
                    速度 = 520,
                    抗性 = { 金 = 20, 木 = 20, 水 = 20, 火 = 20, 土 = 20, 抗混乱 = 80, 抗封印 = 60 },
                    技能 = {'蛟龙出海','龙啸九天'}
                }
                self:加入敌方(1, 生成战斗怪物(怪物属性))
            end
        end
    end
end

function 任务:战斗回合开始(dt)
end

function 任务:战斗结束(x, y)
end

return 任务
