local 任务 = {
    名称 = '称谓11_佛家宝物',
    别名 = '佛家宝物(十一称)',
    类型 = '称谓剧情',
    是否可取消 = false,
	是否可追踪 = true
}

function 任务:任务初始化(玩家, ...)
    self.寻人 = {
        王母娘娘 = 0,
        二郎神 = 0,
        哪吒 = 0,
        李靖 = 0,
        千里眼 = 0,
        南天王 = 0,
        仙女 = 0,
        太上老君 = 0,
        嫦娥 = 0
    }
    self.寻物 = {九环锡杖 = 0, 锦斓袈裟 = 0}
end

function 任务:任务上线(玩家)
    --self:删除()
end

function 任务:任务更新(玩家, sec)
end

local _详情 = {
    '你可以完成十一个称谓剧情任务了，任务领取人#Y皇宫#G李世民',
    '去请#G玄奘#W大师出任水陆大会的主持。',
    '去找#G玉皇大帝#W要一套配得上玄奘大师身份的衣物来。',
    '去问问天宫众人有无给玄奘大师的衣物。需要寻找#G王母娘媳#W，#G哪吒#W，#G杨戬#W，#G李靖#W，#G千里眼#W，#G南天王#W，#G仙女#W，#G太上老君#W，#G嫦娥#W。',
    '再跟#G玉皇大帝#W聊聊吧。',
    '去找#G观音姐姐#W要如来赐子的宝物。',
    '打败#G玉狐仙#W，帮观音姐姐把佛家宝物拿回来。#Y(ALT+A玉狐仙进入战斗)',
    '拿回了佛家宝物跟#G观音姐姐#W复命吧。',
    '把宝物带给#G玄奘#W大师吧。（ALT+G将宝物给予玄奘）需要的宝物是#G九环锡杖#W和#G锦斓袈裟#W。'
}
function 任务:任务取详情(玩家)
    return _详情[self.进度 + 1]
end

local _台词 = {
    {头像 = 3037, 结束 = false, 序号 = 1, 台词 = '爱卿来得正好，如今大乱已了，朕不日准备举行水陆大会，爱卿是修仙之人可否为朕去请玄奘法师出任主持?'},
    {头像 = 0, 序号 = 2, 台词 = '这点小事，就交给我吧。'},
    --0
    {头像 = 3048, 结束 = false, 序号 = 3, 台词 = '陛下准备举办水陆大会? ?可是贫僧只懂小乘佛法，要谈天，说地，度鬼，需得我佛如来的三藏大乘真经才行。'},
    {头像 = 0, 结束 = false, 序号 = 4, 台词 = '啊，这么说来你又不准备去啦? ?'},
    {头像 = 3048, 结束 = false, 序号 = 5, 台词 = '不然，世人为善之心日稀，为佛之人，岂能不尽引渡之职，贫僧愿先主持水陆大会，再前往灵山，向我佛如未求取真经。'},
    {头像 = 0, 结束 = false, 序号 = 6, 台词 = '呵呵，果然不愧是玄奖，佛法精深，胸怀广阔。'},
    {头像 = 3048, 结束 = false, 序号 = 7, 台词 = '惭愧惭愧，折杀贫憎了。'},
    {头像 = 0, 结束 = false, 序号 = 8, 台词 = '啊，不过话又说回来，玄奘大师，我看你衣衫破旧，这样去主持水陆大会，恐怕不好吧。'},
    {头像 = 3048, 结束 = false, 序号 = 9, 台词 = '这.......贫僧只为精研佛法，衣衫鞋帽，都是身外之物，也无需着相。'},
    {头像 = 0, 序号 = 10, 台词 = '话是这样说，不过象大师这样修为精深之人，又怎能没有套好衣呢， 呵呵这事包在我身上，我去找王帝那老头儿要一套来。'},
    --1
    {头像 = 3066, 结束 = false, 序号 = 11, 台词 = '什么? ?要在天宫给玄奘法师找一套佛衣?这.........'},
    {头像 = 0, 结束 = false, 序号 = 12, 台词 = '玉帝，你不会是想说你没有吧。天宫众宝云集，怎么可能会找不出一套佛衣。'},
    {头像 = 3066, 结束 = false, 序号 = 13, 台词 = '这......不瞒你说，如果是要找仙家宝物，天宫也许还可以拿出几件，可是玄奘法师所需是佛家之物，天宫怎么会有。 '},
    {头像 = 0, 结束 = false, 序号 = 14, 台词 = '听起来倒象有几分道理...'},
    {头像 = 3066, 结束 = false, 序号 = 15, 台词 = '你如果不信，尽可去找天宫众仙询问，如果有，朕愿双手幸上。'},
    {头像 = 0, 序号 = 16, 台词 = '嗯，那好，我去问问看。'},
    --2
    {头像 = 0, 序号 = 17, 台词 = '要在天宫找佛衣，这.. ..恐怕难以如愿。'},
    {头像 = 0, 序号 = 18, 台词 = '佛衣? ? .-.-佛家之物，天宫可没有。'},
    {头像 = 0, 序号 = 19, 台词 = '佛衣? ? .-.-佛家之物，天宫可没有。'},
    {头像 = 0, 序号 = 20, 台词 = '听说我佛如来为取经人准备了两件宝物，命观音交托，你何不去问问观音。'},
    {头像 = 0, 序号 = 21, 台词 = '听说我佛如来为取经人准备了两件宝物，命观音交托，你何不去问问观音。'},
    {头像 = 0, 序号 = 22, 台词 = '佛家宝物为何天宫会有。 '},
    {头像 = 0, 序号 = 23, 台词 = '要在天宫找佛衣，这.. ..恐怕难以如愿。'},
    {头像 = 0, 序号 = 24, 台词 = '听说我佛如来为取经人准备了两件宝物，命观音交托，你何不去问问观音。'},
    {头像 = 0, 序号 = 25, 台词 = '要在天宫找佛衣，这.. ..恐怕难以如愿。'},
    --3
    {头像 = 0, 结束 = false, 序号 = 26, 台词 = '嗯，问来问去，好象真的是没有。'},
    {头像 = 3066, 结束 = false, 序号 = 27, 台词 = '怎么样，朕没有骗你吧，听说西天如来佛祖已经为取经人准备了两件宝物，命观音文托，你何不去问问观音。'},
    {头像 = 0, 序号 = 28, 台词 = '说得也是，那好，就去观音姐姐那问问看。'},
    --4

    {头像 = 3059, 结束 = false, 序号 = 29, 台词 = '咦，你来得正好，我有一事，想请你帮忙。'},
    {头像 = 0, 结束 = false, 序号 = 30, 台词 = '哦，观音姐姐无上法力，居然要找我帮忙，是什么事情啊?'},
    {头像 = 3059, 结束 = false, 序号 = 31, 台词 = '我佛如来为取经人准备了两件宝物，九环锡杖和锦斓袈裟，可是前几天被在山下修行的王狐仙偷去了。她和我一山修行，我实在不好出手，正好你来这里，可否帮我去找他讨回。'},
    {头像 = 0, 结束 = false, 序号 = 32, 台词 = '哈哈，是这事啊，我正是来为玄奘大师寻找佛衣宝物，观音姐姐你放心，这事就包在我身上了。 '},
    {头像 = 3059, 序号 = 33, 台词 = '玉狐仙法力不弱，千万小心。 '},
    --5

    {头像 = 3059, 序号 = 34, 台词 = '不错，正是这九环锡杖和锦斓袈裟，既然你已经拿到了他们，就赶紧给取经人送去吧。'},
    --6
    {头像 = 3048, 结束 = false, 序号 = 35, 台词 = '啊，这是... .我佛如来所赠的九环锡杖和锦斓袈裟。贫僧定不负所托，尽心竭力，主持水陆大会，西行求取真经，度我世人。'},
    {头像 = 0, 序号 = 36, 台词 = '嘿嘿，玄奘大师，有孙悟空帮忙，我想你一定能做到的。'}
}
function 任务:取对话(玩家)
    local r = _台词[self.对话进度]
    local 台词, 头像, 结束 = r.台词, r.头像, r.结束
    if 头像 == 0 then
        头像 = 玩家.原形
    end

    return 台词, 头像, 结束
end

function 任务:任务NPC对话(玩家, NPC)
    if NPC.名称 == '李世民' and NPC.台词 then
        if self.进度 == 0 then
            self.对话进度 = 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
        end
    elseif NPC.名称 == '玄奘' and NPC.台词 then
        if self.进度 == 1 then
            self.对话进度 = 3
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
        end
    elseif NPC.名称 == '玉皇大帝' and NPC.台词 then
        if self.进度 == 2 then
            self.对话进度 = 11
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
        elseif self.进度 == 4 then
            self.对话进度 = 26
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
        end
    elseif NPC.名称 == '王母娘娘' and NPC.台词 then
        if self.进度 == 3 and self.寻人.王母娘娘 == 0 then
            self.寻人.王母娘娘 = 1
            NPC.台词 = _台词[17].台词
            self:寻人检查(玩家)
        end
    elseif NPC.名称 == '二郎神' and NPC.台词 then
        if self.进度 == 3 and self.寻人.二郎神 == 0 then
            self.寻人.二郎神 = 1
            NPC.台词 = _台词[18].台词
            self:寻人检查(玩家)
        end
    elseif NPC.名称 == '哪吒' and NPC.台词 then
        if self.进度 == 3 and self.寻人.哪吒 == 0 then
            self.寻人.哪吒 = 1
            NPC.台词 = _台词[19].台词
            self:寻人检查(玩家)
        end
    elseif NPC.名称 == '李靖' and NPC.台词 then
        if self.进度 == 3 and self.寻人.李靖 == 0 then
            self.寻人.李靖 = 1
            NPC.台词 = _台词[20].台词
            self:寻人检查(玩家)
        end
    elseif NPC.名称 == '千里眼' and NPC.台词 then
        if self.进度 == 3 and self.寻人.千里眼 == 0 then
            self.寻人.千里眼 = 1
            NPC.台词 = _台词[21].台词
            self:寻人检查(玩家)
        end
    elseif NPC.名称 == '南天王' and NPC.台词 then
        if self.进度 == 3 and self.寻人.南天王 == 0 then
            self.寻人.南天王 = 1
            NPC.台词 = _台词[22].台词
            self:寻人检查(玩家)
        end
    elseif NPC.名称 == '仙女' and NPC.台词 then
        if self.进度 == 3 and self.寻人.仙女 == 0 then
            self.寻人.仙女 = 1
            NPC.台词 = _台词[23].台词
            self:寻人检查(玩家)
        end
    elseif NPC.名称 == '太上老君' and NPC.台词 then
        if self.进度 == 3 and self.寻人.太上老君 == 0 then
            self.寻人.太上老君 = 1
            NPC.台词 = _台词[24].台词
            self:寻人检查(玩家)
        end
    elseif NPC.名称 == '嫦娥' and NPC.台词 then
        if self.进度 == 3 and self.寻人.嫦娥 == 0 then
            self.寻人.嫦娥 = 1
            NPC.台词 = _台词[25].台词
            self:寻人检查(玩家)
        end
    elseif NPC.名称 == '观音姐姐' and NPC.台词 then
        if self.进度 == 5 then
            self.对话进度 = 29
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
        elseif self.进度 == 7 then
            self.对话进度 = 34
            NPC.台词 = _台词[34].台词
            self.进度 = 8
        end
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
    if NPC.名称 == '李世民' then
        if self.进度 == 0 then
            self.对话进度 = 2
            NPC.台词 = _台词[2].台词
            NPC.头像 = 玩家.原形
            NPC.结束 = nil
            self.进度 = 1
            玩家:添加经验(43230)
        end
    elseif NPC.名称 == '玄奘' then
        if self.进度 == 1 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 9 then
                self.进度 = 2
            end
        elseif self.进度 == 8 then
            NPC.台词 = _台词[36].台词
            NPC.头像 = 玩家.原形
            NPC.结束 = nil
            self:完成(玩家)
        end
    elseif NPC.名称 == '玉皇大帝' then
        if self.进度 == 2 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 16 then
                self.进度 = 3
            end
        elseif self.进度 == 4 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 28 then
                self.进度 = 5
            end
        end
    elseif NPC.名称 == '观音姐姐' then
        if self.进度 == 5 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 33 then
                self.进度 = 6
            end
        end
    end
end
function 任务:寻人检查(玩家)
    for _, v in pairs(self.寻人) do
        if v == 0 then
            return
        end
    end
    self.进度 = 4
end
function 任务:完成(玩家)
    玩家:添加声望(50)
    玩家:常规提示('#Y你帮助玄奘我到佛衣宝物，你的声望增加了50点。')
    local r = 玩家:取任务('引导_升级检测')
    if r then
        r:十一称完成检测(玩家, '宝物')
    end
    self:删除()
end

function 任务:任务NPC给予(玩家, NPC, cash, items)
    if NPC.名称 == '玄奘' then
        if self.进度 == 8 then
            if items[1] and (items[1].名称 == '锦斓袈裟' or items[1].名称 == '九环锡杖') then --
                if self.寻物[items[1].名称] == 0 then
                    if items[1].数量 >= 1 then
                        items[1]:接受(1)
                        self.寻物[items[1].名称] = 1
                        if self.寻物.锦斓袈裟 == 1 and self.寻物.九环锡杖 == 1 then
                            NPC.台词 = _台词[35].台词
                            NPC.头像 = NPC.外形
                            NPC.结束 = false
                        end
                    end
                end
            end
        end
    end
end

function 任务:任务攻击事件(玩家, NPC)
    if NPC.名称 == '玉狐仙' then
        if self.进度 == 6 and self.对话进度 == 33 then
            local r = true
            --玩家:进入战斗('scripts/task/称谓1_教训飞贼.lua')
            if r then
                玩家:添加物品({生成物品 {名称 = '锦斓袈裟', 数量 = 1}})
                玩家:添加物品({生成物品 {名称 = '九环锡杖', 数量 = 1}})
                玩家:常规提示('#Y你获得了3300000点经验，50000两银子，锦斓袈裟和九环锡杖。')
                self.进度 = 7
            end
        end
    end
end

function 任务:战斗初始化(玩家)
end

function 任务:战斗回合开始(dt)
end

function 任务:战斗结束(x, y)
end

return 任务
