-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2022-08-06 16:13:54
-- @Last Modified time  : 2024-10-26 18:06:57
local 任务 = {
    名称 = '称谓2_般若多罗密心经',
    别名 = '般若多罗密心经(二称)',
    类型 = '称谓剧情',
    是否可取消 = false,
	是否可追踪 = true
}

function 任务:任务初始化(玩家, ...)
end

function 任务:任务上线(玩家)
    --self:删除()
end

function 任务:任务更新(玩家, sec)
end

local _详情 = {
    '	前往#Y化生寺#W找#u#G#m({方丈室,21,17})空慈方丈#m#u#W聊聊！',
    '	地狱之中看来暗藏玄机，有必要去找#u#G#m({阎王殿,17,18})秦广王#m#u#W打探一番。',
    '	十王降魔阵快要撑不住了，#Y金山寺#W找#u#G#m({金山寺大殿,29,18})晦明禅师#m#u#W拿到般若多罗密心经吧。',
    '	去寺外找到#u#G#m({大唐境内,318,21})抢经的黑熊#m#u#W，打败他可以拿到般若多罗密心经。#Y(ALT+A攻击黑熊精)',
    '	速去将般若多罗密心经带给#u#G#m({阎王殿,17,18})秦广王#m#u#Y(请将般若多罗密心经ALT+G给予秦广王)'
}
local _追踪描述 = {
    '	前往#Y化生寺#W找#u#G#m({方丈室,21,17})空慈方丈#m#u#W聊聊！',
    '	地狱之中看来暗藏玄机，有必要去找#u#G#m({阎王殿,17,18})秦广王#m#u#W打探一番。',
    '	十王降魔阵快要撑不住了，去#Y金山寺#W找#u#G#m({金山寺大殿,29,18})晦明禅师#m#u#W拿到般若多罗密心经吧。',
    '	去寺外找到#u#G#m({大唐境内,318,21})抢经的黑熊#m#u#W，打败他可以拿到般若多罗密心经。#Y(ALT+A攻击黑熊精)',
    '	速去将般若多罗密心经带给#u#G#m({阎王殿,17,18})秦广王#m#u#Y(与秦广王对话)'
}

function 任务:任务取追踪(玩家)
    return _追踪描述[self.进度+1]
end

function 任务:任务取详情(玩家)
    return _详情[self.进度 + 1]
end

local _台词 = {
    '大事不好!昨夜老衲夜观星象，东方紫薇星一带妖气大起，两极之中，主杀的南斗光芒炸碎，此乃大凶之兆!难道地狱里的十王降魔阵已经被破了？？',
    --1
    '老方丈，什么是十王降魔阵？',
    --2
    '十王降魔阵，乃十殿阁王用自己几万年的功力结合起来，搭上性命结成的一个大阵，这个阵能够吞噬一切妖力，就算最厉害的妖怪给丢到这个大阵里也逃不出来。但是如果阵破，十殿阎王就会损失所有的功力，甚至会形神俱灭永世不得超升。十王降魔阵封印的一直是上下一万多年以来最厉害的妖怪#R白骨仙#W，如果让一万三千年前毁天灭地的白骨仙逃出来的话，三界就全完了。',
    --3
    '那么怎么知道这个“十王降魔阵”有没有被打破？',
    --4
    '那只有去地狱看看，才能知道究竟发生了什么事情了。',
    --5
    '(心说:看来我这次要去一次地狱了。)地狱这么走?到了找谁帮忙呀?',
    --6
    '据说在长安外有一神秘地方叫#Y阴阳洞#W的可以互通阴阳界。掌管这个封印的听说是#R秦广王。',
    --7
    '一万三千年来，孙悟空一直想从地狱深处把毁天灭地的白骨仙给救出去，但他因为一直不知道破“十王降魔阵“的办法，尝试了多少次也是无功而返。可现在他找到办法了，前一段时间，孙悟空大闹天宫，打破三界镇妖之宝琉璃盏，妖魔气焰大澄。孙悟空和白骨仙连手夹攻，我们的十王降魔阵受到了重大伤害，六成的功力都被打飞了。',
    --8
    '孙悟宝? ! !齐天大圣孙悟空? (心想:这下热闹了! )要怎么对付他?',
    --9
    '唯今之计，只有用金山寺的密宝#R“般若多罗密心经”#W为十王降魔阵做加持，才能压住白骨仙的妖力，但我们现在抽不出身，为了三界的安定，你一定要帮我们把心经带过来。',
    --10
    '三界混乱是不是会地球毁灭啊? ( 我看还是赶紧去帮他们这个小忙好了。）',
    --11
    '你从阳界来必是知道#R金山寺#W在那长安西之僻静之处，我就不多言了，请你速去速回吧。',
    --12
    '你要般若多罗密心经做加持?我也很想给你。但前几天有一只#R黑熊精#W来寺里捣乱，把心经给抢走了。',
    --13
    '哇~不是这么巧吧?妖怪们的消息这么灵通啊?',
    --14
    '这只妖怪据说还在外面四处游荡，老衲年老无力拿回，既然你有用。就请你自己去拿吧。',
    --15
    'OK,小菜一碟，修理小妖怪正是我的拿手好戏。',
    --16
    '太遗憾了,你来晚了，孙悟空已经打破了十王降魔阵，带着白骨仙离开了这里，回去吧，一切都晚了。.....”三界毁灭的时刻快到了......世界完了',
    --17
    '看来还真是遇到大麻烦了....'
    --18
}

function 任务:任务NPC对话(玩家, NPC)
    if NPC.名称 == '空慈方丈' and NPC.台词 then
        if self.进度 == 0 then
            self.对话进度 = 0
			NPC.头像 = NPC.外形
            NPC.台词 = _台词[1]
            NPC.结束 = false
        end
    elseif NPC.名称 == '秦广王' and NPC.台词 then
        if self.进度 == 1 then
            self.对话进度 = 0
			NPC.头像 = NPC.外形
            NPC.台词 = _台词[8]
            NPC.结束 = false
		elseif self.进度 == 4 then
			if self.对话进度 ==2 then
				NPC.头像 = NPC.外形
                local a =  玩家:取物品是否存在("般若多罗密心经")
                if a  then
                else
                    NPC.台词 = "我要的东西呢？"
                    return
                end
                local  b =    玩家:取物品是否存在("般若多罗密心经")
                if  b then
                        b:减少(1)
                end
				NPC.台词 = _台词[17]
				NPC.结束 = false
				self.对话进度=3
			elseif self.对话进度 ==3 then
				NPC.头像 = 玩家.原形
                NPC.台词 = _台词[18]
                NPC.结束 = nil
                self:完成(玩家)
			end
        end
    elseif NPC.名称 == '晦明禅师' and NPC.台词 then
        if self.进度 == 2 then
            self.对话进度 = 0
			NPC.头像 = NPC.外形
            NPC.台词 = _台词[13]
            NPC.结束 = false
        end
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
    if NPC.名称 == '空慈方丈' then
        if not i then
            if self.进度 == 0 then
                if self.对话进度 == 0 then
                    NPC.头像 = 玩家.原形
                    NPC.台词 = _台词[2]
                    self.对话进度 = 1
                    NPC.结束 = false
                elseif self.对话进度 == 1 then
                    self.对话进度 = 2
                    NPC.头像 = NPC.外形
                    NPC.台词 = _台词[3]
                    NPC.结束 = false
                elseif self.对话进度 == 2 then
                    self.对话进度 = 3
                    NPC.头像 = 玩家.原形
                    NPC.台词 = _台词[4]
                    NPC.结束 = false
                elseif self.对话进度 == 3 then
                    self.对话进度 = 4
                    NPC.头像 = NPC.外形
                    NPC.台词 = _台词[5]
                    NPC.结束 = false
                elseif self.对话进度 == 4 then
                    self.对话进度 = 5
                    NPC.头像 = 玩家.原形
                    NPC.台词 = _台词[6]
                    NPC.结束 = false
                elseif self.对话进度 == 5 then
                    NPC.头像 = NPC.外形
                    NPC.台词 = _台词[7]
                    NPC.结束 = nil
                    self.进度 = 1
					玩家:刷新追踪面板()
                end
            end
        end
    elseif NPC.名称 == '秦广王' then
        if self.进度 == 1 then
            if self.对话进度 == 0 then
                self.对话进度 = 1
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[9]
                NPC.结束 = false
            elseif self.对话进度 == 1 then
                self.对话进度 = 2
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[10]
                NPC.结束 = false
            elseif self.对话进度 == 2 then
                self.对话进度 = 3
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[11]
                NPC.结束 = false
            elseif self.对话进度 == 3 then
                self.进度 = 2
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[12]
                NPC.结束 = nil
				玩家:刷新追踪面板()
            end
        end
    elseif NPC.名称 == '晦明禅师' then
        if self.进度 == 2 then
            if self.对话进度 == 0 then
                self.对话进度 = 1
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[14]
                NPC.结束 = false
            elseif self.对话进度 == 1 then
                self.对话进度 = 2
                NPC.头像 = NPC.外形
                NPC.台词 = _台词[15]
                NPC.结束 = false
            elseif self.对话进度 == 2 then
                NPC.头像 = 玩家.原形
                NPC.台词 = _台词[16]
                NPC.结束 = nil
                self.进度 = 3
				玩家:刷新追踪面板()
            end
        end
    end
end

function 任务:完成(玩家)
    玩家:添加声望(120)
    玩家:提示窗口('#Y因为你帮忙了鬼界之王，你在这个世界的声望得到了提升，获得120点声望。')

    local r = 玩家:取任务('引导_升级检测')
    if r then
        r:二称完成检测(玩家, '心经')
    end
    self:删除()
	玩家:刷新追踪面板()
end

function 任务:任务攻击事件(玩家, NPC)
    if self.进度 == 3 then
        if NPC.名称 == '抢经的黑熊' then
            local r = 玩家:进入战斗('scripts/task/称谓剧情/称谓2_般若多罗密心经.lua', self)
            if r then
                self.进度 = 4
                玩家:添加物品 { 生成物品 { 名称 = '般若多罗密心经', 数量 = 1 }}
                玩家:添加银子(1536)
                玩家:添加经验(330000)
                玩家:常规提示('#Y你得到330000点经验和1536两银子和般若多罗密心经。')
				玩家:刷新追踪面板()
            end
        end
    end
end

local _怪物 = {
    { 名称 = "黑熊精", 外形 = 2006, 气血 = 7200, 魔法 = 1, 攻击 = 1200, 速度 = 1 },
    { 名称 = "家丁", 外形 = 2047, 气血 = 750, 魔法 = 1, 攻击 = 65, 速度 = 1 },
    { 名称 = "士兵", 外形 = 2048, 气血 = 750, 魔法 = 1, 攻击 = 65, 速度 = 1 },
    { 名称 = "家丁", 外形 = 2047, 气血 = 750, 魔法 = 1, 攻击 = 65, 速度 = 1 },
    { 名称 = "家丁", 外形 = 2047, 气血 = 750, 魔法 = 1, 攻击 = 65, 速度 = 1 }
}

function 任务:战斗初始化(玩家)
    for i = 1, 5 do
        local r = 生成战斗怪物(_怪物[i])
        self:加入敌方(i, r)
    end
end

function 任务:战斗回合开始(dt)
end

function 任务:战斗结束(x, y)
end

return 任务
