-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-01 12:16:40
-- @Last Modified time  : 2024-08-26 13:36:49

local _地图 = { 1001,1236}
--长安, 东海渔村, 珊瑚海岛, 洛阳城, 大唐境内, 五指山, 龙窟一层, 龙窟二层, 龙窟三层, 龙窟四层, 龙窟五层, 龙窟六层, 龙窟七层, 凤巢一层, 凤巢二层, 凤巢三层, 凤巢四层, 凤巢五层, 凤巢六层, 凤巢七层

local _怪信息 = {
    { name = '狂风修罗', 外形 = 2292 },
    { name = '摄魂修罗', 外形 = 2127 },
    { name = '烈焰修罗', 外形 = 2103 },
    { name = '金刚修罗', 外形 = 2098 },
    { name = '惧速修罗', 外形 = 2109 },
    { name = '嗜血修罗', 外形 = 2103 },
    { name = '怒雷修罗', 外形 = 2289 },
    { name = '惊涛修罗', 外形 = 2290 },
    { name = '虚无修罗', 外形 = 2096 },
    { name = '狂暴修罗', 外形 = 2170 }
}

local 任务 = {
    名称 = '日常_修罗任务',
    别名 = '修罗任务',
    类型 = '常规玩法',
    是否可取消 = true,
    是否可追踪 = true
}

function 任务:任务初始化()
end

function 任务:任务取详情(玩家)
    if self.NPC and self.MAP then
        local map = 玩家:取地图(self.MAP)
        if map then
            return string.format('#Y任务目的:#r#W请速去#Y%s#W处消灭#u#G#m({%s,%s,%s})%s#m#u#W，阻止他为非作歹。(当前第#R%s#W次，剩余#R%d#W分钟)'
            , self.位置, map.名称, self.坐标.x, self.坐标.y, self.怪名, 玩家.其它.修罗次数,
                (self.时间 - os.time()) // 60)
        end
    end
    return string.format('由于行动迟缓，#Y%s#W已经逃之夭夭了。\n', self.怪名)
end

local _追踪描述 = '速去#G%s(%s,%s)#W消灭#u#G#m({%s,%s,%s})%s#m#u#W[#G%s/10#W]#r#W剩余时间:%s'

function 任务:任务取追踪(玩家)
    if self.MAP then
        local map = 玩家:取地图(self.MAP)
        if map then
            return string.format(_追踪描述, map.名称, self.坐标.x, self.坐标.y, map.名称, self.坐标.x,
                self.坐标.y, self.怪名, 玩家.其它.修罗次数, os.date("!%H:%M:%S", (self.时间 - os.time()))) --任务.别名,任务.类别,
        end
    end
end

function 任务:任务更新(sec, 玩家)
    if self.时间 <= sec then
        local map = 玩家:取地图(self.MAP)
        if map then
            local NPC = map:取NPC(self.NPC)
            if NPC then
                map:删除NPC(self.NPC)
            end
        end
        self:任务取消(玩家)
        self:删除()
        玩家:提示窗口('#Y你的修罗任务已超时。')
    end
end

function 任务:任务取消(玩家)
    玩家.其它.修罗次数 = 0
    local map = 玩家:取地图(self.MAP)
    if map then
        local NPC = map:取NPC(self.NPC)
        if NPC then
            NPC.人数 = NPC.人数 - 1
            if NPC.人数 <= 0 then
                map:删除NPC(self.NPC)
            end
        end
    end
end

function 任务:任务上线(玩家)
    local map = 玩家:取地图(self.MAP)
    if map then
        local NPC = map:取NPC(self.NPC)
        if not NPC then
            self:删除()
        end
    end
end

function 任务:生成怪物(玩家)
    local map = 玩家:取随机地图(_地图)
    if not map then
        return
    end
    local xz = math.random(#_怪信息)
    self.怪名 = _怪信息[xz].name
    local X, Y = map:取随机坐标() --真坐标

    if not X then
        return
    end
    self.坐标 = { x = X, y = Y }
    self.位置 = string.format('%s(%d,%d)', map.名称, X, Y)
    self.队伍 = {}

    for k, v in 玩家:遍历队伍() do
        table.insert(self.队伍, v.nid)
        v.其它.修罗次数 = v.其它.修罗次数 + 1
        if v.其它.修罗次数 > 7 then
            v.其它.修罗次数 = 1
        end
        v:添加任务(self)
    end
    self.时间 = os.time() + 30 * 60
    self.NPC =
        map:添加NPC {
            队伍 = self.队伍,
            人数 = #self.队伍,
            时长 = 1800,
            名称 = self.怪名,
            外形 = _怪信息[xz].外形,
            脚本 = 'scripts/task/日常/日常_修罗任务.lua',
            时间 = self.时间,
            X = X,
            Y = Y,
            来源 = self
        }
    self.MAP = map.id

    玩家:自动任务({
        类型 = "日常_修罗任务",
        nid = self.NPC,
        外形 = self.外形,
        id = self.MAP,
        x = X,
        y = Y
    })

    玩家:刷新追踪面板()
    return true
end

function 任务:完成(玩家)
    local r = 玩家:取任务('日常_修罗任务')
    if 玩家.是否组队 then
        if r then
            for _, v in 玩家:遍历队伍() do
                local rr = v:取任务('日常_修罗任务')
                if rr then
                    self:掉落包(v)
                    rr:删除()
                end
            end
        end
        -- for _, nid in ipairs(self.队伍) do
        --     local r = 玩家:取玩家(nid)
        --     if r then
        --         local w = 玩家:取任务('日常_修罗任务')
        --         if w then
        --             w:删除()
        --         end
        --     end
        -- end
    elseif r then
        self:掉落包(玩家)
        self:删除()
    end

    local map = 玩家:取地图(self.MAP)
    if map then
        map:删除NPC(self.NPC)
    end
end

function 任务:掉落包(玩家)
	 if 玩家:取活动限制次数('日常_修罗任务') >= 999 then
        玩家:提示窗口('本日奖励次数已尽,无法继续获得奖励')
        return
    end

    玩家:增加活动限制次数('日常_修罗任务')

    local 银子 = 3000 * (1 + 玩家.其它.修罗次数 * 0.12)
    local 经验 = (50000 + 玩家.等级 * 1500) * (1 + 玩家.其它.修罗次数 * 0.072)
    local r = 玩家:取任务('引导_修罗任务')
    if r then
        r:添加进度(玩家)
    end

   if 玩家:判断等级是否高于(180) or 玩家:判断等级是否低于(110) then --90-142
        return
    end

    玩家:添加银子(银子, "修罗")
    玩家:添加任务经验(经验, "修罗")
    玩家:添加活力(15)
    if 玩家.是否队长 then
        local t = 玩家:取物品是否存在('灵兽天行符')
        if not t then
            玩家:添加物品({ 生成物品 { 名称 = '灵兽天行符', 数量 = 1 } })
        end
    end

    local 奖励 = 是否奖励(1010, 玩家.等级, 玩家.转生)
    if 次数 == 10 then
        奖励 = 是否奖励(1009, 玩家.等级, 玩家.转生)
    end
    if 奖励 ~= nil and type(奖励) == 'table' then
        local r = 生成物品 { 名称 = 奖励.道具信息.道具, 数量 = 奖励.道具信息.数量, 参数 = 奖励
        .道具信息.参数 }
        if r then
            玩家:添加物品({ r })
            if 奖励.道具信息.是否广播 == 1 and 奖励.广播 ~= nil then
                玩家:发送系统(奖励.广播, 玩家.名称, r.ind, r.名称)
            end
        end
    end
end

--===============================================
local 对话 = [[想要阻止我，也要看看自己有没有这份实力！
menu
1|看打！
2|点错
]]

function 任务:NPC对话(玩家, i)
    local r = 玩家:取任务("日常_修罗任务")
    if r and r.NPC == self.来源.NPC then
        return 对话
    end
    return "我认识你么？"
end

function 任务:任务攻击事件(玩家, NPC)
    local r = 玩家:取任务("日常_修罗任务")
    if r and r.NPC == NPC.来源.NPC then
        local rr = 玩家:进入战斗('scripts/task/日常/日常_修罗任务.lua', NPC)
        if rr then
            r:完成(玩家)
        end
        玩家:自动任务_战斗结束(rr)
        return
    end
    return "我认识你么？"
end

function 任务:NPC菜单(玩家, i)
    if i == '1' then
        local r = 玩家:进入战斗('scripts/task/日常/日常_修罗任务.lua', self)
        if r then
            self.来源:完成(玩家)
        end
        玩家:自动任务_战斗结束(r)
    end
end

local _数量表 = { 5, 6, 7, 7, 7, 7, 7, 7, 8, 9 }
function 任务:战斗初始化(玩家, NPC)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local _怪物 = {
        { 名称 = '', 外形 = '', 等级 = 等级, 血初值 = 6500, 法初值 = 1800, 攻初值 = 280, 敏初值 = 400,
            施法几率 = 100, 是否消失 = false },
        { 名称 = '喽啰', 外形 = '', 等级 = 等级, 血初值 = 3800, 法初值 = 1800, 攻初值 = 105,
            敏初值 = 250, 施法几率 = 50, 是否消失 = false },
    }
    local 外形表 = { 2060, 2099, 2101, 2102, 2104, 2105, 2095, 2100, 2098, 2097 }
    --    模型表={"猴精","冰雪魔","泥石怪","水灵仙","狐小妖","吉祥果","铁扇公主","罗刹鬼姬","天龙女","狮蝎"}
    local 数量 = _数量表[玩家.其它.修罗次数]
    if not 数量 then 数量 = 5 end
    for i = 1, 数量 do
        local r = {}
        if i == 1 then
            local t = NPC.名称
            _怪物[1].名称 = NPC.名称
            _怪物[1].外形 = NPC.外形
            if t == '狂风修罗' then
                _怪物[1].抗性 = { 抗风 = 200, 抗混乱 = 50 + 等级 * 0.5, 抗昏睡 = 50 + 等级 * 0.5,
                    忽视抗风 = 10 + 等级 * 0.1, 风系狂暴几率 = 5 + 等级 * 0.1 }
                _怪物[1].技能 = { { 名称 = '袖里乾坤', 熟练度 = 10000 + 等级 * 80 } }
            elseif t == '烈焰修罗' then
                _怪物[1].抗性 = { 抗火 = 200, 抗混乱 = 50 + 等级 * 0.5, 抗昏睡 = 50 + 等级 * 0.5,
                    忽视抗火 = 10 + 等级 * 0.1, 火系狂暴几率 = 5 + 等级 * 0.1 }
                _怪物[1].技能 = { { 名称 = '九阴纯火', 熟练度 = 10000 + 等级 * 80 } }
            elseif t == '怒雷修罗' then
                _怪物[1].抗性 = { 抗雷 = 200, 抗混乱 = 50 + 等级 * 0.5, 抗昏睡 = 50 + 等级 * 0.5,
                    忽视抗雷 = 10 + 等级 * 0.1, 雷系狂暴几率 = 5 + 等级 * 0.1 }
                _怪物[1].技能 = { { 名称 = '天诛地灭', 熟练度 = 10000 + 等级 * 80 } }
            elseif t == '惊涛修罗' then
                _怪物[1].抗性 = { 抗水 = 200, 抗混乱 = 50 + 等级 * 0.5, 抗昏睡 = 50 + 等级 * 0.5,
                    忽视抗水 = 10 + 等级 * 0.1, 水系狂暴几率 = 5 + 等级 * 0.1 }
                _怪物[1].技能 = { { 名称 = '九龙冰封', 熟练度 = 10000 + 等级 * 80 } }
            elseif t == '狂暴修罗' then
                _怪物[1].抗性 = { 抗风 = 20 + 等级 * 0.3, 抗雷 = 20 + 等级 * 0.3, 抗火 = 20 + 等级 * 0.3,
                    抗水 = 20 + 等级 * 0.3, 抗鬼火 = 10 + 等级 * 0.2, 抗混乱 = 40 + 等级 * 0.5,
                    抗昏睡 = 40 + 等级 * 0.5, 忽视抗水 = 5 + 等级 * 0.1, 水系狂暴几率 = 100,
                    忽视抗风 = 5 + 等级 * 0.1, 风系狂暴几率 = 100, 忽视抗雷 = 5 + 等级 * 0.1,
                    雷系狂暴几率 = 100, 忽视抗火 = 5 + 等级 * 0.1, 火系狂暴几率 = 100 }
                _怪物[1].技能 = { { 名称 = '九龙冰封', 熟练度 = 10000 + 等级 * 50 },
                    { 名称 = "天诛地灭", 熟练度 = 10000 + 等级 * 50 }, { 名称 = "九阴纯火",
                    熟练度 = 10000 + 等级 * 50 }, { 名称 = "袖里乾坤", 熟练度 = 10000 + 等级 * 50 } }
            elseif t == '摄魂修罗' then
                _怪物[1].抗性 = { 抗风 = 15 + 等级 * 0.2, 抗雷 = 20 + 等级 * 0.3, 抗火 = 15 + 等级 * 0.2,
                    抗水 = 15 + 等级 * 0.2, 抗鬼火 = 10 + 等级 * 0.2, 抗混乱 = 40 + 等级 * 0.5,
                    抗昏睡 = 40 + 等级 * 0.5, 加强雷 = 50 + 等级 * 0.5, 忽视抗雷 = 50 + 等级 * 0.5,
                    雷系狂暴几率 = 100 }
                _怪物[1].技能 = { { 名称 = '电闪雷鸣', 熟练度 = 20000 + 等级 * 80 } }
            elseif t == '金刚修罗' then
                _怪物[1].攻初值 = 8000
                _怪物[1].施法几率 = 50
                _怪物[1].抗性 = { 抗风 = 15 + 等级 * 0.2, 抗雷 = 15 + 等级 * 0.2, 抗火 = 15 + 等级 * 0.2,
                    抗水 = 15 + 等级 * 0.2, 抗鬼火 = 10 + 等级 * 0.2, 抗混乱 = 40 + 等级 * 0.5,
                    抗昏睡 = 50 + 等级 * 0.5, 物理吸收 = 100, 反击 = 5, 反击率 = 75, 忽视防御几率 = 100,
                    忽视防御程度 = 100 }
                _怪物[1].技能 = { { 名称 = '含情脉脉', 熟练度 = 10000 + 等级 * 80 } }
            elseif t == '惧速修罗' then
                _怪物[1].攻初值 = 3000
                _怪物[1].抗性 = { 抗风 = 15 + 等级 * 0.2, 抗雷 = 15 + 等级 * 0.2, 抗火 = 15 + 等级 * 0.2,
                    抗水 = 15 + 等级 * 0.2, 抗鬼火 = 10 + 等级 * 0.2, 40 + 等级 * 0.5, 抗昏睡 = 40 + 等级 *
                0.5, 物理吸收 = 70 }
                _怪物[1].技能 = { { 名称 = "魔音摄心", 熟练 = 10000 + 等级 * 40 },
                    { 名称 = "阎罗追命", 熟练 = 10000 + 等级 * 40 }, { 名称 = "含情脉脉", 熟练 = 10000 +
                等级 * 40 }, { 名称 = "魔神附体", 熟练 = 10000 + 等级 * 40 } }
            elseif t == '嗜血修罗' then
                _怪物[1].抗性 = { 抗混乱 = 40 + 等级 * 0.5, 抗昏睡 = 40 + 等级 * 0.5, 抗鬼火 = 10 +
                等级 * 0.2, 加强三尸虫回血程度 = 300 }
                _怪物[1].技能 = { { 名称 = "吸星大法", 熟练 = 10000 + 等级 * 30 } }
            elseif t == '虚无修罗' then
                _怪物[1].抗性 = { 抗风 = 15 + 等级 * 0.2, 抗雷 = 15 + 等级 * 0.2, 抗火 = 15 + 等级 * 0.2,
                    抗水 = 15 + 等级 * 0.2, 抗鬼火 = 10 + 等级 * 0.2, 抗混乱 = 40 + 等级 * 0.5,
                    抗昏睡 = 50 + 等级 * 0.5 }
                _怪物[1].技能 = { { 名称 = "万毒攻心", 熟练 = 10000 + 等级 * 80 },
                    { 名称 = "失心疯", 熟练 = 20000 + 等级 * 80 } }
            end
            r = 生成战斗怪物(生成怪物属性(_怪物[i]))
        else
            _怪物[2].外形 = 外形表[math.random(#外形表)]
            _怪物[2].抗性 = { 抗风 = 20, 抗雷 = 20, 抗火 = 20, 抗水 = 20, 抗鬼火 = 20, 抗震慑 = 10,
                抗混乱 = 80, 抗昏睡 = 80, 物理吸收 = 50 }
            if _怪物[2].外形 == 2100 then
                _怪物[2].抗性.抗毒伤害 = -15000
                _怪物[2].抗性.抗风 = -100
                _怪物[2].抗性.抗雷 = -100
                _怪物[2].抗性.抗火 = -100
                _怪物[2].抗性.抗水 = -100
            elseif _怪物[2].外形 == 2448 or _怪物[2].外形 == 2129 or _怪物[2].外形 == 2125 or _怪物[2].外形 == 2201 then
                _怪物[2].施法几率 = 80
                _怪物[2].抗性.抗毒伤害 = -6000
                if _怪物[2].模型 == 2448 or _怪物[2].模型 == 2129 then
                    _怪物[2].技能 = { { 名称 = "九阴纯火", 熟练 = 15000 } }
                elseif _怪物[2].模型 == 2125 then
                    _怪物[2].技能 = { { 名称 = "袖里乾坤", 熟练 = 15000 } }
                elseif _怪物[2].模型 == 2201 then
                    _怪物[2].技能 = { { 名称 = "九龙冰封", 熟练 = 15000 } }
                end
            elseif _怪物[2].外形 == 2107 then
                _怪物[2].技能 = { { 名称 = "吸星大法", 熟练 = 10000 } }
            elseif _怪物[2].外形 == 2060 then
                _怪物[2].攻初值 = 2000
                _怪物[2].抗性.抗混乱 = 100
                _怪物[2].抗性.抗昏睡 = 130
                _怪物[2].抗性.忽视抗混 = 10
                _怪物[2].技能 = { { 名称 = "借刀杀人", 熟练 = 30000 } }
                _怪物[2].施法几率 = 50
            elseif _怪物[2].外形 == 2099 then
                _怪物[2].攻初值 = 2000
                _怪物[2].施法几率 = 50
                _怪物[2].抗性.抗混乱 = 100
                _怪物[2].抗性.抗昏睡 = 130
                _怪物[2].抗性.忽视抗睡 = 10
                _怪物[2].技能 = { { 名称 = "迷魂醉", 熟练 = 30000 } }
            elseif _怪物[2].外形 == 2101 then
                _怪物[2].施法几率 = nil
                _怪物[2].敏初值 = -350
                _怪物[2].攻初值 = 2600
                _怪物[2].抗性.抗震慑 = 10
                _怪物[2].抗性.忽视防御几率 = 100
                _怪物[2].抗性.忽视防御程度 = 80
                _怪物[2].抗性.致命几率 = 80
                _怪物[2].抗性.连击率 = 80
                _怪物[2].抗性.连击 = 6
            elseif _怪物[2].外形 == 2106 then
                _怪物[2].攻初值 = 2500
                _怪物[2].施法几率 = 50
                _怪物[2].技能 = { { 名称 = "万毒攻心", 熟练 = 15000 } }
            end
            r = 生成战斗怪物(生成怪物属性(_怪物[2]))
        end
        self:加入敌方(i, r)
    end
end

function 任务:战斗回合开始(dt)
end

function 任务:战斗结束(dt)
    if dt then
        local zg = self:取对象(11)
        if zg then
            for k, v in self:遍历我方() do
                if v.是否玩家 then
                    local z = v.对象.接口:取乘骑坐骑()
                    if z then
                        z:添加经验(5)
                        z:添加熟练(5)
                    end
                end
            end
        end
    end
end

return 任务
