-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-01 12:16:40
-- @Last Modified time  : 2024-08-13 15:20:37

local 任务 = {
    名称 = '日常_寻芳任务',
    别名 = '寻芳任务',
    类型 = '挑战玩法',
    是否可取消 = false,
    是否可追踪 = false
}

local NPC表 = {"腊梅仙子","杏花仙子","桃花仙子","牡丹仙子","石榴仙子","荷花仙子","蜀葵仙子","桂花仙子","菊花仙子","木芙蓉仙子","山茶仙子","水仙仙子"}
local 外形表 = {3061,6603,2096,55,2012,45,6,6538,2125,2179,51,2100}
function 任务:任务初始化(玩家, ...)
    self.进度 = 1
    self.积分 = 0
end

function 任务:任务取详情(玩家)
    local 挑战进度 = self.进度 - 1
    local _任务详情 = '#Y任务目的：#r解救被封印的花神#r#G目前已破除#Y'..挑战进度..'/12#G道封印。#r#G目前获得积分#Y'..self.积分..'。'
    return _任务详情
end

function 任务:任务取消(玩家)
    self:删除()
    -- if self.map then
    --     local NPC = self.map:取NPC(self.NPC)
    --     if NPC then
    --         self.map:删除NPC(self.NPC)
    --     end
    -- end
end

function 任务:任务更新(sec, 玩家)
    if os.time() > self.时间 then
        self:任务取消(玩家)
    end
end

function 任务:任务上线(玩家)
end

function 任务:添加任务(玩家)
    self.队伍 = {}
    for k, v in 玩家:遍历队伍() do
        table.insert(self.队伍, v.nid)
        v:添加任务(self)
    end
    self.时间 = os.time() + 7200
    return true
end

function 任务:完成(玩家)
    local r = 玩家:取任务('日常_寻芳任务')
    if 玩家.是否组队 then
        if r then
            for _, v in 玩家:遍历队伍() do
                local rr = v:取任务('日常_寻芳任务')
                if rr and r.nid == rr.nid then
                    self:奖励(v)
                    rr:删除()
                end
            end
        end
    else
        if r then
            self:奖励(玩家)
            self:删除()
        end
    end
    玩家:切换地图(1001, 227, 210)
end

function 任务:奖励(玩家)
    if not 玩家.积分.寻芳积分 then
        玩家.积分.寻芳积分 = 0
    end
    玩家.积分.寻芳积分 = 玩家.积分.寻芳积分 + self.积分
    玩家:提示窗口('#Y寻芳临时积分已结算,本日获得#G'..self.积分..'#Y寻芳积分,本日已无法再次挑战。')
    玩家:增加活动限制次数('寻芳任务')
end

function 任务:任务NPC菜单(玩家, NPC, i)
    if NPC.名称 == '封印的花神' then
        if i == '是的没错' then
            local r = 玩家:进入战斗('scripts/task/日常/日常_寻芳任务.lua', self)
            if r then
                self.积分 = self.积分 + 50 + self.进度 * 10
                玩家:提示窗口('#Y临时积分已累计至#G'..self.积分)
                self.进度 = self.进度 + 1
                if self.进度 >= 13 then
                    self:完成(玩家)
                end
            end
        end
    end
end

function 任务:战斗初始化(玩家,任务)
    if not 任务 then
        return
    end
    if 任务.进度 == 1 then
        local _怪物 = {
            { 名称 = "阎罗魔王", 外形 = 2275, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "阎罗魔女", 外形 = 2107, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
        }
        for i = 1, 2 do
            local r = 生成战斗怪物(_怪物[i])
            self:加入敌方(i, r)
        end
    elseif 任务.进度 == 2 then
        local _怪物 = {
            { 名称 = "日宫天子", 外形 = 2170, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "月宫天子", 外形 = 2179, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
        }
        for i = 1, 2 do
            local r = 生成战斗怪物(_怪物[i])
            self:加入敌方(i, r)
        end
    elseif 任务.进度 == 3 then
        local _怪物 = {
            { 名称 = "九子鬼母", 外形 = 2107, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "小孩", 外形 = 0046, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "小孩", 外形 = 0046, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "小孩", 外形 = 0046, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "小孩", 外形 = 0046, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "小孩", 外形 = 0046, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "小孩", 外形 = 0046, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "小孩", 外形 = 0046, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "小孩", 外形 = 0046, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "小孩", 外形 = 0046, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 }
        }
        for i = 1, 10 do
            local r = 生成战斗怪物(_怪物[i])
            self:加入敌方(i, r)
        end
    elseif 任务.进度 == 4 then
        local _怪物 = {
            { 名称 = "散脂大将", 外形 = 2274, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "以彼制彼", 外形 = 0043, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "以彼制彼", 外形 = 0040, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "以彼制彼", 外形 = 0017, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "以彼制彼", 外形 = 0063, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
        }
        for i = 1, 5 do
            local r = 生成战斗怪物(_怪物[i])
            self:加入敌方(i, r)
        end
    elseif 任务.进度 == 5 then
        local _怪物 = {
            { 名称 = "韦陀天神", 外形 = 2108, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "地灵", 外形 = 2051, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "坚牢地神", 外形 = 2110, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "地灵", 外形 = 2051, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "天灵", 外形 = 2289, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "天灵", 外形 = 2289, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
        }
        for i = 1, 6 do
            local r = 生成战斗怪物(_怪物[i])
            self:加入敌方(i, r)
        end
    elseif 任务.进度 == 6 then
        local _怪物 = {
            { 名称 = "摩利支天善相", 外形 = 2128, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "摩利支天善相", 外形 = 2128, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "摩利支天善相", 外形 = 2128, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "摩利支天善相", 外形 = 2128, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "摩利支天善相", 外形 = 2128, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "摩利支天恶相", 外形 = 2072, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "摩利支天恶相", 外形 = 2110, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "摩利支天恶相", 外形 = 2002, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 , 染色 = 0x03010101},
            { 名称 = "摩利支天恶相", 外形 = 2176, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "摩利支天恶相", 外形 = 2110, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 }
        }
        for i = 1, 10 do
            local r = 生成战斗怪物(_怪物[i])
            self:加入敌方(i, r)
        end
    elseif 任务.进度 == 7 then
        local _怪物 = {
            { 名称 = "大辩才天", 外形 = 2129, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "红衣童子", 外形 = 0049, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "蓝衣童子", 外形 = 0048, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "红衣童子", 外形 = 0049, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "蓝衣童子", 外形 = 0048, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "蓝衣童子", 外形 = 0048, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "罗汉", 外形 = 2283, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "红衣童子", 外形 = 0049, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "金刚", 外形 = 2098, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 }
        }
        for i = 1, 9 do
            local r = 生成战斗怪物(_怪物[i])
            self:加入敌方(i, r)
        end
    elseif 任务.进度 == 8 then
        local _怪物 = {
            { 名称 = "花之殇", 外形 = 2150, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "小仙花", 外形 = 2315, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "小仙花", 外形 = 2315, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "花妖", 外形 = 2096, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "小仙花", 外形 = 2315, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "侍女", 外形 = 2012, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
        }
        for i = 1, 6 do
            local r = 生成战斗怪物(_怪物[i])
            self:加入敌方(i, r)
        end
    elseif 任务.进度 == 9 then
        local _怪物 = {
            { 名称 = "多闻", 外形 = 2127, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "持国", 外形 = 2128, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "广目", 外形 = 0052, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "增长", 外形 = 2126, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
        }
        for i = 1, 4 do
            local r = 生成战斗怪物(_怪物[i])
            self:加入敌方(i, r)
        end
    elseif 任务.进度 == 10 then
        local _怪物 = {
            { 名称 = "紫薇大帝", 外形 = 0054, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "阎魔罗女", 外形 = 2107, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "阎魔罗王", 外形 = 2274, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "日宫天子", 外形 = 2170, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "月宫天子", 外形 = 2179, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "东岳大帝", 外形 = 0061, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
        }
        for i = 1, 6 do
            local r = 生成战斗怪物(_怪物[i])
            self:加入敌方(i, r)
        end
    elseif 任务.进度 == 11 then
        local _怪物 = {
            { 名称 = "帝释天", 外形 = 2170, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "万年寒冰", 外形 = 2099, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "万年寒冰", 外形 = 2099, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "飞天", 外形 = 2150, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "飞天", 外形 = 2150, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "金刚", 外形 = 2098, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "金刚", 外形 = 2098, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "金刚", 外形 = 2098, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "飞天", 外形 = 2150, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 }
        }
        for i = 1, 9 do
            local r = 生成战斗怪物(_怪物[i])
            self:加入敌方(i, r)
        end
    elseif 任务.进度 == 12 then
        local _怪物 = {
            { 名称 = "多闻", 外形 = 2127, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "持国", 外形 = 2128, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "广目", 外形 = 0052, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "东岳大帝", 外形 = 0061, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "增长", 外形 = 2126, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
            { 名称 = "紫薇大帝", 外形 = 0054, 气血 = 1, 魔法 = 100000, 攻击 = 59, 速度 = 1 },
        }
        for i = 1, 6 do
            local r = 生成战斗怪物(_怪物[i])
            self:加入敌方(i, r)
        end
    end
end
function 任务:战斗回合开始(dt)
end

function 任务:战斗结束(dt)
    if dt then
        local zg = self:取对象(11)
        if zg then
            for k, v in self:遍历我方() do
                if v.是否玩家 then
                    local z = v.对象.接口:取乘骑坐骑()
                    if z then
                        z:添加经验(5)
                        z:添加熟练(5)
                    end
                end
            end
        end
    end
end

return 任务
