-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-01 12:16:40
-- @Last Modified time  : 2024-08-13 16:21:09

local 任务 = {
    名称 = '日常_大雁塔任务',
    别名 = '大雁塔降魔',
    类型 = '挑战玩法',
    是否可取消 = true,
    是否可追踪 = true
}

local 五行阵 = {'火妖','金鬼','木鬼','尘魔','水妖'}
local 五行怪坐标 = {
    {x = 128, y = 63},
    {x = 99, y = 83},
    {x = 17, y = 57},
    {x = 86, y = 64},
    {x = 68, y = 30},
}

function 任务:任务初始化(玩家, ...)
    self.坐标记录 = {}
    self.map = {}
    for i=1,20 do
        self.坐标记录[i] = {x = 0 , y = 0}
    end
end

function 任务:任务取详情(玩家)
    local _任务详情 = {
        [1] = '#Y任务目的：#r#W除掉雁塔中的妖魔,#u#G#m({大雁塔一层,136,70})慈恩寺方丈#m#u#W会助你一臂之力。',
        [2] = '#Y任务目的：#r#W请速去,#u#G#m({大雁塔一层,'..self.坐标记录[2].x..','..self.坐标记录[2].y..'})（'..self.坐标记录[2].x..','..self.坐标记录[2].y..'）#m#u#W镇杀妖魔。',
        [3] = '#Y任务目的：#r#W你帮助方丈战胜了妖魔,快去找#u#G#m({大雁塔一层,136,70})慈恩寺方丈#m#u#W进入下一层吧。',
        [4] = '#Y任务目的：#r#W#u#G#m({大雁塔二层,76,57})慈恩寺方丈#m#u#W正在等你们,好像有什么事情,快去找他。',
        [5] = '#Y任务目的：#r#W四处逛逛,看看能不能找到偷画轴的妖魔。',
        [6] = '#Y任务目的：#r#W把遗失的画轴,还给#u#G#m({大雁塔二层,76,57})慈恩寺方丈#m#u#W。',
        [7] = '#Y任务目的：#r#W你帮助方丈战胜了妖魔,快去找#u#G#m({大雁塔二层,76,57})慈恩寺方丈#m#u#W进入下一层吧。',
        [8] = '#Y任务目的：#r#W#u#G#m({大雁塔三层,25,37})慈恩寺方丈#m#u#W正在等你们,好像有什么事情,快去找他。',
        [9] = '#Y任务目的：#r#W火妖在#u#G#m({大雁塔三层,130,60})（130,60）#m#u#W,速去降服。',
        [10] = '#Y任务目的：#r#W你们下一个目标是#G'..五行阵[self.击杀进度]..'#W快去破除下一阵眼。',
        [11] = '#Y任务目的：#r#W怪物首领出现在#u#G#m({大雁塔三层,'..self.坐标记录[11].x..','..self.坐标记录[11].y..'})（'..self.坐标记录[11].x..','..self.坐标记录[11].y..'）#m#u#W请火速前往消灭。',
        [12] = '#Y任务目的：#r#W回去找#u#G#m({大雁塔三层,25,37})慈恩寺方丈#m#u#W进入下一层。',
        [13] = '#Y任务目的：#r#W#u#G#m({大雁塔四层,35,32})慈恩寺方丈#m#u#W正在等你们,好像有什么事情,快去找他。',
        [14] = '#Y任务目的：#r#G巫支祁#W现形在#u#G#m({大雁塔四层,'..self.坐标记录[13].x..','..self.坐标记录[13].y..'})（'..self.坐标记录[13].x..','..self.坐标记录[13].y..'）#m#u#W,速去铲除。',
        [15] = '#Y任务目的：#r#W回去找#u#G#m({大雁塔四层,35,32})慈恩寺方丈#m#u#W进入下一层。',
        [16] = '#Y任务目的：#r#W#u#G#m({大雁塔五层,62,55})慈恩寺方丈#m#u#W正在等你们,好像有什么事情,快去找他。',
        [17] = '#Y任务目的：#r#G奢比尸#W现形在#u#G#m({大雁塔五层,'..self.坐标记录[16].x..','..self.坐标记录[16].y..'})（'..self.坐标记录[16].x..','..self.坐标记录[16].y..'）#m#u#W,速去铲除。',
        [18] = '#Y任务目的：#r#W此间事了,回去找#u#G#m({大雁塔五层,62,55})慈恩寺方丈#m#u#W离开吧。',
    }
    if self.进度 <= 3 then
        任务.别名 = '雁塔一层任务'
    end
    return _任务详情[self.进度]
end

function 任务:任务取追踪(玩家)
    if self.击杀进度 and self.进度 then
        local _任务详情 = {
            [1] = '#W除掉雁塔中的妖魔,#u#G#m({大雁塔一层,136,70})慈恩寺方丈#m#u#W会助你一臂之力。',
            [2] = '#W请速去,#u#G#m({大雁塔一层,'..self.坐标记录[2].x..','..self.坐标记录[2].y..'})（'..self.坐标记录[2].x..','..self.坐标记录[2].y..'）#m#u#W镇杀妖魔。',
            [3] = '#W你帮助方丈战胜了妖魔,快去找#u#G#m({大雁塔一层,136,70})慈恩寺方丈#m#u#W进入下一层吧。',
            [4] = '#W#u#G#m({大雁塔二层,76,57})慈恩寺方丈#m#u#W正在等你们,好像有什么事情,快去找他。',
            [5] = '#W四处逛逛,看看能不能找到偷画轴的妖魔。',
            [6] = '#W把遗失的画轴,还给#u#G#m({大雁塔二层,76,57})慈恩寺方丈#m#u#W。',
            [7] = '#W你帮助方丈战胜了妖魔,快去找#u#G#m({大雁塔二层,76,57})慈恩寺方丈#m#u#W进入下一层吧。',
            [8] = '#W#u#G#m({大雁塔三层,25,37})慈恩寺方丈#m#u#W正在等你们,好像有什么事情,快去找他。',
            [9] = '#W火妖在#u#G#m({大雁塔三层,130,60})（130,60）#m#u#W,速去降服。',
            [10] = '#W你们下一个目标是#G'..五行阵[self.击杀进度]..'#W快去破除下一阵眼。',
            [11] = '#W怪物首领出现在#u#G#m({大雁塔三层,'..self.坐标记录[11].x..','..self.坐标记录[11].y..'})（'..self.坐标记录[11].x..','..self.坐标记录[11].y..'）#m#u#W请火速前往消灭。',
            [12] = '#W回去找#u#G#m({大雁塔三层,25,37})慈恩寺方丈#m#u#W进入下一层。',
            [13] = '#W#u#G#m({大雁塔四层,35,32})慈恩寺方丈#m#u#W正在等你们,好像有什么事情,快去找他。',
            [14] = '#G巫支祁兄长#W现形在#u#G#m({大雁塔四层,'..self.坐标记录[13].x..','..self.坐标记录[13].y..'})（'..self.坐标记录[13].x..','..self.坐标记录[13].y..'）#m#u#W,速去铲除。',
            [15] = '#W回去找#u#G#m({大雁塔四层,35,32})慈恩寺方丈#m#u#W进入下一层。',
            [16] = '#W#u#G#m({大雁塔五层,62,55})慈恩寺方丈#m#u#W正在等你们,好像有什么事情,快去找他。',
            [17] = '#G奢比尸#W现形在#u#G#m({大雁塔五层,'..self.坐标记录[16].x..','..self.坐标记录[16].y..'})（'..self.坐标记录[16].x..','..self.坐标记录[16].y..'）#m#u#W,速去铲除。',
            [18] = '#W此间事了,回去找#u#G#m({大雁塔五层,62,55})慈恩寺方丈#m#u#W离开吧。',
        }
        return _任务详情[self.进度]
    end

end

function 任务:任务触发暗雷(玩家)
    if self.进度 == 5 then
        local r = 玩家:进入战斗('scripts/task/日常/日常_大雁塔任务.lua', self)
        if r then
            if math.random(1,100) >= 50 then
                self.进度 = 6
                玩家:刷新追踪面板()
                玩家:提示窗口('#Y找到丢失的画轴了,快去还给方丈吧。')
            end
        end
    end
    return false
end

function 任务:任务取消(玩家)
    self:删除()
    local map = 玩家:取地图(1006)
    if map then
        map:删除NPC(self.NPC)
    end
    map = 玩家:取地图(1007)
    if map then
        map:删除NPC(self.NPC)
    end
    map = 玩家:取地图(1008)
    if map then
        map:删除NPC(self.NPC)
    end
end

function 任务:任务更新(sec, 玩家)
    if os.time() > self.时间 then
        self:删除()
        local map = 玩家:取地图(1006)
        if map then
            map:删除NPC(self.NPC)
        end
        map = 玩家:取地图(1007)
        if map then
            map:删除NPC(self.NPC)
        end
        map = 玩家:取地图(1008)
        if map then
            map:删除NPC(self.NPC)
        end
    end
end

function 任务:任务上线(玩家)
end

function 任务:添加任务(玩家)
    self.队伍 = {}
    self.时间 = os.time() + 3600
    self.进度 = 1
    self.击杀进度 = 1
    for k, v in 玩家:遍历队伍() do
        table.insert(self.队伍, v.nid)
        v:添加任务(self)
    end
    玩家:刷新追踪面板()
    return true
end

local 对话 = [[想不到你们还有些本事,倒是我小看了你们！
menu
受死吧
再准备准备
]]
local 对话1 = [[好大的胆子,竟敢挑衅本王！
menu
区区妖魔也敢称王
再准备准备
]]

local 对话2 = [[何方宵小,竟敢来此放肆!
menu
妖孽,人人得而诛之
再准备准备
]]


function 任务:NPC对话(玩家, i)
    local r = 玩家:取任务("日常_大雁塔任务")
    if r.进度 == 11 then
        if r and r.NPC == self.来源.NPC then
            return 对话
        end
    elseif r.进度 == 14 then
        if r and r.NPC == self.来源.NPC then
            return 对话1
        end
    elseif r.进度 == 17 then
        if r and r.NPC == self.来源.NPC then
            return 对话2
        end
    end
    return "我认识你么？"
end

function 任务:NPC菜单(玩家, i)
    local rr = 玩家:取任务("日常_大雁塔任务")
    if rr then
        if rr.进度 == 11 then
            if i == '受死吧' then
                local r = 玩家:进入战斗('scripts/task/日常/日常_大雁塔任务.lua', rr)
                if r then
                    local 经验 = 7000000
                    if 玩家.是否组队 then
                        for _, v in 玩家:遍历队伍() do
                            local rr = v:取任务('日常_大雁塔任务')
                            if rr then
                                rr.进度 = 12
                                v:刷新追踪面板()
                                v:添加任务经验(经验, "大雁塔三层")
                                v:添加除妖奖章(2)
                            end
                        end
                    else
                        rr.进度 = 12
                        玩家:刷新追踪面板()
                        玩家:添加任务经验(经验, "大雁塔三层")
                        玩家:添加除妖奖章(2)
                    end
                    local map = 玩家:取地图(1006)
                    if map then
                        map:删除NPC(rr.NPC)
                    end
                end
            end
        elseif rr.进度 == 14 then
            if i == '区区妖魔也敢称王' then
                local r = 玩家:进入战斗('scripts/task/日常/日常_大雁塔任务.lua', rr)
                if r then
                    local 经验 = 9000000
                    if 玩家.是否组队 then
                        for _, v in 玩家:遍历队伍() do
                            local rr = v:取任务('日常_大雁塔任务')
                            if rr then
                                rr.进度 = 15
                                v:刷新追踪面板()
                                v:添加任务经验(经验, "大雁塔四层")
                                v:添加除妖奖章(2)
                            end
                        end
                    else
                        rr.进度 = 15
                        玩家:刷新追踪面板()
                        玩家:添加任务经验(经验, "大雁塔四层")
                        玩家:添加除妖奖章(2)
                    end
                    local map = 玩家:取地图(1007)
                    if map then
                        map:删除NPC(rr.NPC)
                    end
                end
            end
        elseif rr.进度 == 17 then
            if i == '妖孽,人人得而诛之' then
                local r = 玩家:进入战斗('scripts/task/日常/日常_大雁塔任务.lua', rr)
                if r then
                    local 经验 = 12000000
                    if 玩家.是否组队 then
                        for _, v in 玩家:遍历队伍() do
                            local rr = v:取任务('日常_大雁塔任务')
                            if rr then
                                rr.进度 = 18
                                v:刷新追踪面板()
                                v:添加任务经验(经验, "大雁塔五层")
                                v:添加除妖奖章(2)
                            end
                        end
                    else
                        rr.进度 = 18
                        玩家:刷新追踪面板()
                        玩家:添加任务经验(经验, "大雁塔五层")
                        玩家:添加除妖奖章(2)
                    end
                    local map = 玩家:取地图(1008)
                    if map then
                        map:删除NPC(rr.NPC)
                    end
                end
            end
        end
    end

end

function 任务:任务NPC对话(玩家, NPC)
    -- print('啥是啥')
    -- local r = 玩家:取任务("日常_修罗任务")
    -- if r and r.nid == self.来源.nid then
    --     return 对话
    -- end
    -- return "我认识你么？"
end

function 任务:任务NPC菜单(玩家, NPC, i)
    if NPC.名称 == '慈恩寺方丈' then
        if self.进度 == 1 then
            if i == '好,快给我镜子' then
                self.进度 = 2
                玩家:添加物品 { 生成物品 { 名称 = '镇妖镜', 数量 = 1 }}
                local map = 玩家:取当前地图()
                if map then
                    local X, Y = map:取随机坐标()
                    self.坐标记录[self.进度] = {x = X , y = Y}
                end
                玩家:刷新追踪面板()
            end
        elseif self.进度 == 2 then
            玩家:添加物品 { 生成物品 { 名称 = '镇妖镜', 数量 = 1 }}
            -- 玩家:提示窗口('#Y获得镇妖镜。')
        elseif self.进度 == 3 then
            if i == '进入下一层' then
                玩家:切换地图(1005, 68, 56)
                self.进度 = 4
                玩家:刷新追踪面板()
            end
        elseif self.进度 == 4 then
            if i == '路不拾遗乃侠士所为,交给我了' then
                self.进度 = 5
                玩家:刷新追踪面板()
            end
        elseif self.进度 == 6 then
            if i == '归还画轴' then
                local 经验 = 5000000
                if 玩家.是否组队 then
                    for _, v in 玩家:遍历队伍() do
                        local rr = v:取任务('日常_大雁塔任务')
                        if rr then
                            rr.进度 = 7
                            v:刷新追踪面板()
                            v:添加任务经验(经验, "大雁塔二层")
                            v:添加除妖奖章(1)
                        end
                    end
                else
                    self.进度 = 7
                    玩家:刷新追踪面板()
                    玩家:添加任务经验(经验, "大雁塔二层")
                    玩家:添加除妖奖章(1)
                end
            end
        elseif self.进度 == 7 then
            if i == '进入下一层' then
                玩家:切换地图(1006, 28, 33)
                self.进度 = 8
                玩家:刷新追踪面板()
            end
        elseif self.进度 == 8 then
            if i == '看我来破这五行阵' then
                self.进度 = 9
                self.击杀进度 = 1
                玩家:刷新追踪面板()
            end
        elseif self.进度 == 12 then
            if i == '多谢提醒,送我上去先' then
                玩家:切换地图(1007, 34, 30)
                self.进度 = 13
                玩家:刷新追踪面板()
            end
        elseif self.进度 == 13 then
            if i == '好,等我的好消息' then
                self:生成怪物(玩家)
                玩家:提示窗口('#Y巫支祁现行在('..self.坐标记录[13].x..','..self.坐标记录[13].y..'),速去铲除。')
                self.进度 = 14
                玩家:刷新追踪面板()
            end
        elseif self.进度 == 15 then
            if i == '当然愿意,送我上去' then
                玩家:切换地图(1008, 71, 58)
                self.进度 = 16
                玩家:刷新追踪面板()
            end
        elseif self.进度 == 16 then
            if i == '好,等我的好消息' then
                self:生成怪物(玩家)
                玩家:提示窗口('#Y奢比尸现行在('..self.坐标记录[16].x..','..self.坐标记录[16].y..'),速去铲除。')
                self.进度 = 17
                玩家:刷新追踪面板()
            end
        elseif self.进度 == 18 then
            if i == '好的' then
                玩家:切换地图(1001, 103, 199)
                self:任务取消(玩家)
                玩家:刷新追踪面板()
            end
        end
    elseif NPC.名称 == 五行阵[self.击杀进度] then
        if i == '就是你了,看我来破你这五行阵' then
            local r = 玩家:进入战斗('scripts/task/日常/日常_大雁塔任务.lua', self)
            if r then
                if self.击杀进度 == 1 then
                    self.进度 = 10
                elseif self.击杀进度 == 5 then
                    self:生成怪物(玩家)
                    玩家:提示窗口('#Y你们战胜了'..五行阵[self.击杀进度]..',快去破除下一阵眼。')
                    玩家:提示窗口('#Y你们成功破除了五行阵,怪物首领出现在('..self.坐标记录[11].x..','..self.坐标记录[11].y..'),火速前往铲除妖魔。')
                    self.进度 = 11
                    玩家:刷新追踪面板()
                    return
                end
                玩家:提示窗口('#Y你们战胜了'..五行阵[self.击杀进度]..',快去破除下一阵眼。')
                self.击杀进度 = self.击杀进度 + 1
                玩家:刷新追踪面板()
            end
        end
    end
end

function 任务:生成怪物(玩家)
    local map = 玩家:取当前地图()
    if not map then
        return
    end
    if self.进度 == 10 then
        local X, Y = map:取随机坐标()
        self.坐标记录[11] = {x = X , y = Y}
        self.NPC =
        map:添加NPC {
            队伍 = self.队伍,
            归属 = 玩家.nid,
            时长 = 1800,
            名称 = '禺疆',
            外形 = 2170,
            脚本 = 'scripts/task/日常/日常_大雁塔任务.lua',
            时间 = self.时间,
            X = X,
            Y = Y,
            来源 = self
        }
    elseif self.进度 == 13 then
        local X, Y = map:取随机坐标()
        self.坐标记录[13] = {x = X , y = Y}
        self.NPC =
        map:添加NPC {
            队伍 = self.队伍,
            归属 = 玩家.nid,
            时长 = 1800,
            名称 = '巫支祁',
            外形 = 2090,
            脚本 = 'scripts/task/日常/日常_大雁塔任务.lua',
            时间 = self.时间,
            X = X,
            Y = Y,
            来源 = self
        }
    elseif self.进度 == 16 then
        self.NPCs = {}
        local X, Y = map:取随机坐标()
        self.坐标记录[16] = {x = X , y = Y}
        self.NPC =
        map:添加NPC {
            队伍 = self.队伍,
            归属 = 玩家.nid,
            时长 = 1800,
            名称 = '奢比尸',
            外形 = 2089,
            脚本 = 'scripts/task/日常/日常_大雁塔任务.lua',
            时间 = self.时间,
            X = X,
            Y = Y,
            来源 = self
        }
    end
    return true
end

function 任务:任务进入战斗(玩家)
    if self.进度 == 2 then
        local r = 玩家:进入战斗('scripts/task/日常/日常_大雁塔任务.lua', self)
        if r then
            local 经验 = 3000000
            if 玩家.是否组队 then
                for _, v in 玩家:遍历队伍() do
                    local rr = v:取任务('日常_大雁塔任务')
                    if rr then
                        rr.进度 = 3
                        v:刷新追踪面板()
                        v:添加任务经验(经验, "大雁塔一层")
                        v:添加除妖奖章(1)
                    end
                end
            else
                self.进度 = 3
                玩家:刷新追踪面板()
                玩家:添加任务经验(经验, "大雁塔一层")
                玩家:添加除妖奖章(1)
            end
        end
    end
end



function 任务:战斗初始化(玩家,s)
    local 等级 = 玩家:取队伍平均等级() + 10
    if 等级 < 80 then
        等级 = 80
    end
    print('当前进度',s.进度)
    local _技能 = { {名称 = '狮王之怒' , 熟练度 = 6000} , {名称 = '楚楚可怜' , 熟练度 = 6000} , {名称 = '九阴纯火' , 熟练度 = 6000} , {名称 = '九龙冰封' , 熟练度 = 6000} , {名称 = '三味真火' , 熟练度 = 6000} , {名称 = '龙啸九天' , 熟练度 = 6000} }
    if s.进度 == 2 then
        local _怪物 = {
            { 名称 = "玄蜂", 外形 = 2367, 等级 = 等级 , 血初值 = 30000, 法初值 = 999999999, 攻初值 = 400, 敏初值 = 500 , 施法几率 = 50 , 技能 = {{名称 = '万毒攻心' , 熟练度 = 6000},{名称 = '冥烟销骨' , 熟练度 = 6000}},抗性 = {物理吸收 = 30,抗震慑 = 10}},
            { 名称 = "玄蜂护卫", 外形 = 2033, 等级 = 等级, 等级 = 等级, 血初值 = 12000, 法初值 = 999999999, 攻初值 = 500, 敏初值 = 20, 抗性 = {物理吸收 = 30,抗震慑 = 5 , 连击率 = 40 , 连击 = 4 , 命中率 = 50 , 致命几率 = 20 , 狂暴几率 = 20} },
            { 名称 = "玄蜂护卫", 外形 = 2033, 等级 = 等级, 等级 = 等级, 血初值 = 12000, 法初值 = 999999999, 攻初值 = 500, 敏初值 = 20, 抗性 = {物理吸收 = 30,抗震慑 = 5 , 连击率 = 40 , 连击 = 4 , 命中率 = 50 , 致命几率 = 20 , 狂暴几率 = 20} },
            { 名称 = "妖蜂", 外形 = 2033, 等级 = 等级, 等级 = 等级, 血初值 = 18000, 法初值 = 999999999, 攻初值 = 20, 敏初值 = 200 , 技能 = _技能 , 施法几率 = 50, 抗性 = {物理吸收 = 30,抗震慑 = 5} },
            { 名称 = "鬼蜂", 外形 = 2033, 等级 = 等级, 等级 = 等级, 血初值 = 18000, 法初值 = 999999999, 攻初值 = 20, 敏初值 = 200 , 技能 = _技能 , 施法几率 = 50, 抗性 = {物理吸收 = 30,抗震慑 = 5} },
            { 名称 = "鬼蜂", 外形 = 2033, 等级 = 等级, 等级 = 等级, 血初值 = 18000, 法初值 = 999999999, 攻初值 = 20, 敏初值 = 200 , 技能 = _技能 , 施法几率 = 50, 抗性 = {物理吸收 = 30,抗震慑 = 5} },
            { 名称 = "妖蜂", 外形 = 2033, 等级 = 等级, 等级 = 等级, 血初值 = 18000, 法初值 = 999999999, 攻初值 = 20, 敏初值 = 200 , 技能 = _技能 , 施法几率 = 50, 抗性 = {物理吸收 = 30,抗震慑 = 5} }
        }
        for i = 1, 7 do
            local r = 生成战斗怪物(生成怪物属性(_怪物[i]))
            self:加入敌方(i, r)
        end
    elseif s.进度 == 5 then
        local _怪物 = {
            { 名称 = "文鳐", 外形 = 2032, 等级 = 等级, 等级 = 等级, 血初值 = 10000, 法初值 = 999999999, 攻初值 = 100, 敏初值 = 200 },
            { 名称 = "蝮虫", 外形 = 2031, 等级 = 等级, 等级 = 等级, 血初值 = 10000, 法初值 = 999999999, 攻初值 = 100, 敏初值 = 200 },
            { 名称 = "玄龟", 外形 = 2036, 等级 = 等级, 等级 = 等级, 血初值 = 10000, 法初值 = 999999999, 攻初值 = 100, 敏初值 = 200 },
            { 名称 = "玄龟", 外形 = 2036, 等级 = 等级, 等级 = 等级, 血初值 = 10000, 法初值 = 999999999, 攻初值 = 100, 敏初值 = 200 },
            { 名称 = "蝮虫", 外形 = 2031, 等级 = 等级, 等级 = 等级, 血初值 = 10000, 法初值 = 999999999, 攻初值 = 100, 敏初值 = 200 }
        }
        for i = 1, 5 do
            local r = 生成战斗怪物(生成怪物属性(_怪物[i] , '简单' , nil , '低级法术'))
            self:加入敌方(i, r)
        end
    elseif s.进度 == 9 or s.进度 == 10 then
        local _怪物 = {
            [1] = {
                { 名称 = "火妖", 外形 = 2291, 等级 = 等级, 血初值 = 38000, 法初值 = 999999999, 攻初值 = 168, 敏初值 = 900 , 技能 = { {名称 = '断肠烈散' , 熟练度 = 8000} , {名称 = '万毒攻心' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 10, 抗混乱 = 70, 抗昏睡 = 200, 抗封印 = 50, 抗遗忘 = 20 , 物理吸收 = 30} },
                { 名称 = "赤焰妖", 外形 = 2103, 等级 = 等级, 血初值 = 7000, 法初值 = 999999999, 攻初值 = 120, 敏初值 = 91 , 技能 = { {名称 = '烈火骄阳' , 熟练度 = 8000} , {名称 = '九阴纯火' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30} },
                { 名称 = "赤焰妖", 外形 = 2103, 等级 = 等级, 血初值 = 7000, 法初值 = 999999999, 攻初值 = 120, 敏初值 = 91 , 技能 = { {名称 = '烈火骄阳' , 熟练度 = 8000} , {名称 = '九阴纯火' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30} },
                { 名称 = "赤焰妖", 外形 = 2103, 等级 = 等级, 血初值 = 7000, 法初值 = 999999999, 攻初值 = 120, 敏初值 = 91 , 技能 = { {名称 = '烈火骄阳' , 熟练度 = 8000} , {名称 = '九阴纯火' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30} },
                { 名称 = "赤焰妖", 外形 = 2103, 等级 = 等级, 血初值 = 7000, 法初值 = 999999999, 攻初值 = 120, 敏初值 = 91 , 技能 = { {名称 = '烈火骄阳' , 熟练度 = 8000} , {名称 = '九阴纯火' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30} },
                { 名称 = "赤焰妖", 外形 = 2103, 等级 = 等级, 血初值 = 7000, 法初值 = 999999999, 攻初值 = 120, 敏初值 = 91 , 技能 = { {名称 = '烈火骄阳' , 熟练度 = 8000} , {名称 = '九阴纯火' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30} },
                { 名称 = "赤焰妖", 外形 = 2103, 等级 = 等级, 血初值 = 7000, 法初值 = 999999999, 攻初值 = 120, 敏初值 = 91 , 技能 = { {名称 = '烈火骄阳' , 熟练度 = 8000} , {名称 = '九阴纯火' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30} }
            },
            [2] = {
                { 名称 = "金鬼", 外形 = 2288, 等级 = 等级, 血初值 = 27000, 法初值 = 999999999, 攻初值 = 600, 敏初值 = 900 , 抗性 = {抗震慑 = 10, 抗混乱 = 70, 抗昏睡 = 200, 抗封印 = 50, 抗遗忘 = 20 , 物理吸收 = 30 , 连击率 = 60 , 连击 = 5 , 命中率 = 68 , 致命几率 = 68 , 忽视防御几率 = 80 , 忽视防御程度 = 100} },
                { 名称 = "黄金兽", 外形 = 2097, 等级 = 等级, 血初值 = 7000, 法初值 = 999999999, 攻初值 = 360, 敏初值 = 550 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30 , 连击率 = 60 , 连击 = 3 , 命中率 = 40 , 致命几率 = 40 , 忽视防御几率 = 60 , 忽视防御程度 = 80} },
                { 名称 = "黄金兽", 外形 = 2097, 等级 = 等级, 血初值 = 7000, 法初值 = 999999999, 攻初值 = 360, 敏初值 = 550 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30 , 连击率 = 60 , 连击 = 3 , 命中率 = 40 , 致命几率 = 40 , 忽视防御几率 = 60 , 忽视防御程度 = 80} },
                { 名称 = "黄金兽", 外形 = 2097, 等级 = 等级, 血初值 = 7000, 法初值 = 999999999, 攻初值 = 360, 敏初值 = 550 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30 , 连击率 = 60 , 连击 = 3 , 命中率 = 40 , 致命几率 = 40 , 忽视防御几率 = 60 , 忽视防御程度 = 80} },
                { 名称 = "黄金兽", 外形 = 2097, 等级 = 等级, 血初值 = 7000, 法初值 = 999999999, 攻初值 = 360, 敏初值 = 550 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30 , 连击率 = 60 , 连击 = 3 , 命中率 = 40 , 致命几率 = 40 , 忽视防御几率 = 60 , 忽视防御程度 = 80} },
                { 名称 = "黄金兽", 外形 = 2097, 等级 = 等级, 血初值 = 7000, 法初值 = 999999999, 攻初值 = 360, 敏初值 = 550 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30 , 连击率 = 60 , 连击 = 3 , 命中率 = 40 , 致命几率 = 40 , 忽视防御几率 = 60 , 忽视防御程度 = 80} },
                { 名称 = "黄金兽", 外形 = 2097, 等级 = 等级, 血初值 = 7000, 法初值 = 999999999, 攻初值 = 360, 敏初值 = 550 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30 , 连击率 = 60 , 连击 = 3 , 命中率 = 40 , 致命几率 = 40 , 忽视防御几率 = 60 , 忽视防御程度 = 80} }
            },
            [3] = {
                { 名称 = "木鬼", 外形 = 2289, 等级 = 等级, 血初值 = 27000, 法初值 = 999999999, 攻初值 = 400, 敏初值 = 900 , 技能 = { {名称 = '啮骨抽髓' , 熟练度 = 8000}, {名称 = '血煞之蛊' , 熟练度 = 8000}, {名称 = '吸星大法' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 10, 抗混乱 = 70, 抗昏睡 = 200, 抗封印 = 50, 抗遗忘 = 20 , 物理吸收 = 30 , 连击率 = 60 , 连击 = 5 , 命中率 = 68 , 致命几率 = 68} },
                { 名称 = "桃树精", 外形 = 2095, 等级 = 等级, 血初值 = 8000, 法初值 = 999999999, 攻初值 = 12, 敏初值 = 50 , 技能 = { {名称 = '血煞之蛊' , 熟练度 = 8000}, {名称 = '啮骨抽髓' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30} },
                { 名称 = "桃树精", 外形 = 2095, 等级 = 等级, 血初值 = 8000, 法初值 = 999999999, 攻初值 = 12, 敏初值 = 50 , 技能 = { {名称 = '血煞之蛊' , 熟练度 = 8000}, {名称 = '啮骨抽髓' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30} },
                { 名称 = "桃树精", 外形 = 2095, 等级 = 等级, 血初值 = 8000, 法初值 = 999999999, 攻初值 = 12, 敏初值 = 50 , 技能 = { {名称 = '血煞之蛊' , 熟练度 = 8000}, {名称 = '啮骨抽髓' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30} },
                { 名称 = "桃树精", 外形 = 2095, 等级 = 等级, 血初值 = 8000, 法初值 = 999999999, 攻初值 = 12, 敏初值 = 50 , 技能 = { {名称 = '血煞之蛊' , 熟练度 = 8000}, {名称 = '啮骨抽髓' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30} },
                { 名称 = "桃树精", 外形 = 2095, 等级 = 等级, 血初值 = 8000, 法初值 = 999999999, 攻初值 = 12, 敏初值 = 50 , 技能 = { {名称 = '血煞之蛊' , 熟练度 = 8000}, {名称 = '啮骨抽髓' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30} },
                { 名称 = "桃树精", 外形 = 2095, 等级 = 等级, 血初值 = 8000, 法初值 = 999999999, 攻初值 = 12, 敏初值 = 50 , 技能 = { {名称 = '血煞之蛊' , 熟练度 = 8000}, {名称 = '啮骨抽髓' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30} }
            },
            [4] = {
                { 名称 = "尘魔", 外形 = 2292, 等级 = 等级, 血初值 = 30000, 法初值 = 999999999, 攻初值 = 600, 敏初值 = 900 , 抗性 = {抗震慑 = 10, 抗混乱 = 70, 抗昏睡 = 200, 抗封印 = 50, 抗遗忘 = 20 , 物理吸收 = 30 , 连击率 = 60 , 连击 = 5 , 命中率 = 68 , 致命几率 = 68 } },
                { 名称 = "泥石怪", 外形 = 2101, 等级 = 等级, 血初值 = 24000, 法初值 = 999999999, 攻初值 = 400, 敏初值 = 1 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30 , 连击率 = 60 , 连击 = 3 , 命中率 = 40 , 致命几率 = 40 } },
                { 名称 = "泥石怪", 外形 = 2101, 等级 = 等级, 血初值 = 24000, 法初值 = 999999999, 攻初值 = 400, 敏初值 = 1 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30 , 连击率 = 60 , 连击 = 3 , 命中率 = 40 , 致命几率 = 40 } },
                { 名称 = "泥石怪", 外形 = 2101, 等级 = 等级, 血初值 = 24000, 法初值 = 999999999, 攻初值 = 400, 敏初值 = 1 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30 , 连击率 = 60 , 连击 = 3 , 命中率 = 40 , 致命几率 = 40 } },
                { 名称 = "泥石怪", 外形 = 2101, 等级 = 等级, 血初值 = 2400, 法初值 = 999999999, 攻初值 = 400, 敏初值 = 1 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30 , 连击率 = 60 , 连击 = 3 , 命中率 = 40 , 致命几率 = 40 } },
                { 名称 = "泥石怪", 外形 = 2101, 等级 = 等级, 血初值 = 24000, 法初值 = 999999999, 攻初值 = 400, 敏初值 = 1 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30 , 连击率 = 60 , 连击 = 3 , 命中率 = 40 , 致命几率 = 40 } },
                { 名称 = "泥石怪", 外形 = 2101, 等级 = 等级, 血初值 = 24000, 法初值 = 999999999, 攻初值 = 400, 敏初值 = 1 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30 , 连击率 = 60 , 连击 = 3 , 命中率 = 40 , 致命几率 = 40 } }
            },
            [5] = {
                { 名称 = "水妖", 外形 = 2290, 等级 = 等级, 血初值 = 31000, 法初值 = 999999999, 攻初值 = 20, 敏初值 = 200 , 技能 = { {名称 = '百日眠' , 熟练度 = 8000}, {名称 = '迷魂醉' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 10, 抗混乱 = 70, 抗昏睡 = 200, 抗封印 = 50, 抗遗忘 = 20 , 物理吸收 = 30} },
                { 名称 = "水灵仙", 外形 = 2100, 等级 = 等级, 血初值 = 8000, 法初值 = 999999999, 攻初值 = 15, 敏初值 = 145 , 技能 = { {名称 = '蛟龙出海' , 熟练度 = 8000}, {名称 = '九龙冰封' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30} },
                { 名称 = "水灵仙", 外形 = 2100, 等级 = 等级, 血初值 = 8000, 法初值 = 999999999, 攻初值 = 15, 敏初值 = 145 , 技能 = { {名称 = '蛟龙出海' , 熟练度 = 8000}, {名称 = '九龙冰封' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30} },
                { 名称 = "水灵仙", 外形 = 2100, 等级 = 等级, 血初值 = 8000, 法初值 = 999999999, 攻初值 = 15, 敏初值 = 145 , 技能 = { {名称 = '蛟龙出海' , 熟练度 = 8000}, {名称 = '九龙冰封' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30} },
                { 名称 = "水灵仙", 外形 = 2100, 等级 = 等级, 血初值 = 8000, 法初值 = 999999999, 攻初值 = 15, 敏初值 = 145 , 技能 = { {名称 = '蛟龙出海' , 熟练度 = 8000}, {名称 = '九龙冰封' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30} },
                { 名称 = "水灵仙", 外形 = 2100, 等级 = 等级, 血初值 = 8000, 法初值 = 999999999, 攻初值 = 15, 敏初值 = 145 , 技能 = { {名称 = '蛟龙出海' , 熟练度 = 8000}, {名称 = '九龙冰封' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30} },
                { 名称 = "水灵仙", 外形 = 2100, 等级 = 等级, 血初值 = 8000, 法初值 = 999999999, 攻初值 = 15, 敏初值 = 145 , 技能 = { {名称 = '蛟龙出海' , 熟练度 = 8000}, {名称 = '九龙冰封' , 熟练度 = 8000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 5, 抗混乱 = 50, 抗昏睡 = 200, 抗封印 = 30, 抗遗忘 = 20 , 物理吸收 = 30} }
            },
        }
        for i = 1, 7 do
            local r = 生成战斗怪物(生成怪物属性(_怪物[s.击杀进度][i]))
            self:加入敌方(i, r)
        end
    elseif s.进度 == 11 then
        local _怪物 = {
            { 名称 = "禺疆", 外形 = 2170, 等级 = 等级, 血初值 = 38000, 法初值 = 999999999, 攻初值 = 600, 敏初值 = 480 , 技能 = { {名称 = '借刀杀人' , 熟练度 = 10000}, {名称 = '失心狂乱' , 熟练度 = 10000}, {名称 = '迷魂醉' , 熟练度 = 10000}, {名称 = '百日眠' , 熟练度 = 10000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 20 , 抗混乱 = 130 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 80 , 抗风 = 20 , 抗火 = 20 , 抗水 = 20 , 抗雷 = 20 , 物理吸收 = 40 , 抗致命几率 = 25 , 连击率 = 80 , 连击 = 3 , 命中率 = 80 , 致命几率 = 40 , 忽视防御几率 = 100 , 忽视防御程度 = 120 , 反击率 = 80 , 反击 = 2} },
            { 名称 = "木鬼", 外形 = 2289, 等级 = 等级, 血初值 = 34000, 法初值 = 999999999, 攻初值 = 500, 敏初值 = 400 , 技能 = { {名称 = '啮骨抽髓' , 熟练度 = 10000}, {名称 = '吸星大法' , 熟练度 = 10000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 10 , 抗混乱 = 100 , 抗昏睡 = 200 , 抗封印 = 80 , 抗遗忘 = 80 , 抗风 = 20 , 抗火 = 20 , 抗水 = 20 , 抗雷 = 20 , 物理吸收 = 40 , 抗致命几率 = 25 , 连击率 = 60 , 连击 = 5 , 命中率 = 68 , 致命几率 = 68} },
            { 名称 = "金鬼", 外形 = 2288, 等级 = 等级, 血初值 = 34000, 法初值 = 999999999, 攻初值 = 160, 敏初值 = 500 , 技能 = { {名称 = '失心疯' , 熟练度 = 10000}, {名称 = '袖里乾坤' , 熟练度 = 10000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 10 , 抗混乱 = 100 , 抗昏睡 = 200 , 抗封印 = 80 , 抗遗忘 = 80 , 抗风 = 20 , 抗火 = 20 , 抗水 = 20 , 抗雷 = 20 , 物理吸收 = 40 , 抗致命几率 = 25 , 连击率 = 60 , 连击 = 5 , 命中率 = 68 , 致命几率 = 68 , 忽视防御几率 = 80 , 忽视防御程度 = 100} },
            { 名称 = "火妖", 外形 = 2291, 等级 = 等级, 血初值 = 34000, 法初值 = 999999999, 攻初值 = 160, 敏初值 = 360 , 技能 = { {名称 = '三味真火' , 熟练度 = 10000}, {名称 = '九阴纯火' , 熟练度 = 10000} } , 施法几率 = 80 , 抗性 = {抗震慑 = 10 , 抗混乱 = 100 , 抗昏睡 = 200 , 抗封印 = 80 , 抗遗忘 = 80 , 抗风 = 20 , 抗火 = 20 , 抗水 = 20 , 抗雷 = 20 , 物理吸收 = 40 , 抗致命几率 = 25 } },
            { 名称 = "水妖", 外形 = 2290, 等级 = 等级, 血初值 = 34000, 法初值 = 999999999, 攻初值 = 160, 敏初值 = 550 , 技能 = { {名称 = '龙啸九天' , 熟练度 = 10000}, {名称 = '九龙冰封' , 熟练度 = 10000} } , 施法几率 = 80 , 抗性 = {抗震慑 = 10 , 抗混乱 = 100 , 抗昏睡 = 200 , 抗封印 = 80 , 抗遗忘 = 80 , 抗风 = 20 , 抗火 = 20 , 抗水 = 20 , 抗雷 = 20 , 物理吸收 = 40 , 抗致命几率 = 25 } },
            { 名称 = "尘魔", 外形 = 2292, 等级 = 等级, 血初值 = 36000, 法初值 = 999999999, 攻初值 = 900, 敏初值 = 200 , 抗性 = {抗震慑 = 10 , 抗混乱 = 100 , 抗昏睡 = 200 , 抗封印 = 80 , 抗遗忘 = 80 , 抗风 = 20 , 抗火 = 20 , 抗水 = 20 , 抗雷 = 20 , 物理吸收 = 40 , 抗致命几率 = 25 , 连击率 = 80 , 连击 = 5 , 命中率 = 68 , 致命几率 = 68 } }
        }
        for i = 1, 6 do
            local r = 生成战斗怪物(生成怪物属性(_怪物[i]))
            self:加入敌方(i, r)
        end
    elseif s.进度 == 14 then
        local _怪物 = {
            { 名称 = "巫支祁", 外形 = 2090, 等级 = 等级, 血初值 = 94000, 法初值 = 999999999, 攻初值 = 500, 敏初值 = 800 , 技能 = { {名称 = '九龙冰封' , 熟练度 = 15000}, {名称 = '天诛地灭' , 熟练度 = 15000}, {名称 = '电闪雷鸣' , 熟练度 = 15000}, {名称 = '蛟龙出海' , 熟练度 = 15000}, {名称 = '袖里乾坤' , 熟练度 = 15000}, {名称 = '风雷涌动' , 熟练度 = 15000} } , 施法几率 = 80 , 抗性 = {抗混乱 = 130 , 抗昏睡 = 200 , 抗封印 = 110 , 抗遗忘 = 110 , 抗风 = 20 , 抗火 = 20 , 抗水 = 20 , 抗雷 = 20 , 抗毒伤害 = 7000 , 物理吸收 = 50 , 忽视抗水 = 15 , 加强水 = 30 , 忽视抗风 = 15 , 加强风 = 30 , 忽视抗雷 = 15 , 加强雷 = 30} },
            { 名称 = "木魅", 外形 = 2095, 等级 = 等级, 血初值 = 96000, 法初值 = 999999999, 攻初值 = 160, 敏初值 = 600 , 技能 = { {名称 = '失心疯' , 熟练度 = 15000}, {名称 = '吸星大法' , 熟练度 = 15000} } , 施法几率 = 80 , 抗性 = {抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 100 , 抗风 = 10 , 抗火 = 10 , 抗水 = 10 , 抗雷 = 10 , 抗毒伤害 = 7000 , 物理吸收 = 50 } },
            { 名称 = "龙女", 外形 = 2024, 等级 = 等级, 血初值 = 100000, 法初值 = 999999999, 攻初值 = 50, 敏初值 = 700 , 抗性 = {抗混乱 = 120 , 抗昏睡 = 120 , 抗封印 = 120 , 抗遗忘 = 120 , 抗毒伤害 = 7000 , 物理吸收 = 50 } },
            { 名称 = "山精", 外形 = 2025, 等级 = 等级, 血初值 = 98000, 法初值 = 999999999, 攻初值 = 168, 敏初值 = -200 , 技能 = { {名称 = '断肠烈散' , 熟练度 = 15000}, {名称 = '万毒攻心' , 熟练度 = 10000}, {名称 = '血海深仇' , 熟练度 = 12000} } , 施法几率 = 80 , 抗性 = {抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 110 , 抗遗忘 = 110 , 抗风 = 10 , 抗火 = 10 , 抗水 = 10 , 抗雷 = 10 , 抗毒伤害 = 7000 , 物理吸收 = 50 , 忽视抗鬼火 = 30 } },
            { 名称 = "水妖", 外形 = 2069, 等级 = 等级, 血初值 = 108000, 法初值 = 999999999, 攻初值 = 160, 敏初值 = 400 , 技能 = { {名称 = '蛟龙出海' , 熟练度 = 15000}, {名称 = '九龙冰封' , 熟练度 = 15000}, {名称 = '烈火骄阳' , 熟练度 = 15000}, {名称 = '九阴纯火' , 熟练度 = 15000} } , 施法几率 = 80 , 抗性 = {抗震慑 = 10 , 抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 100 , 抗风 = 20 , 抗火 = 20 , 抗水 = 20 , 抗雷 = 20 , 物理吸收 = 50 , 忽视抗水 = 20 , 忽视抗火 = 20 , 水系狂暴几率 = 30 , 火系狂暴几率 = 30 } },
            { 名称 = "石生", 外形 = 2101, 等级 = 等级, 血初值 = 92000, 法初值 = 999999999, 攻初值 = 1800, 敏初值 = -100 , 抗性 = {抗震慑 = 10 , 抗混乱 = 110 , 抗昏睡 = 120 , 抗封印 = 100 , 抗遗忘 = 100 , 抗风 = 10 , 抗火 = 10 , 抗水 = 10 , 抗雷 = 10 , 抗毒伤害 = 7000 , 物理吸收 = 100 , 忽视防御几率 = 100 , 忽视防御程度 = 100 , 连击率 = 99 , 连击 = 9 , 狂暴几率 = 60 , 反击率 = 80 , 反击 = 3}, 内丹 = { { 技能 = "隔山打牛", 转生 = 2, 等级 = 140 } } },
            { 名称 = "二太子", 外形 = 2089, 等级 = 等级, 血初值 = 92000, 法初值 = 999999999, 攻初值 = 168, 敏初值 = 450 , 技能 = { {名称 = '失心狂乱' , 熟练度 = 15000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 10 , 抗混乱 = 120 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 100 , 抗风 = 10 , 抗火 = 10 , 抗水 = 10 , 抗雷 = 10 , 抗毒伤害 = 7000 , 物理吸收 = 40 , 加强混乱 = 10} },
            { 名称 = "大太子", 外形 = 2088, 等级 = 等级, 血初值 = 90000, 法初值 = 999999999, 攻初值 = 800, 敏初值 = 500 , 技能 = { {名称 = '销魂蚀骨' , 熟练度 = 15000}, {名称 = '阎罗追命' , 熟练度 = 15000}, {名称 = '魔音摄心' , 熟练度 = 15000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 10 , 抗混乱 = 120 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 100 , 抗风 = 10 , 抗火 = 10 , 抗水 = 10 , 抗雷 = 10 , 抗毒伤害 = 7000 , 物理吸收 = 40 } },
            { 名称 = "三太子", 外形 = 2127, 等级 = 等级, 血初值 = 89000, 法初值 = 999999999, 攻初值 = 168, 敏初值 = -300 , 技能 = { {名称 = '啮骨抽髓' , 熟练度 = 15000}, {名称 = '血煞之蛊' , 熟练度 = 15000}, {名称 = '吸星大法' , 熟练度 = 15000} } , 施法几率 = 50 , 抗性 = {抗震慑 = 10 , 抗混乱 = 120 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 100 , 抗风 = 10 , 抗火 = 10 , 抗水 = 10 , 抗雷 = 10 , 抗毒伤害 = 18000 , 物理吸收 = 40 } },

        }
        for i = 1, 9 do
             local r = 生成战斗怪物(生成怪物属性(_怪物[i]))
            self:加入敌方(i, r)
        end
    elseif s.进度 == 17 then
        local _怪物 = {
            { 名称 = "奢比尸", 外形 = 2089, 等级 = 等级, 血初值 = 58000, 法初值 = 999999999, 攻初值 = 300, 敏初值 = 900 , 技能 = { {名称 = '阎罗追命' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 30 , 抗混乱 = 150 , 抗昏睡 = 200 , 抗封印 = 120 , 抗遗忘 = 120 , 抗风 = 30 , 抗火 = 30 , 抗水 = 30 , 抗雷 = 30 , 抗鬼火 = 30 , 物理吸收 = 30 , 抗致命几率 = 30 , 加强震慑 = 10} },
            { 名称 = "恶毒的蝎精", 外形 = 2095, 等级 = 等级, 血初值 = 30000, 法初值 = 999999999, 攻初值 = 300, 敏初值 = 700 , 技能 = { {名称 = '魔音摄心' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 15 , 抗混乱 = 120 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 100 , 抗风 = 10 , 抗火 = 10 , 抗水 = 10 , 抗雷 = 10 , 抗鬼火 = 10 , 物理吸收 = 20 , 抗致命几率 = 30} },
            { 名称 = "花妖", 外形 = 2024, 等级 = 等级, 血初值 = 58000, 法初值 = 999999999, 攻初值 = 300, 敏初值 = 600 , 技能 = { {名称 = '阎罗追命' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 45 , 抗混乱 = 120 , 抗昏睡 = 200 , 抗封印 = 80 , 抗遗忘 = 100 , 抗风 = 80 , 抗火 = 80 , 抗水 = 80 , 抗雷 = 80 , 抗鬼火 = 80 , 物理吸收 = 100 , 抗致命几率 = 30 , 忽视抗混 = 5 , 加强混乱 = 5} },
            { 名称 = "美丽的花精", 外形 = 2025, 等级 = 等级, 血初值 = 58000, 法初值 = 999999999, 攻初值 = 300, 敏初值 = 400 , 技能 = { {名称 = '借刀杀人' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 25 , 抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 100 , 物理吸收 = 50 , 抗致命几率 = 30} },
            { 名称 = "恶毒的蝎精", 外形 = 2069, 等级 = 等级, 血初值 = 30000, 法初值 = 999999999, 攻初值 = 300, 敏初值 = 700 , 技能 = { {名称 = '魔音摄心' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 15 ,抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 100 , 抗风 = 10 , 抗火 = 10 , 抗水 = 10 , 抗雷 = 10 , 抗鬼火 = 10 , 物理吸收 = 20 , 抗致命几率 = 30 } },
            { 名称 = "美丽的花精", 外形 = 2101, 等级 = 等级, 血初值 = 58000, 法初值 = 999999999, 攻初值 = 300, 敏初值 = 400 , 技能 = { {名称 = '借刀杀人' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 25 , 抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 100 , 物理吸收 = 50 , 抗致命几率 = 30 , 忽视抗混 = 5 , 加强混乱 = 5 } },
            { 名称 = "贪睡的小蛇", 外形 = 2089, 等级 = 等级, 血初值 = 58000, 法初值 = 999999999, 攻初值 = 1500, 敏初值 = 15 , 技能 = { {名称 = '天诛地灭' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 15 ,抗混乱 = 120 , 抗封印 = 120 , 抗遗忘 = 200 , 物理吸收 = 30 , 抗致命几率 = 30 , 忽视防御几率 = 100 , 忽视防御程度 = 100 , 连击率 = 99 , 连击 = 5 , 狂暴几率 = 100 , 雷系狂暴几率 = 60 , 加强雷 = 30 , 忽视抗雷 = 100} },
            { 名称 = "贪睡的小蛇", 外形 = 2088, 等级 = 等级, 血初值 = 58000, 法初值 = 999999999, 攻初值 = 1500, 敏初值 = 15 , 技能 = { {名称 = '天诛地灭' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 15 ,抗混乱 = 120 , 抗封印 = 120 , 抗遗忘 = 200 , 物理吸收 = 30 , 抗致命几率 = 30 , 忽视防御几率 = 100 , 忽视防御程度 = 100 , 连击率 = 99 , 连击 = 5 , 狂暴几率 = 100 , 雷系狂暴几率 = 60 , 加强雷 = 30 , 忽视抗雷 = 100} },
            { 名称 = "贪睡的小蛇", 外形 = 2127, 等级 = 等级, 血初值 = 58000, 法初值 = 999999999, 攻初值 = 1500, 敏初值 = 15 , 技能 = { {名称 = '天诛地灭' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 15 ,抗混乱 = 120 , 抗封印 = 120 , 抗遗忘 = 200 , 物理吸收 = 30 , 抗致命几率 = 30 , 忽视防御几率 = 100 , 忽视防御程度 = 100 , 连击率 = 99 , 连击 = 5 , 狂暴几率 = 100 , 雷系狂暴几率 = 60 , 加强雷 = 30 , 忽视抗雷 = 100} }
        }
        for i = 1, 9 do
             local r = 生成战斗怪物(生成怪物属性(_怪物[i]))
            self:加入敌方(i, r)
        end
    end
end
function 任务:战斗回合开始(dt)
end

function 任务:战斗结束(dt)
    if dt then
        local zg = self:取对象(11)
        if zg then
            for k, v in self:遍历我方() do
                if v.是否玩家 then
                    local z = v.对象.接口:取乘骑坐骑()
                    if z then
                        z:添加经验(5)
                        z:添加熟练(5)
                    end
                end
            end
        end
    end
end

return 任务
