-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-01 12:16:40
-- @Last Modified time  : 2024-08-23 22:44:01

local 任务 = {
    名称 = '日常_地宫挑战',
    别名 = '地宫挑战',
    类型 = '挑战玩法',
    是否可取消 = true,
    是否可追踪 = true
}

function 任务:任务初始化(玩家, ...)
    self.坐标记录 = {}
end

function 任务:任务取详情(玩家)
    return '#Y任务目的：#r#W请速去幻境,#u#G#m({幻境,'..self.坐标记录.x..','..self.坐标记录.y..'})（'..self.坐标记录.x..','..self.坐标记录.y..'）#m#u#W镇杀妖魔。'
end

function 任务:任务取消(玩家)
    self:删除()
    local map = 玩家:取地图(1291)
    if map then
        map:删除NPC(self.NPC)
    end
end

function 任务:任务更新(sec, 玩家)
    if os.time() > self.时间 then
        self:删除()
        local map = 玩家:取地图(1291)
        if map then
            map:删除NPC(self.NPC)
        end
    end
end

function 任务:任务上线(玩家)
end

function 任务:添加任务(玩家 , 副本等级 , 难度)
    self.队伍 = {}
    self.副本等级 = 副本等级
    self.难度 = 难度
    self.时间 = os.time() + 3600
    for k, v in 玩家:遍历队伍() do
        table.insert(self.队伍, v.nid)
        v:添加任务(self)
    end

    local map = 玩家:取当前地图()
    if not map then
        return
    end
    local 后缀 = {'千年妖王' , '万年妖王'}
    local 外形表 = {2288 , 2289 , 2292 , 2291 , 2290}
    local 难度 = self.难度
    local X, Y = map:取随机坐标()
    self.坐标记录= {x = X , y = Y}
    self.NPC =
    map:添加NPC {
        队伍 = self.队伍,
        归属 = 玩家.nid,
        时长 = 1800,
        名称 = 玩家.名称..后缀[难度],
        外形 = 外形表[math.random(1, #外形表)],
        脚本 = 'scripts/task/日常/日常_地宫挑战.lua',
        时间 = self.时间,
        X = X,
        Y = Y,
        来源 = self
    }
    return true
end

local 对话 = [[幻魔大法刚有小成，你们就送上门来，哼哼，尝尝冒然闯入幻境的苦果吧!
menu
狂妄妖魔，速速受死！
我再整顿下队伍
]]

function 任务:NPC对话(玩家, i)
    local r = 玩家:取任务("日常_地宫挑战")
    if r then
        if r.NPC == self.来源.NPC then
            return 对话
        end
    end
    return "我认识你么？"
end

function 任务:NPC菜单(玩家, i)
    local rr = 玩家:取任务("日常_地宫挑战")
    if rr then
        if i == '狂妄妖魔，速速受死！' then
            local r = 玩家:进入战斗('scripts/task/日常/日常_地宫挑战.lua', rr)
            if r then
                self.来源:完成(玩家)
            end
        end
    end
end

function 任务:完成(玩家)
    local r = 玩家:取任务('日常_地宫挑战')
    if 玩家.是否组队 then
        if r then
            for _, v in 玩家:遍历队伍() do
                local rr = v:取任务('日常_地宫挑战')
                if rr then
                    self:掉落包(v)
                    rr:删除()
                end
            end
        end
    elseif r then
        self:掉落包(玩家)
        self:删除()
    end
    local map = 玩家:取地图(1291)
    if map then
        map:删除NPC(self.NPC)
    end
    玩家:切换地图(1003, 226, 10)
end

function 任务:掉落包(玩家)
    if 玩家:取活动限制次数('地宫挑战') >= 1 then
        return
    end
    local 经验 = 50000 * (玩家.等级 * 0.15)
    玩家:添加任务经验(经验, "地宫")
    local r = 玩家:取任务('日常_地宫挑战')
    玩家:添加功绩(100 + 50 * (r.副本等级 - 1) + ( r.难度 - 1 ) * 200)
    玩家:增加活动限制次数('地宫挑战')
end

function 任务:任务NPC对话(玩家, NPC)
end

function 任务:任务NPC菜单(玩家, NPC, i)
end

function 任务:任务进入战斗(玩家)
end



function 任务:战斗初始化(玩家,任务)
    local 等级 = 玩家:取队伍平均等级() + 10
    if 等级 < 100 then
        等级 = 100
    end

    if 任务 then
        local 副本等级 = 任务.副本等级
        local 难度 = 任务.难度
        local __怪物 = {
            [1] = {--副本等级
                [1] = {--难度
                    {名称 = "心", 外形 = 2315, 等级 = 等级 , 血初值 = 1000000, 法初值 = 1, 攻初值 = 1, 敏初值 = 900 , 技能 = { { 名称 = '万毒攻心' , 熟练度 = 25000} } , 施法几率 = 0 , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 10 , 抗火 = 10 , 抗震慑 = 10 , 抗毒伤害 = 9999999 , 物理吸收 = 10 , 躲闪率 = 20 , 加强毒伤害 = 30}},
                    {名称 = "美", 外形 = 2315, 等级 = 等级 , 血初值 = 4000, 法初值 = 1, 攻初值 = 1, 敏初值 = -200},
                    {名称 = "善", 外形 = 2315, 等级 = 等级 , 血初值 = 4000, 法初值 = 1, 攻初值 = 1, 敏初值 = 800},
                    {名称 = "丑", 外形 = 2022, 等级 = 等级 , 血初值 = 2500, 法初值 = 1, 攻初值 = 100, 敏初值 = 650 , 技能 = { {名称 = '魔音摄心' , 熟练度 = 11000}, {名称 = '阎罗追命' , 熟练度 = 11000} } , 施法几率 = 80 , 抗性 = {抗震慑 = 5 , 抗混乱 = 120 , 抗昏睡 = 200 , 抗封印 = 120 , 抗遗忘 = 80 , 物理吸收 = 10 , 连击率 = 80 , 连击 = 9}},
                    {名称 = "恶", 外形 = 2022, 等级 = 等级 , 血初值 = 4300, 法初值 = 1, 攻初值 = 100, 敏初值 = 500 , 技能 = { {名称 = '九阴纯火' , 熟练度 = 11000}, {名称 = '天诛地灭' , 熟练度 = 11000}, {名称 = '九龙冰封' , 熟练度 = 11000}, {名称 = '袖里乾坤' , 熟练度 = 11000} } , 施法几率 = 90 , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 10 , 抗火 = 10 , 抗震慑 = 45 , 抗混乱 = 90 , 抗昏睡 = 120 , 抗封印 = 120 , 抗遗忘 = 120 , 物理吸收 = 10}},
                    {名称 = "真", 外形 = 2315, 等级 = 等级 , 血初值 = 4000, 法初值 = 1, 攻初值 = 1, 敏初值 = 0},
                    {名称 = "嗔", 外形 = 2022, 等级 = 等级 , 血初值 = 3800, 法初值 = 1, 攻初值 = 100, 敏初值 = -150 , 技能 = { { 名称 = '血海深仇' , 熟练度 = 15000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 5 , 抗混乱 = 80 , 抗昏睡 = 200 , 抗封印 = 80 , 抗遗忘 = 80 , 物理吸收 = 10 , 鬼火狂暴几率 = 50}},
                    {名称 = "伪", 外形 = 2022, 等级 = 等级 , 血初值 = 3800, 法初值 = 1, 攻初值 = 100, 敏初值 = -50 , 技能 = { {名称 = '借刀杀人' , 熟练度 = 12000}, {名称 = '失心狂乱' , 熟练度 = 12000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 5 , 抗混乱 = 120 , 抗昏睡 = 200 , 抗封印 = 120 , 抗遗忘 = 120 , 物理吸收 = 10 , 忽视抗混 = 5 , 加强混乱 = 10}},
                },
                [2] = {--难度
                    {名称 = "心", 外形 = 2315, 等级 = 等级 , 血初值 = 1000000, 法初值 = 1, 攻初值 = 100, 敏初值 = 1000 , 技能 = { { 名称 = '万毒攻心' , 熟练度 = 25000} } , 施法几率 = 0 , 抗性 = {抗风 = 26 , 抗雷 = 26 , 抗水 = 26 , 抗火 = 26 , 抗震慑 = 20 , 抗毒伤害 = 9999999 , 物理吸收 = 60 , 躲闪率 = 50 , 加强毒伤害 = 50}},
                    {名称 = "美", 外形 = 2315, 等级 = 等级 , 血初值 = 6000, 法初值 = 1, 攻初值 = 100, 敏初值 = -200},
                    {名称 = "善", 外形 = 2315, 等级 = 等级 , 血初值 = 6000, 法初值 = 1, 攻初值 = 100, 敏初值 = 900},
                    {名称 = "丑", 外形 = 2022, 等级 = 等级 , 血初值 = 4300, 法初值 = 1, 攻初值 = 100, 敏初值 = 820 , 技能 = { {名称 = '魔音摄心' , 熟练度 = 18000}, {名称 = '阎罗追命' , 熟练度 = 18000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 10 , 抗混乱 = 130 , 抗昏睡 = 200 , 抗封印 = 130 , 抗遗忘 = 80 , 物理吸收 = 30 , 连击率 = 80 , 连击 = 9}},
                    {名称 = "恶", 外形 = 2022, 等级 = 等级 , 血初值 = 6300, 法初值 = 1, 攻初值 = 100, 敏初值 = 630 , 技能 = { {名称 = '九阴纯火' , 熟练度 = 18000}, {名称 = '天诛地灭' , 熟练度 = 18000}, {名称 = '九龙冰封' , 熟练度 = 18000}, {名称 = '袖里乾坤' , 熟练度 = 18000} } , 施法几率 = 100 , 抗性 = {抗风 = 20 , 抗雷 = 20 , 抗水 = 20 , 抗火 = 20 , 抗震慑 = 45 , 抗混乱 = 100 , 抗昏睡 = 130 , 抗封印 = 130 , 抗遗忘 = 130 , 物理吸收 = 10 , 躲闪率 = 60}},
                    {名称 = "真", 外形 = 2315, 等级 = 等级 , 血初值 = 6000, 法初值 = 1, 攻初值 = 100, 敏初值 = 0},
                    {名称 = "嗔", 外形 = 2022, 等级 = 等级 , 血初值 = 5800, 法初值 = 1, 攻初值 = 100, 敏初值 = -150 , 技能 = { { 名称 = '血海深仇' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 10 , 抗混乱 = 100 , 抗昏睡 = 90 , 抗封印 = 100 , 抗遗忘 = 80 , 物理吸收 = 30 , 鬼火狂暴几率 = 80}},
                    {名称 = "伪", 外形 = 2022, 等级 = 等级 , 血初值 = 5800, 法初值 = 1, 攻初值 = 100, 敏初值 = -50 , 技能 = { {名称 = '借刀杀人' , 熟练度 = 18000}, {名称 = '失心狂乱' , 熟练度 = 18000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 15 , 抗混乱 = 120 , 抗昏睡 = 200 , 抗封印 = 130 , 抗遗忘 = 130 , 物理吸收 = 30 , 忽视抗混 = 8 , 加强混乱 = 15}},
                }
            },
            [2] = {
                [1] = {
                    {名称 = "天罡星", 外形 = 2088, 等级 = 等级 , 血初值 = 12500, 法初值 = 1, 攻初值 = 200, 敏初值 = 1000 , 技能 = { {名称 = '烈火骄阳' , 熟练度 = 15000}, {名称 = '九阴纯火' , 熟练度 = 15000}, {名称 = '阎罗追命' , 熟练度 = 15000} } , 施法几率 = 100 , 抗性 = {抗风 = 60 , 抗雷 = 60 , 抗水 = 60 , 抗火 = 60 , 抗震慑 = 50 , 抗毒伤害 = 10000 , 抗混乱 = 130 , 抗昏睡 = 130 , 抗封印 = 130 , 抗遗忘 = 100 , 物理吸收 = 50}},
                    {名称 = "失", 外形 = 2004, 等级 = 等级 , 血初值 = 13800, 法初值 = 1, 攻初值 = 200, 敏初值 = 1000 , 技能 = { {名称 = '九龙冰封' , 熟练度 = 15000} } , 施法几率 = 100 , 抗性 = {抗风 = 20 , 抗雷 = 20 , 抗水 = 20 , 抗火 = 20 , 抗震慑 = 10 , 抗毒伤害 = 10000 , 抗混乱 = 100 , 抗昏睡 = 100 , 抗封印 = 100 , 抗遗忘 = 80 , 物理吸收 = 30}},
                    {名称 = "地煞星", 外形 = 3, 等级 = 等级 , 血初值 = 13200, 法初值 = 1, 攻初值 = 200, 敏初值 = 450 , 技能 = { {名称 = '借刀杀人' , 熟练度 = 15000}, {名称 = '九阴纯火' , 熟练度 = 15000}, {名称 = '吸星大法' , 熟练度 = 15000} } , 施法几率 = 80 , 抗性 = {抗震慑 = 20 , 抗鬼火 = 35 , 抗混乱 = 120 , 抗昏睡 = 200 , 抗封印 = 120 , 抗遗忘 = 110 , 物理吸收 = 80 , 躲闪率 = 50 , 忽视抗混 = 5 , 加强混乱 = 20}},
                    {名称 = "狂", 外形 = 2004, 等级 = 等级 , 血初值 = 14200, 法初值 = 1, 攻初值 = 200, 敏初值 = 600 , 技能 = { {名称 = '借刀杀人' , 熟练度 = 15000}, {名称 = '血海深仇' , 熟练度 = 15000} } , 施法几率 = 100 , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 10 , 抗火 = 10 , 抗震慑 = 30 , 抗混乱 = 120 , 抗昏睡 = 200 , 抗封印 = 80 , 抗遗忘 = 90 , 物理吸收 = 20} },
                    {名称 = "心", 外形 = 2004, 等级 = 等级 , 血初值 = 13700, 法初值 = 1, 攻初值 = 200, 敏初值 = 900 , 技能 = { {名称 = '借刀杀人' , 熟练度 = 15000}, {名称 = '失心狂乱' , 熟练度 = 15000} } , 施法几率 = 100 , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 10 , 抗火 = 10 , 抗震慑 = 25 , 抗毒伤害 = 10000 , 抗混乱 = 120 , 抗昏睡 = 80 , 抗封印 = 80 , 抗遗忘 = 100 , 物理吸收 = 30} },
                    {名称 = "乱", 外形 = 2004, 等级 = 等级 , 血初值 = 14200, 法初值 = 1, 攻初值 = 200, 敏初值 = 500 , 技能 = { {名称 = '袖里乾坤' , 熟练度 = 15000}, {名称 = '血海深仇' , 熟练度 = 15000}, {名称 = '九龙冰封' , 熟练度 = 15000} } , 施法几率 = 100 , 抗性 = {抗风 = 30 , 抗雷 = 30 , 抗水 = 30 , 抗火 = 30 , 抗震慑 = 15 , 抗混乱 = 110 , 抗昏睡 = 100 , 抗封印 = 100 , 抗遗忘 = 90} },
                    {名称 = "面", 外形 = 52, 等级 = 等级 , 血初值 = 13500, 法初值 = 1, 攻初值 = 200, 敏初值 = 200 , 技能 = { {名称 = '天诛地灭' , 熟练度 = 15000}, {名称 = '雷神怒击' , 熟练度 = 15000} } , 施法几率 = 80 , 抗性 = {抗混乱 = 120 , 抗昏睡 = 200 , 抗封印 = 120 , 抗遗忘 = 120 , 物理吸收 = 20 , 反击率 = 60 , 反击 = 6 , 连击率 = 50 , 连击 = 3} },
                    {名称 = "四", 外形 = 42, 等级 = 等级 , 血初值 = 15000, 法初值 = 1, 攻初值 = 200, 敏初值 = 10 , 技能 = { {名称 = '九龙冰封' , 熟练度 = 15000}, {名称 = '龙啸九天' , 熟练度 = 15000} } , 施法几率 = 80 , 抗性 = {抗混乱 = 120 , 抗昏睡 = 200 , 抗封印 = 120 , 抗遗忘 = 120 , 物理吸收 = 20 , 反击率 = 60 , 反击 = 6 , 连击率 = 50 , 连击 = 5 , 狂暴几率 = 50 , 致命几率 = 30} },
                    {名称 = "歌", 外形 = 1, 等级 = 等级 , 血初值 = 14300, 法初值 = 1, 攻初值 = 200, 敏初值 = 700 , 技能 = { {名称 = '楚楚可怜' , 熟练度 = 15000}, {名称 = '九阴纯火' , 熟练度 = 15000}, {名称 = '吸星大法' , 熟练度 = 15000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 10 , 抗三尸 = 4000 , 抗混乱 = 130 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 90 , 物理吸收 = 30 , 反震率 = 50 , 反震程度 = 50} },
                    {名称 = "楚", 外形 = 17, 等级 = 等级 , 血初值 = 13380, 法初值 = 1, 攻初值 = 200, 敏初值 = 100 , 技能 = { {名称 = '倩女幽魂' , 熟练度 = 15000}, {名称 = '秦丝冰雾' , 熟练度 = 15000}, {名称 = '九龙冰封' , 熟练度 = 15000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 20 , 抗毒伤害 = 10000 , 抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 110 , 物理吸收 = 20} },
                },
                [2] = {
                    {名称 = "天罡星", 外形 = 2088, 等级 = 等级 , 血初值 = 14700, 法初值 = 1, 攻初值 = 200, 敏初值 = 1100 , 技能 = { {名称 = '烈火骄阳' , 熟练度 = 20000}, {名称 = '九阴纯火' , 熟练度 = 20000}, {名称 = '阎罗追命' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗风 = 80 , 抗雷 = 80 , 抗水 = 80 , 抗火 = 80 , 抗震慑 = 60 , 抗毒伤害 = 15000 , 抗混乱 = 140 , 抗昏睡 = 200 , 抗封印 = 140 , 抗遗忘 = 110 , 物理吸收 = 60}},
                    {名称 = "失", 外形 = 2004, 等级 = 等级 , 血初值 = 11600, 法初值 = 1, 攻初值 = 200, 敏初值 = 900 , 技能 = { {名称 = '九龙冰封' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗风 = 30 , 抗雷 = 30 , 抗水 = 30 , 抗火 = 30 , 抗震慑 = 20 , 抗毒伤害 = 15000 , 抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 110 , 抗遗忘 = 90 , 物理吸收 = 40}},
                    {名称 = "地煞星", 外形 = 3, 等级 = 等级 , 血初值 = 11000, 法初值 = 1, 攻初值 = 200, 敏初值 = 350 , 技能 = { {名称 = '借刀杀人' , 熟练度 = 20000}, {名称 = '九阴纯火' , 熟练度 = 20000}, {名称 = '吸星大法' , 熟练度 = 20000} } , 施法几率 = 80 , 抗性 = {抗震慑 = 30 , 抗鬼火 = 45 , 抗混乱 = 130 , 抗昏睡 = 200 , 抗封印 = 130 , 抗遗忘 = 120 , 物理吸收 = 80 , 躲闪率 = 60 , 忽视抗混 = 8 , 加强混乱 = 30}},
                    {名称 = "狂", 外形 = 2004, 等级 = 等级 , 血初值 = 12000, 法初值 = 1, 攻初值 = 200, 敏初值 = 500 , 技能 = { {名称 = '借刀杀人' , 熟练度 = 20000}, {名称 = '血海深仇' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗风 = 15 , 抗雷 = 15 , 抗水 = 15 , 抗火 = 15 , 抗震慑 = 35 , 抗混乱 = 130 , 抗昏睡 = 200 , 抗封印 = 90 , 抗遗忘 = 100 , 物理吸收 = 30} },
                    {名称 = "心", 外形 = 2004, 等级 = 等级 , 血初值 = 11500, 法初值 = 1, 攻初值 = 200, 敏初值 = 800 , 技能 = { {名称 = '借刀杀人' , 熟练度 = 20000}, {名称 = '失心狂乱' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗风 = 10 , 抗雷 = 15 , 抗水 = 15 , 抗火 = 15 , 抗震慑 = 30 , 抗毒伤害 = 15000 , 抗混乱 = 130 , 抗昏睡 = 200 , 抗封印 = 90 , 抗遗忘 = 110 , 物理吸收 = 40} },
                    {名称 = "乱", 外形 = 2004, 等级 = 等级 , 血初值 = 12000, 法初值 = 1, 攻初值 = 200, 敏初值 = 400 , 技能 = { {名称 = '袖里乾坤' , 熟练度 = 20000}, {名称 = '血海深仇' , 熟练度 = 20000}, {名称 = '九龙冰封' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗风 = 40 , 抗雷 = 40 , 抗水 = 40 , 抗火 = 40 , 抗震慑 = 25 , 抗混乱 = 120 , 抗昏睡 = 200 , 抗封印 = 110 , 抗遗忘 = 100} },
                    {名称 = "面", 外形 = 52, 等级 = 等级 , 血初值 = 11300, 法初值 = 1, 攻初值 = 200, 敏初值 = 200 , 技能 = { {名称 = '天诛地灭' , 熟练度 = 20000}, {名称 = '雷神怒击' , 熟练度 = 20000} } , 施法几率 = 80 , 抗性 = {抗混乱 = 130 , 抗昏睡 = 200 , 抗封印 = 130 , 抗遗忘 = 130 , 物理吸收 = 30 , 反击率 = 60 , 反击 = 6 , 连击率 = 60 , 连击 = 5} },
                    {名称 = "四", 外形 = 42, 等级 = 等级 , 血初值 = 12800, 法初值 = 1, 攻初值 = 200, 敏初值 = 10 , 技能 = { {名称 = '九龙冰封' , 熟练度 = 20000}, {名称 = '龙啸九天' , 熟练度 = 20000} } , 施法几率 = 80 , 抗性 = {抗混乱 = 130 , 抗昏睡 = 200 , 抗封印 = 130 , 抗遗忘 = 130 , 物理吸收 = 30 , 反击率 = 60 , 反击 = 6 , 连击率 = 60 , 连击 = 5 , 狂暴几率 = 60 , 致命几率 = 40} },
                    {名称 = "歌", 外形 = 1, 等级 = 等级 , 血初值 = 12100, 法初值 = 1, 攻初值 = 200, 敏初值 = 600 , 技能 = { {名称 = '楚楚可怜' , 熟练度 = 20000}, {名称 = '九阴纯火' , 熟练度 = 20000}, {名称 = '吸星大法' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 15 , 抗三尸 = 4800 , 抗混乱 = 140 , 抗昏睡 = 200 , 抗封印 = 110 , 抗遗忘 = 100 , 物理吸收 = 40 , 反震率 = 60 , 反震程度 = 60} },
                    {名称 = "楚", 外形 = 17, 等级 = 等级 , 血初值 = 11180, 法初值 = 1, 攻初值 = 200, 敏初值 = 100 , 技能 = { {名称 = '倩女幽魂' , 熟练度 = 20000}, {名称 = '秦丝冰雾' , 熟练度 = 20000}, {名称 = '九龙冰封' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 25 , 抗毒伤害 = 15000 , 抗混乱 = 120 , 抗昏睡 = 200 , 抗封印 = 110 , 抗遗忘 = 120 , 物理吸收 = 30} },
                }
            },
            [3] = {
                [1] = {
                    {名称 = "遁甲", 外形 = 2177, 等级 = 等级 , 血初值 = 12300, 法初值 = 1, 攻初值 = 300, 敏初值 = 1100 , 技能 = { { 名称 = '天诛地灭' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 30 , 抗风 = 30 , 抗雷 = 30 , 抗水 = 30 , 抗火 = 30 , 抗混乱 = 140 , 抗昏睡 = 200 , 抗封印 = 110 , 抗遗忘 = 110 , 物理吸收 = 60 , 抗致命几率 = 20 , 反震率 = 60 , 反震程度 = 80 }},
                    {名称 = "乙木", 外形 = 2150, 等级 = 等级 , 血初值 = 16000, 法初值 = 1, 攻初值 = 300, 敏初值 = 500 , 技能 = { { 名称 = '万毒攻心' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 25 , 抗风 = 15 , 抗雷 = 15 , 抗水 = 15 , 抗火 = 15 , 抗混乱 = 120 , 抗昏睡 = 200 , 抗封印 = 110 , 抗遗忘 = 110 , 物理吸收 = 30 , 抗致命几率 = 20 }},
                    {名称 = "丙火", 外形 = 2150, 等级 = 等级 , 血初值 = 15400, 法初值 = 1, 攻初值 = 300, 敏初值 = 450 , 技能 = { { 名称 = '九阴纯火' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 10 , 抗风 = 15 , 抗雷 = 15 , 抗水 = 15 , 抗火 = 15 , 抗混乱 = 120 , 抗昏睡 = 200 , 抗封印 = 110 , 抗遗忘 = 110 , 物理吸收 = 30 , 抗致命几率 = 20 }},
                    {名称 = "甲辰", 外形 = 2149, 等级 = 等级 , 血初值 = 14000, 法初值 = 1, 攻初值 = 300, 敏初值 = 200 , 技能 = { { 名称 = '袖里乾坤' , 熟练度 = 20000} , { 名称 = '天诛地灭' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 10 , 抗风 = 60 , 抗雷 = 60 , 抗水 = 60 , 抗火 = 60 , 抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 110 , 物理吸收 = 20 , 抗致命几率 = 25 }},
                    {名称 = "甲子", 外形 = 2149, 等级 = 等级 , 血初值 = 14000, 法初值 = 1, 攻初值 = 300, 敏初值 = 300 , 技能 = { { 名称 = '失心狂乱' , 熟练度 = 20000} , { 名称 = '天诛地灭' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 10 , 抗风 = 60 , 抗雷 = 60 , 抗水 = 60 , 抗火 = 60 , 抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 110 , 物理吸收 = 20 , 抗致命几率 = 25 }},
                    {名称 = "丁火", 外形 = 2150, 等级 = 等级 , 血初值 = 15400, 法初值 = 1, 攻初值 = 300, 敏初值 = 400 , 技能 = { { 名称 = '血海深仇' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 10 , 抗风 = 15 , 抗雷 = 15 , 抗水 = 15 , 抗火 = 15 , 抗混乱 = 120 , 抗昏睡 = 200 , 抗封印 = 110 , 抗遗忘 = 110 , 物理吸收 = 30 , 抗致命几率 = 20 }},
                    {名称 = "甲申", 外形 = 2149, 等级 = 等级 , 血初值 = 14000, 法初值 = 1, 攻初值 = 300, 敏初值 = 100 , 技能 = { { 名称 = '九龙冰封' , 熟练度 = 20000} , { 名称 = '天诛地灭' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 10 , 抗风 = 60 , 抗雷 = 60 , 抗水 = 60 , 抗火 = 60 , 抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 110 , 物理吸收 = 20 , 抗致命几率 = 25 }},
                    {名称 = "甲午", 外形 = 2149, 等级 = 等级 , 血初值 = 14000, 法初值 = 1, 攻初值 = 300, 敏初值 = 250 , 技能 = { { 名称 = '天诛地灭' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 20 , 抗风 = 60 , 抗雷 = 60 , 抗水 = 60 , 抗火 = 60 , 抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 110 , 物理吸收 = 20 , 抗致命几率 = 25 }},
                    {名称 = "甲戌", 外形 = 2149, 等级 = 等级 , 血初值 = 14000, 法初值 = 1, 攻初值 = 300, 敏初值 = 350 , 技能 = { { 名称 = '阎罗追命' , 熟练度 = 20000} , { 名称 = '天诛地灭' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 20 , 抗风 = 60 , 抗雷 = 60 , 抗水 = 60 , 抗火 = 60 , 抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 110 , 物理吸收 = 20 , 抗致命几率 = 25 }},
                    {名称 = "甲寅", 外形 = 2149, 等级 = 等级 , 血初值 = 14800, 法初值 = 1, 攻初值 = 300, 敏初值 = 150 , 技能 = { { 名称 = '失心狂乱' , 熟练度 = 20000} , { 名称 = '天诛地灭' , 熟练度 = 20000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 20 , 抗风 = 60 , 抗雷 = 60 , 抗水 = 60 , 抗火 = 60 , 抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 110 , 物理吸收 = 20 , 抗致命几率 = 25 }},
                },
                [2] = {
                    {名称 = "遁甲", 外形 = 2177, 等级 = 等级 , 血初值 = 14500, 法初值 = 1, 攻初值 = 300, 敏初值 = 1200 , 技能 = { { 名称 = '天诛地灭' , 熟练度 = 25000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 35 , 抗风 = 40 , 抗雷 = 40 , 抗水 = 40 , 抗火 = 40 , 抗混乱 = 150 , 抗昏睡 = 200 , 抗封印 = 120 , 抗遗忘 = 110 , 物理吸收 = 60 , 抗致命几率 = 30 , 反震率 = 80 , 反震程度 = 100 }},
                    {名称 = "乙木", 外形 = 2150, 等级 = 等级 , 血初值 = 18200, 法初值 = 1, 攻初值 = 300, 敏初值 = 700 , 技能 = { { 名称 = '万毒攻心' , 熟练度 = 25000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 30 , 抗风 = 15 , 抗雷 = 15 , 抗水 = 15 , 抗火 = 15 , 抗混乱 = 125 , 抗昏睡 = 200 , 抗封印 = 115 , 抗遗忘 = 115 , 物理吸收 = 35 , 抗致命几率 = 25 , 躲闪率 = 30 }},
                    {名称 = "丙火", 外形 = 2150, 等级 = 等级 , 血初值 = 117600, 法初值 = 1, 攻初值 = 300, 敏初值 = 650 , 技能 = { { 名称 = '九阴纯火' , 熟练度 = 25000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 15 , 抗风 = 20 , 抗雷 = 20 , 抗水 = 20 , 抗火 = 20 , 抗混乱 = 125 , 抗昏睡 = 200 , 抗封印 = 115 , 抗遗忘 = 115 , 物理吸收 = 35 , 抗致命几率 = 25 , 躲闪率 = 30 }},
                    {名称 = "甲辰", 外形 = 2149, 等级 = 等级 , 血初值 = 16200, 法初值 = 1, 攻初值 = 300, 敏初值 = 400 , 技能 = { { 名称 = '袖里乾坤' , 熟练度 = 25000} , { 名称 = '天诛地灭' , 熟练度 = 25000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 15 , 抗风 = 60 , 抗雷 = 60 , 抗水 = 60 , 抗火 = 60 , 抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 110 , 物理吸收 = 20 , 抗致命几率 = 25 , 躲闪率 = 30 }},
                    {名称 = "甲子", 外形 = 2149, 等级 = 等级 , 血初值 = 16200, 法初值 = 1, 攻初值 = 300, 敏初值 = 500 , 技能 = { { 名称 = '失心狂乱' , 熟练度 = 25000} , { 名称 = '天诛地灭' , 熟练度 = 25000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 15 , 抗风 = 60 , 抗雷 = 60 , 抗水 = 60 , 抗火 = 60 , 抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 110 , 物理吸收 = 20 , 抗致命几率 = 25 , 躲闪率 = 30 }},
                    {名称 = "丁火", 外形 = 2150, 等级 = 等级 , 血初值 = 17600, 法初值 = 1, 攻初值 = 300, 敏初值 = 600 , 技能 = { { 名称 = '血海深仇' , 熟练度 = 25000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 15 , 抗风 = 20 , 抗雷 = 20 , 抗水 = 20 , 抗火 = 20 , 抗混乱 = 125 , 抗昏睡 = 200 , 抗封印 = 115 , 抗遗忘 = 115 , 物理吸收 = 35 , 抗致命几率 = 25 , 躲闪率 = 30 }},
                    {名称 = "甲申", 外形 = 2149, 等级 = 等级 , 血初值 = 16200, 法初值 = 1, 攻初值 = 300, 敏初值 = 300 , 技能 = { { 名称 = '九龙冰封' , 熟练度 = 25000} , { 名称 = '天诛地灭' , 熟练度 = 25000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 15 , 抗风 = 60 , 抗雷 = 60 , 抗水 = 60 , 抗火 = 60 , 抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 110 , 物理吸收 = 20 , 抗致命几率 = 25 , 躲闪率 = 30 }},
                    {名称 = "甲午", 外形 = 2149, 等级 = 等级 , 血初值 = 16200, 法初值 = 1, 攻初值 = 300, 敏初值 = 450 , 技能 = { { 名称 = '天诛地灭' , 熟练度 = 25000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 25 , 抗风 = 60 , 抗雷 = 60 , 抗水 = 60 , 抗火 = 60 , 抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 110 , 物理吸收 = 20 , 抗致命几率 = 25 , 躲闪率 = 30 }},
                    {名称 = "甲戌", 外形 = 2149, 等级 = 等级 , 血初值 = 16200, 法初值 = 1, 攻初值 = 300, 敏初值 = 550 , 技能 = { { 名称 = '阎罗追命' , 熟练度 = 25000} , { 名称 = '天诛地灭' , 熟练度 = 25000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 25 , 抗风 = 60 , 抗雷 = 60 , 抗水 = 60 , 抗火 = 60 , 抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 110 , 物理吸收 = 20 , 抗致命几率 = 25 , 躲闪率 = 30 }},
                    {名称 = "甲寅", 外形 = 2149, 等级 = 等级 , 血初值 = 17000, 法初值 = 1, 攻初值 = 300, 敏初值 = 350 , 技能 = { { 名称 = '失心狂乱' , 熟练度 = 25000} , { 名称 = '天诛地灭' , 熟练度 = 25000} } , 施法几率 = 100 , 抗性 = {抗震慑 = 25 , 抗风 = 60 , 抗雷 = 60 , 抗水 = 60 , 抗火 = 60 , 抗混乱 = 110 , 抗昏睡 = 200 , 抗封印 = 100 , 抗遗忘 = 110 , 物理吸收 = 20 , 抗致命几率 = 25 , 躲闪率 = 30 }},
                },
            },
            [4] = {},
        }
        for i = 1, #__怪物[副本等级][难度] do
            local r = 生成战斗怪物(生成怪物属性(__怪物[副本等级][难度][i]))
            self:加入敌方(i, r)
        end
    end
end
function 任务:战斗回合开始(dt)
end

function 任务:战斗结束(dt)
    if dt then
        local zg = self:取对象(11)
        if zg then
            for k, v in self:遍历我方() do
                if v.是否玩家 then
                    local z = v.对象.接口:取乘骑坐骑()
                    if z then
                        z:添加经验(5)
                        z:添加熟练(5)
                    end
                end
            end
        end
    end
end

return 任务
