-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-27 08:40:08
-- @Last Modified time  : 2024-09-09 09:54:02

local 任务 = {
    名称 = '新手剧情',
    类型 = '新手剧情',
    别名 = '加入御武盟',
    是否可取消 = false,
    是否可追踪 = true
}
local _外形 = { 2078, 2048, 2047, 2043, 2044, 2045, 2061 }


local _新手装备 = {
    [1] = {
        { name = "血河神剑", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强混乱 = 5, 加强昏睡 = 5,
            基础攻击 = 1680 } },
        { name = "黑魔冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "百裂穿云甲", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 }, 属性 = { 附加攻击 = 500,
            附水攻击 = 30, 抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [2] = {
        { name = "天崩地裂", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强混乱 = 5, 加强封印 = 5,
            基础攻击 = 1680 } },
        { name = "黑魔冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "百裂穿云甲", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 }, 属性 = { 附加攻击 = 500,
            附水攻击 = 30, 抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [3] = {
        { name = "九宫定神斧", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强混乱 = 5, 加强昏睡 = 5,
            基础攻击 = 1680 } },
        { name = "黑魔冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "百裂穿云甲", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 }, 属性 = { 附加攻击 = 500,
            附水攻击 = 30, 抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [4] = {
        { name = "霹雳枪", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强封印 = 5, 加强毒伤害 = 5,
            基础攻击 = 1680 } },
        { name = "魔女发冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "七宝天衣", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 附加攻击 = 500, 附水攻击 = 30,
                抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [5] = {
        { name = "日月同辉", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强封印 = 5, 加强毒伤害 = 5,
            基础攻击 = 1680 } },
        { name = "魔女发冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "七宝天衣", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 附加攻击 = 500, 附水攻击 = 30,
                抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [6] = {
        { name = "混元金斗", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强封印 = 5, 加强毒伤害 = 5,
            基础攻击 = 1680 } },
        { name = "魔女发冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "七宝天衣", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 附加攻击 = 500, 附水攻击 = 30,
                抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },

    [7] = {
        { name = "天罡战刀", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强震慑 = 3, 加强加攻法术 = 5,
            基础攻击 = 2100 } },
        { name = "黑魔冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "百裂穿云甲", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 }, 属性 = { 附加攻击 = 500,
            附水攻击 = 30, 抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [8] = {
        { name = "天罡战刀", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强震慑 = 3, 加强加攻法术 = 5,
            基础攻击 = 2100 } },
        { name = "黑魔冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "百裂穿云甲", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 }, 属性 = { 附加攻击 = 500,
            附水攻击 = 30, 抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [9] = {
        { name = "霹雳枪", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强震慑 = 3, 加强加攻法术 = 5,
            基础攻击 = 2100 } },
        { name = "黑魔冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "百裂穿云甲", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 }, 属性 = { 附加攻击 = 500,
            附水攻击 = 30, 抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [10] = {
        { name = "撕天裂地", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强震慑 = 3, 加强加防法术 = 5,
            基础攻击 = 2100 } },
        { name = "魔女发冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "七宝天衣", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 附加攻击 = 500, 附水攻击 = 30,
                抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [11] = {
        { name = "混元金斗", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强震慑 = 3, 加强加防法术 = 5,
            基础攻击 = 2100 } },
        { name = "魔女发冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "七宝天衣", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 附加攻击 = 500, 附水攻击 = 30,
                抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [12] = {
        { name = "天罡战刀", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强震慑 = 3, 加强加防法术 = 5,
            基础攻击 = 2100 } },
        { name = "魔女发冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "七宝天衣", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 附加攻击 = 500, 附水攻击 = 30,
                抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [13] = {
        { name = "霹雳枪", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强风 = 8, 加强雷 = 15,
            加强水 = 15, 基础攻击 = 1250 } },
        { name = "黑魔冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "百裂穿云甲", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 }, 属性 = { 附加攻击 = 500,
            附水攻击 = 30, 抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [14] = {
        { name = "混元金斗", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强风 = 8, 加强雷 = 15,
            加强水 = 15, 基础攻击 = 1250 } },
        { name = "黑魔冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "百裂穿云甲", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 }, 属性 = { 附加攻击 = 500,
            附水攻击 = 30, 抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [15] = {
        { name = "拨云扫月", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强风 = 8, 加强雷 = 15,
            加强水 = 15, 基础攻击 = 1250 } },
        { name = "黑魔冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "百裂穿云甲", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 }, 属性 = { 附加攻击 = 500,
            附水攻击 = 30, 抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [16] = {
        { name = "捆仙缚魔绫", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强火 = 15, 加强雷 = 15,
            加强水 = 15, 基础攻击 = 1250 } },
        { name = "魔女发冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "七宝天衣", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 附加攻击 = 500, 附水攻击 = 30,
                抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [17] = {
        { name = "天罡战刀", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强火 = 15, 加强雷 = 15,
            加强水 = 15, 基础攻击 = 1250 } },
        { name = "魔女发冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "七宝天衣", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 附加攻击 = 500, 附水攻击 = 30,
                抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [18] = {
        { name = "霹雳枪", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强火 = 15, 加强雷 = 15,
            加强水 = 15, 基础攻击 = 1250 } },
        { name = "魔女发冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "七宝天衣", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 附加攻击 = 500, 附水攻击 = 30,
                抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [60] = {
        { name = "霹雳枪", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强鬼火 = 8, 加强三尸虫回血程度 = 10,
            基础攻击 = 1550 } },
        { name = "黑魔冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "百裂穿云甲", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 }, 属性 = { 附加攻击 = 500,
            附水攻击 = 30, 抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [62] = {
        { name = "天罡战刀", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强鬼火 = 8, 加强三尸虫回血程度 = 10, 基础攻击 = 1550 } },
        { name = "黑魔冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "百裂穿云甲", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 }, 属性 = { 附加攻击 = 500,
            附水攻击 = 30, 抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [61] = {
        { name = "连山之卷", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强鬼火 = 8,
            加强三尸虫回血程度 = 10,
            基础攻击 = 1550 } },
        { name = "黑魔冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "百裂穿云甲", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 }, 属性 = { 附加攻击 = 500,
            附水攻击 = 30, 抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [63] = {
        { name = "撕天裂地", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强鬼火 = 8, 加强遗忘 = 5,
            基础攻击 = 1550 } },
        { name = "魔女发冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "七宝天衣", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 附加攻击 = 500, 附水攻击 = 30,
                抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [64] = {
        { name = "捆仙缚魔绫", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强鬼火 = 8, 加强遗忘 = 5,
            基础攻击 = 1550 } },
        { name = "魔女发冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "七宝天衣", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 附加攻击 = 500, 附水攻击 = 30,
                抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
    [65] = {
        { name = "混元索", 部位 = 5, 等级需求 = 30, 属性 = { 命中率 = 30, 加强鬼火 = 8, 加强遗忘 = 5,
            基础攻击 = 1550 } },
        { name = "魔女发冠", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 75 } },
        { name = "七宝天衣", 部位 = 2, 等级需求 = 30, 属性要求 = { "力量", 10 },
            属性 = { 附加攻击 = 500, 附水攻击 = 30,
                抗混乱 = 45, 防御 = 1180, 速度 = -10 } },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        { name = "万里卷云", 部位 = 4, 等级需求 = 30, 属性 = { 抗混乱 = 37, 附加气血 = 2800,
            附加魔法 = 2800 } },
    },
}














function 任务:任务初始化()
    self.进度 = 1
end

function 任务:任务上线(玩家)
    if not self.初始对话 then
        self.初始对话 = 1
        玩家:打开对话("你好#35\nmenu\n"
            , 2315, 10086)
        玩家:添加任务经验(400, "新手剧情")
    end

end

local _说明 = {
    '#Y任务目的:#r#W前往#Y东海渔村(21,48)#W找#u#G#m({东海渔村,21,48})御武盟盟主#m#u#W聊聊吧！',
    --加入御武盟 1
    '#Y任务目的:#r#W前往#Y东海渔村(21,147)#W找#u#G#m({东海渔村,21,147})宠物领养员#m#u#W聊聊吧！',
    --领养时间宠 2
    '#Y任务目的:#r#W前往#Y东海渔村(120,98)#W找#u#G#m({东海渔村,120,98})法术指导员#m#u#W聊聊吧！',
    --学习师门技能 3
    '#Y任务目的:#r#W前往#Y东海渔村(106,71)#W找#u#G#m({东海渔村,106,71})江湖郎中#m#u#W聊聊吧！',
    --拜访江湖郎中 4
    '#Y任务目的:#r#W前往#Y东海渔村(22,78)#W找#u#G#m({草药店,22,78})药店老板#m#u#W聊聊吧！',
    --拜访药店老板 5
    '#Y任务目的:#r#W前往#Y东海渔村(113,42)#W找#u#G#m({东海渔村,113,42})渔村村长#m#u#W聊聊吧！',
    --拜访渔村村长 6
    '#Y任务目的:#r#W前往#Y东海渔村(180,16)#W找#u#G#m({东海渔村,180,16})渔夫#m#u#W了解如何去往长安！#r#Y任务提醒:#r#W先将等级提升至#R10#W级，帮助#Y渔村村长#W完成任务或者前往#Y珊瑚海岛#W杀敌，可快速提升等级！',
    --前往长安 7
    '#Y任务目的:#r#W快去旁边#Y长安城(304,70)云来酒店#W找#u#G#m({云来酒店,304,70})酒店老板#m#u#W谈谈！',
    --拜访酒店老板 8
    '#Y任务目的:#r#W去#Y长安城(160,68)回春堂#W找#u#G#m({回春堂,160,68})药店老板#m#u#W交谈，就在全面不远！',
    --拜访药店老板 9
    '#Y任务目的:#r#W去#Y长安城(124,94)打铁铺#W找#u#G#m({冯记铁铺,124,94})冯铁匠#m#u#W交谈！',
    --拜访冯铁匠 10
    '#Y任务目的:#r#W去#Y长安城(132,129)服装店#W找#u#G#m({长安布庄,132,129})服装店老板#m#u#W看看吧！',
    --拜访服装店老板 11
    '#Y任务目的:#r#W去#Y长安城(86,150)杂货店#W找#u#G#m({长安杂货店,86,150})杂货店老板#m#u#W看看吧！',
    --拜访杂货店老板 12
    '#Y任务目的:#r#W去#Y长安城(422,232)#W找#u#G#m({长安,422,232})一品侍卫#m#u#W聊聊吧！',
    --领取双倍 13
    '#Y任务目的:#r#W从#Y长安城(109,212)#W前往#u#G#m({大雁塔一层,109,212})大雁塔一层#m#u#W杀敌#R%s#W/#G5#W场！',
    --大雁塔杀敌 14
    '#Y任务目的:#r#W前往#Y大雁塔一层(114,69)#W击杀#u#G#m({大雁塔一层,114,69})索命鬼#m#u#R(挑战难度建议组队)！',
    --击杀索命鬼 15
    '#Y任务目的:#r#W前往#Y地府(30,58)#W找#u#G#m({地府,30,58})钟馗#m#u#W谈一谈',
    --拜访钟馗 16

    '#Y任务目的:#r#W接受钟馗的考验[钟馗抓鬼%s/7次]#r#R(该任务有一定难度，请组队带上小伙伴共同完成。)',
    --拜访钟馗 17
}

local _追踪描述 = {
    '  前往#Y东海渔村(21,48)#W找#u#G#m({东海渔村,21,48})御武盟盟主#m#u#W聊聊吧！',
    --加入御武盟 1
    '  前往#Y东海渔村(21,147)#W找#u#G#m({东海渔村,21,147})宠物领养员#m#u#W聊聊吧！',
    --领养时间宠 2
    '  前往#Y东海渔村(120,98)#W找#u#G#m({东海渔村,120,98})法术指导员#m#u#W聊聊吧！',
    --学习师门技能 3
    '  前往#Y东海渔村(106,71)#W找#u#G#m({东海渔村,106,71})江湖郎中#m#u#W聊聊吧！',
    --拜访江湖郎中 4
    '  前往#Y东海渔村(22,78)#W找#u#G#m({草药店,22,78})药店老板#m#u#W聊聊吧！',
    --拜访药店老板 5
    '  前往#Y东海渔村(113,42)#W找#u#G#m({东海渔村,113,42})渔村村长#m#u#W聊聊吧！',
    --拜访渔村村长 6
    '  前往#Y东海渔村(180,16)#W找#u#G#m({东海渔村,180,16})渔夫#m#u#W了解如何去往长安！#r#Y任务提醒:#r#W先将等级提升至#R10#W级，帮助#Y渔村村长#W完成任务或者前往#Y珊瑚海岛#W杀敌，可快速提升等级！',
    --前往长安 7
    '  快去旁边#Y长安城(304,70)云来酒店#W找#u#G#m({云来酒店,304,70})酒店老板#m#u#W谈谈！',
    --拜访酒店老板 8
    '  去#Y长安城(160,68)回春堂#W找#u#G#m({回春堂,160,68})药店老板#m#u#W交谈，就在前面不远！',
    --拜访药店老板 9
    '  去#Y长安城(124,94)打铁铺#W找#u#G#m({冯记铁铺,124,94})冯铁匠#m#u#W交谈！',
    --拜访冯铁匠 10
    '  去#Y长安城(132,129)服装店#W找#u#G#m({长安布庄,132,129})服装店老板#m#u#W看看吧！',
    --拜访服装店老板 11
    '  去#Y长安城(86,150)杂货店#W找#u#G#m({长安杂货店,86,150})杂货店老板#m#u#W看看吧！',
    --拜访杂货店老板 12
    '  去#Y长安城(422,232)#W找#u#G#m({长安,422,232})一品侍卫#m#u#W聊聊吧！',
    --领取双倍 13
    '  从#Y长安城(109,212)#W前往#u#G#m({大雁塔一层,109,212})大雁塔一层#m#u#W杀敌#R%s#W/#G5#W场！',
    --大雁塔杀敌 14
    '  前往#Y大雁塔一层(114,69)#W击杀#u#G#m({大雁塔一层,114,69})索命鬼#m#u#R(挑战难度建议组队)！',
    --击杀索命鬼 15
    '  前往#Y地府(30,58)#W找#u#G#m({地府,30,58})钟馗#m#u#W谈一谈',
    --拜访钟馗 16

    '  接受钟馗的考验[钟馗抓鬼%s/7次]#r#R(该任务有一定难度，请组队带上小伙伴共同完成。)',
    --拜访钟馗 17
}

function 任务:任务取追踪(玩家)
    if self.进度 == 17 then
        return _追踪描述[self.进度]:format(self.抓鬼)
    elseif self.进度 == 14 then
        return _追踪描述[self.进度]:format(self.大雁杀敌)
    end
    return _追踪描述[self.进度]
end

function 任务:任务取详情(玩家)
    if self.进度 == 17 then
        return _说明[self.进度]:format(self.抓鬼)
    elseif self.进度 == 14 then
        return _说明[self.进度]:format(self.大雁杀敌)
    end
    return _说明[self.进度]
end

local _一法 = {
    [1001] = { '催眠咒', '瞌睡咒', '离魂咒', '迷魂醉', '百日眠', '反间之计', '情真意切', '谗言相加', '借刀杀人', '失心狂乱', '作茧自缚', '金蛇缠丝', '天罗地网', '作壁上观', '四面楚歌' }, --男人
    [1002] = { '催眠咒', '瞌睡咒', '离魂咒', '迷魂醉', '百日眠', '作茧自缚', '金蛇缠丝', '天罗地网', '作壁上观', '四面楚歌', '蛇蝎美人', '追魂迷香', '断肠烈散', '鹤顶红粉', '万毒攻心' }, --女人--女人
    [2001] = { '妖之魔力', '力神复苏', '狮王之怒', '兽王神力', '魔神附身', '夺命勾魂', '追神摄魄', '魔音摄心', '销魂蚀骨', '阎罗追命', '魔之飞步', '急速之魔', '魔神飞舞', '天外飞魔', '乾坤借速' }, --男魔
    [2002] = { '妖之魔力', '力神复苏', '狮王之怒', '兽王神力', '魔神附身', '夺命勾魂', '追神摄魄', '魔音摄心', '销魂蚀骨', '阎罗追命', '红袖添香', '莲步轻舞', '楚楚可怜', '魔神护体', '含情脉脉' }, --女魔
    [3001] = { '雷霆霹雳', '日照光华', '雷神怒击', '电闪雷鸣', '天诛地灭', '龙卷雨击', '龙腾水溅', '龙啸九天', '蛟龙出海', '九龙冰封', '飞砂走石', '乘风破浪', '太乙生风', '风雷涌动', '袖里乾坤' }, --男仙
    [3002] = { '雷霆霹雳', '日照光华', '雷神怒击', '电闪雷鸣', '天诛地灭', '龙卷雨击', '龙腾水溅', '龙啸九天', '蛟龙出海', '九龙冰封', '地狱烈火', '天雷怒火', '三味真火', '烈火骄阳', '九阴纯火' }, --女仙
    [4001] = { '幽冥鬼火', '火影迷踪', '冥烟销骨', '落日熔金', '血海深仇', '麻沸散', '鬼失惊', '乱魂钉', '失心疯', '孟婆汤', '吸血水蛭', '六翅毒蝉', '啮骨抽髓', '血煞之蛊', '吸星大法' }, --男鬼
    [4002] = { '幽冥鬼火', '火影迷踪', '冥烟销骨', '落日熔金', '血海深仇', '麻沸散', '鬼失惊', '乱魂钉', '失心疯', '孟婆汤', '幽怜魅影', '醉生梦死', '一曲销魂', '秦丝冰雾', '倩女幽魂' } --女鬼
}

function 任务:计算选项(玩家)
    local xx = ''
    for k, v in pairs(_一法[玩家.种族 * 1000 + 玩家.性别]) do
        if not 玩家:取技能是否存在(v) then
            xx = xx .. v .. '\n'
        end
    end
    return xx
end

local _台词 = {
    '少侠，你身上没有足够的包裹放奖励的物品哦！请最少保留一个包裹栏空位！',
    --1
    '恭喜您加入游侠盟#43以后您可以在游侠盟频道中向高手请教问题了#90',
    --2
    '1.宠物随主人的#Y在线时间#W增长而升级；#r2.召唤兽通过在战斗中选择#G捕捉#W指令获得，捕捉需要满足一定的称谓和等级，捕捉后在战斗中通过#G召唤#W指令将之释放出来；#r3.某些召唤兽能使用魔法，成长到一定等级后将自动掌握；#r4.从0级开始培养的高级召唤兽其威力可是很惊人的；#r5.长安城等地中有#G超级巫医#W可以给召唤兽恢复状态哦！',
    --3
    '好的，看我的妙手回春！你已经完全好了。',
    --4
    ' 药品可以在在东海渔村草药店，长安药店，长寿药店，洛阳药店，洛阳集市药店，傲来药店有售，更高级的药品只有通过一些日常任务获得，200环任务可以获得百分比药品。',
    --5
    '少侠，外面很危险！还是先找#Y渔村村长#W磨练磨练，将等级提升至10级后再来吧！',
    --6
    '相见即为有缘，我稍微懂点微末之技，你想学习什么呢？',
    --7
    '钟馗老大命我日夜在此监视塔内情况，但近期塔内情况越来越复杂，我刚看你在塔内奋力杀敌，可否接受我的考验？考验成功后便可前往地府接受钟馗的考验了！\nmenu\n1|我接受你的考验\n2|鬼才信你的话'
    --8
}
function 任务:任务NPC对话(玩家, NPC)
    if NPC.名称 == '御武盟盟主' and NPC.台词 then
        if self.进度 == 1 then
            NPC.台词 = NPC.台词 .. '\n1|好呢！我正想向高手请教呢！\n2|算了，自己动手丰衣足食。'
        end
    elseif NPC.名称 == '宠物领养员' then
        if self.进度 == 2 then
            NPC.台词 = NPC.台词
        end
    elseif NPC.名称 == '法术指导员' then
        if self.进度 == 3 then
            NPC.台词 = NPC.台词 .. '\n1|学习技能\n2|我是来旅游的。'
        end
    elseif NPC.名称 == '江湖郎中' then
        if self.进度 == 4 then
            NPC.台词 = NPC.台词 .. '\n1|是啊，我伤的厉害，快救治我吧。\n2|算了，活泼着呢！没有什么大碍。'
        end
    elseif NPC.名称 == '药店老板' then
        if 玩家.地图 == 1210 then
            if self.进度 == 5 then
                NPC.台词 = NPC.台词
            end
        elseif 玩家.地图 == 1016 then
            if self.进度 == 9 then
                NPC.台词 = NPC.台词
            end
        end
    elseif NPC.名称 == '渔村村长' then
        if self.进度 == 6 then
            self:完成进度(玩家, 7)
            NPC.台词 = NPC.台词
        end
    elseif NPC.名称 == '酒店老板' and 玩家.地图 == 1030 then
        if self.进度 == 8 then
            NPC.台词 = NPC.台词
        end
    elseif NPC.名称 == '冯铁匠' then
        if self.进度 == 10 then
            NPC.台词 = NPC.台词
        end
    elseif NPC.名称 == '服装店老板' then
        if self.进度 == 11 then
            NPC.台词 = NPC.台词
        end
    elseif NPC.名称 == '一品侍卫' then
        if self.进度 == 13 then
            self:完成进度(玩家, 14)
            NPC.台词 = NPC.台词
        end
    elseif NPC.名称 == '索命鬼' then
        if 玩家.地图 == 1004 and self.进度 == 15 then
            NPC.台词 = _台词[8]
        end
    elseif NPC.名称 == '钟馗' then
        if 玩家.地图 == 1122 and self.进度 == 16 then
            self:完成进度(玩家, 17)
            self.抓鬼 = 0
        end
    end
end

function 任务:完成抓鬼(玩家)
    if self.进度 ~= 17 then
        return
    end
    if not self.抓鬼 then
        self.抓鬼 = 0
    end
    self.抓鬼 = self.抓鬼 + 1
    if self.抓鬼 >= 7 then
        self:完成进度(玩家, 18)
    end
end

function 任务:大雁塔杀敌(玩家)
    if self.进度 ~= 14 then
        return
    end
    if not self.大雁杀敌 then
        self.大雁杀敌 = 0
    end
    self.大雁杀敌 = self.大雁杀敌 + 1
    if self.大雁杀敌 >= 5 then
        self:完成进度(玩家, 15)
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
    if NPC.名称 == '御武盟盟主' then
        if i == '1' then
            if self.进度 == 1 then
                self:完成进度(玩家, 2)
            end
            NPC.台词 = _台词[2]
        end
    elseif NPC.名称 == '宠物领养员' then
        if i == '4' then
            NPC.台词 = nil
            local p = 玩家:打开宠物领养窗口()
            local r = 玩家:领养时间宠(p)
            if r == 1 then
                玩家:打开对话(_台词[3], NPC.外形)
                玩家:提示窗口('#Y领养成功！')
                if self.进度 == 2 then
                    self:完成进度(玩家, 3)
                end
            elseif r == 2 then
                if self.进度 == 2 then
                    self:完成进度(玩家, 3)
                end
                玩家:提示窗口('#Y替换成功！')
            end
        end
    elseif NPC.名称 == '法术指导员' then
        if i == '1' then
            for n=1,15 do
                self:被动学习技能(玩家, n)
            end

            for _, d in 玩家:遍历队伍() do
                local rr = d:取任务('新手剧情')
                if rr and rr.进度 == 3 then
                    for n=1,15 do
                        rr:被动学习技能(d, n)
                    end
                end
            end
            self:完成进度(玩家, 4)
            NPC.结束 = false
        end
    elseif NPC.名称 == '江湖郎中' then
        if i == '1' then
            if self.进度 == 4 then
                self:完成进度(玩家, 5)
                NPC.台词 = _台词[4]
            end
        end
    elseif NPC.名称 == '药店老板' then
        if 玩家.地图 == 1210 then
            if i == '3' then
                if self.进度 == 5 then
                    self:完成进度(玩家, 6)
                    NPC.台词 = _台词[5]
                end
            end
        elseif 玩家.地图 == 1016 then
            if i == '3' then
                if self.进度 == 9 then
                    self:完成进度(玩家, 10)
                end
            end
        end
        -- 只有玩家等级小于10时才设置NPC.台词为_台词[6]
    elseif NPC.名称 == '渔夫' then
    NPC.台词 = nil
    if self.进度 == 7 and 玩家.等级 >= 10 then
        if i == '3' then
            self:完成进度(玩家, 8)
            玩家:切换地图(1001, 342, 18)
        end
    else

        if 玩家.等级 <= 10 then
            NPC.台词 = _台词[6]
        end
    end
    -- 只有玩家等级小于10时才设置NPC.台词为_台词[6]
    elseif NPC.名称 == '酒店老板' and 玩家.地图 == 1030 then
        if self.进度 == 8 then
            if i == '4' then
                self:完成进度(玩家, 9)

            end
        end
    elseif NPC.名称 == '冯铁匠' then
        if i == '3' then
            if self.进度 == 10 then
                self:完成进度(玩家, 11)
            end
        end
    elseif NPC.名称 == '服装店老板' then --001022
        if i == '3' then
            if self.进度 == 11 then
                self:完成进度(玩家, 12)
            end
        end
    elseif NPC.名称 == '杂货店老板' then --001015
        if i == '2' then
            if self.进度 == 12 then
                self:完成进度(玩家, 13)
            end
        end

    elseif NPC.名称 == '索命鬼' then
        if 玩家.地图 == 1004 and self.进度 == 15 then
            if i == "1" then
                玩家:进入战斗('scripts/task/新手剧情.lua', NPC)
            end
        end
    end
end

local _经验奖励 = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15 }
local _银子奖励 = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15 }
local _别名 = { "加入御武盟", '领养时间宠', '学习师门技能', '拜访江湖郎中', '拜访药店老板',
    '拜访村长', '前往长安', '拜访酒店老板', '拜访药店老板', '拜访冯铁匠', '拜访服装店老板',
    '拜访杂货店老板', '领取双倍', '大雁塔杀敌', "击杀索命鬼", "拜访钟馗", "钟馗的考验" }

function 任务:被动学习技能(玩家, n)
    local t = _一法[玩家.种族 * 1000 + 玩家.性别]
    if t[n] then
        玩家:添加技能(t[n], 1)
        玩家:常规提示("恭喜你！你学会了#R" .. t[n] .. "#W。")

    end
end

function 任务:添加奖励(玩家)
    if self.进度 == 1 then
        玩家:添加物品({ 生成物品 { 名称 = '游侠盟锦囊', 数量 = 1 } })
        玩家:添加称谓('游侠盟小虾米')
        玩家:更换称谓('游侠盟小虾米')
        玩家:添加任务经验(5000, "新手剧情1")--御武盟盟主
    elseif self.进度 == 2 then
        玩家:添加任务经验(8000, "新手剧情2")--领宠物
        -- 玩家:添加召唤(生成召唤 { 名称 = "小五叶" })
        玩家:添加召唤(生成召唤 { 名称 = "小浪淘沙" })
        -- 玩家:添加物品({ 生成物品 { 名称 = '召唤兽内丹', 数量 = 1, 技能 = "浩然正气" } })
        玩家:添加物品({ 生成物品 { 名称 = '召唤兽内丹', 数量 = 1, 技能 = "浩然正气" } })
    elseif self.进度 == 3 then
        玩家:添加任务经验(10000, "新手剧情3")--学技能
    elseif self.进度 == 4 then
        玩家:添加物品({ 生成物品 { 名称 = '宠物口粮', 数量 = 50 } })--江湖郎中
        玩家:双加(玩家.最大气血, 玩家.最大魔法)
        玩家:添加任务经验(12000, "新手剧情3")
    elseif self.进度 == 5 then
        玩家:添加物品({ 生成物品 { 名称 = '金针', 数量 = 50 }, 生成物品 { 名称 = '八角莲叶',
            数量 = 50 } })
        玩家:添加任务经验(20000, "新手剧情4")--药店老板
    elseif self.进度 == 6 then
        玩家:添加任务经验(30000, "新手剧情5")--村长--此处应该卡9级一半经验


    elseif self.进度 == 7 then
        玩家:添加任务经验(69835, "新手剧情6")--车夫
    elseif self.进度 == 8 then
        玩家:双加(玩家.最大气血, 玩家.最大魔法)
        玩家:添加任务经验(69835, "新手剧情7")--酒店
    elseif self.进度 == 9 then
        玩家:添加物品({
            生成物品 { 名称 = '月见草', 数量 = 50 },
            生成物品 { 名称 = '凤凰尾', 数量 = 50 }
        })
        玩家:添加任务经验(69835, "新手剧情7")--药店
    elseif self.进度 == 10 then
        local t = _新手装备[玩家.原形]
        local list = {}
        for k, v in pairs(t) do
            if v.部位 == 4 or v.部位 == 5 then
                local r = 生成装备 { 名称 = v.name }
                if r then
                    r.等级需求 = { 0, 30 }
                    if v.属性要求 then
                        r.属性要求 = { "力量", 10 }
                    end
                    r.基本属性 = {}
                    for a, b in pairs(v.属性) do
                        table.insert(r.基本属性, { a, b })
                    end
                end
                table.insert(list, r)
            end
        end
        if 玩家:添加物品(list) then --新手装备 9级武器 9级项链
            玩家:添加任务经验(69835, "新手剧情7")--铁匠
        end
    elseif self.进度 == 11 then
        local t = _新手装备[玩家.原形]
        local list = {}
        for k, v in pairs(t) do
            if v.部位 ~= 4 and v.部位 ~= 5 then
                local r = 生成装备 { 名称 = v.name }
                if r then
                    r.等级需求 = { 0, 30 }
                    if v.属性要求 then
                        r.属性要求 = { "力量", 10 }
                    end
                    r.基本属性 = {}
                    for a, b in pairs(v.属性) do
                        table.insert(r.基本属性, { a, b })
                    end
                end
                table.insert(list, r)
            end
        end
        if 玩家:添加物品(list) then
            玩家:添加任务经验(69835, "新手剧情7")--服装店
        end
    elseif self.进度 == 12 then
        玩家:添加物品 {
            生成物品 { 名称 = '高级飞行旗', 数量 = 1 },
            生成物品 { 名称 = '高级飞行旗', 数量 = 1 }
        }

        玩家:添加任务经验(69835, "新手剧情7")--杂货店

    elseif self.进度 == 13 then
        -- local r = 生成任务 { 名称 = '变身卡', 外形 = _外形[math.random(#_外形)] }
        -- r:添加任务(玩家)
        玩家:添加任务经验(69835, "新手剧情7")--双倍
        self.大雁杀敌 = 0
    elseif self.进度 == 14 then
        玩家:添加任务经验(69835, "新手剧情7")--杀敌五次 20级
    elseif self.进度 == 15 then
        玩家:添加任务经验(1000000, "新手剧情7")
    elseif self.进度 == 16 then

    elseif self.进度 == 17 then
        玩家:添加任务经验(794239, "新手剧情7")
    elseif self.进度 == 18 then
    end
end

function 任务:完成进度(玩家, 进度)
    if 玩家.是否组队 and 进度 ~= 15 and 进度 ~= 16 then
        for _, v in 玩家:遍历队伍() do
            local rr = v:取任务('新手剧情')
            if rr and rr.进度 == 进度 - 1 then
                rr:被动完成进度(v, 进度)
            end
        end
    else
        if self.进度 == 进度 - 1 then
            self:添加奖励(玩家) --当前进度
            self.进度 = self.进度 + 1
            self.别名 = _别名[self.进度]
            if self.进度 >= 17 then
                self:删除()
            end
        end
    end
    if 玩家 and not self.是否助战 then
        玩家:刷新追踪面板()
    end
end

function 任务:被动完成进度(玩家, 进度)
    if 进度 ~= 15 then
        if self.进度 == 进度 - 1 then
            self:添加奖励(玩家) --当前进度
            self.进度 = self.进度 + 1
            self.别名 = _别名[self.进度]
            if self.进度 > 17 then
                self:删除()
            end
        end
    end
    if 玩家 and not self.是否助战 then
        玩家:刷新追踪面板()
    end
end

function 任务:升级事件(玩家)
    -- if self.进度== then
    --     -- body
    -- end
end

function 任务:切换地图前事件(玩家, 地图)
    -- if 玩家.等级 < 10 then
    --     return false
    -- end
end

function 任务:玩家战斗结束(玩家, 地图)
    if 玩家.地图 == 1004 then
        self:大雁塔杀敌(玩家)
    end
end

function 任务:召唤战斗结束(玩家)

end

local _小怪 = { { 2001, "兔妖" }, { 2004, "小妖" }, { 2017, "骷颅怪" }, { 2027, "死灵" } }
function 任务:战斗初始化(玩家, NPC)
    if NPC.名称 == "索命鬼" then
        for i = 1, 1 do
            local r = 生成战斗怪物 {
                外形 = NPC.外形,
                名称 = NPC.名称,
                攻击 = 59,
                速度 = 38,
                气血 = 9862,
            }
            self:加入敌方(i, r)
        end
        for i = 2, 5 do
            local r = 生成战斗怪物 {
                外形 = _小怪[i - 1][1],
                名称 = _小怪[i - 1][2],
                攻击 = 3,
                速度 = 12,
                气血 = 2314,
            }
            self:加入敌方(i, r)
        end
    end
end

function 任务:战斗回合开始(dt)
end

function 任务:战斗结束(s)
    if s then
        for k, v in self:遍历我方() do
            if v.是否玩家 then
                local r = v.对象.接口:取任务("新手剧情")
                if r and r.进度 == 15 then

                    r:被动完成进度(v.对象.接口, 16)
                end
            end
        end
    end
end

return 任务
