-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2022-08-06 16:13:54
-- @Last Modified time  : 2023-05-02 06:19:20
local 任务 = {
    名称 = '领取称谓',
    别名 = '领取称谓',
    类型 = '称谓剧情',
    是否可取消 = false,
	是否可追踪 = true
}

function 任务:任务初始化(玩家, ...)
end

function 任务:任务上线(玩家)
    --self:删除()
end

function 任务:任务更新(玩家, sec)
end

local _详情 = {
	'  前往#Y金銮殿(61,37)#W找#u#G#m({金銮殿,61,37})李世民#m#u#W领取称谓#G#b%s',
	'  前往#Y长安城(24,17)#W找#u#G#m({长安,215,188})九头魔#m#u#W领取称谓#G#b%s',
	'  前往#Y长安城(20,160)#W找#u#G#m({长安,20,160})太白金星#m#u#W领取称谓#G#b%s',
	'  前往#Y长安城(215,188)#W找#u#G#m({长安,215,188})阴长生#m#u#W领取称谓#G#b%s'
}



local _追踪描述 = {
	'  前往#Y金銮殿(61,37)#W找#u#G#m({金銮殿,61,37})李世民#m#u#W领取称谓#G#b%s',
	'  前往#Y长安城(24,17)#W找#u#G#m({长安,215,188})九头魔#m#u#W领取称谓#G#b%s',
	'  前往#Y长安城(20,160)#W找#u#G#m({长安,20,160})太白金星#m#u#W领取称谓#G#b%s',
	'  前往#Y长安城(215,188)#W找#u#G#m({长安,215,188})阴长生#m#u#W领取称谓#G#b%s'
}


local _称谓表 = {
    {'武林新丁', '江湖小虾', '后起之秀', '武林高手', '风尘奇侠', '无双隐士', '世外高人', '江湖侠隐', '无敌圣者', '三界贤君', '夕阳武士', '神通广大', '变化无穷', '火眼金睛'},
    {'古灵精怪', '魅力精灵', '魔幻使者', '妖之奇葩', '天神煞星', '万兽妖灵', '混世魔王', '三界妖仙', '魔神至尊', '齐天妖王', '夕阳武士', '神通广大', '变化无穷', '火眼金睛'},
    {'仙灵小童', '逍遥之仙', '陆地飞仙', '无极天师', '神机真人', '降魔金仙', '金身尊者', '天外飞仙', '万圣天尊', '九天圣佛', '夕阳武士', '神通广大', '变化无穷', '火眼金睛'},
    {'阴曹小鬼', '飘渺之魂', '幽冥鬼士', '勾魂使者', '催命判官', '阴阳无常', '阎罗鬼王', '冥灵鬼仙', '九幽神君', '阴都大帝', '夕阳武士', '神通广大', '变化无穷', '火眼金睛'}
}
local _领取人 = {'李世民', '九头魔', '太白金星', '阴长生'}
local _台词 = {
[[
据说，你行走四方做了不少好事，平民们很感激，我愿意嘉奖你的功绩，你愿意现在就获得嘉奖吗?
menu
1|我就是找你来领头衔的啦。
 99|我只是路过，脸没洗牙也还没有刷呢。
]]
}

function 任务:任务取详情(玩家)
    return _详情[玩家.种族]:format(_称谓表[玩家.种族][self.cw])
end

function 任务:任务取追踪(玩家)
    return _追踪描述[玩家.种族]:format(_称谓表[玩家.种族][self.cw])
end



function 任务:任务NPC对话(玩家, NPC)
    if NPC.名称==_领取人[玩家.种族] and NPC.台词 then
        NPC.台词=_台词[1]
    end



end

function 任务:任务NPC菜单(玩家, NPC, i)
    if NPC.名称==_领取人[玩家.种族] then
        if i=="1" then
            玩家:添加称谓(_称谓表[玩家.种族][self.cw])
            if self.cw==1 then
                local r = 生成任务 {名称 = '称谓2_定魂珠', 进度 = 0, 对话进度 = 0}
                玩家:添加任务(r)
                r = 生成任务 {名称 = '称谓2_水陆大会', 进度 = 0}
                玩家:添加任务(r)
                r = 生成任务 {名称 = '称谓2_般若多罗密心经', 进度 = 0}
                玩家:添加任务(r)
            elseif self.cw==2 then
                local r = 生成任务 {名称 = '称谓3_夜光珠', 进度 = 0, 对话进度 = 0}
                玩家:添加任务(r)
                r = 生成任务 {名称 = '称谓3_山贼之灵', 进度 = 0}
                玩家:添加任务(r)
                r = 生成任务 {名称 = '称谓3_春三十娘', 进度 = 0}
                玩家:添加任务(r)
                r = 生成任务 {名称 = '称谓3_羊脂仙露', 进度 = 0}
                玩家:添加任务(r)
            elseif self.cw==3 then
                local r = 生成任务 {名称 = '称谓4_加入天兵', 进度 = 0, 对话进度 = 0}
                玩家:添加任务(r)
                r = 生成任务 {名称 = '称谓4_四琉璃碎片', 进度 = 0}
                玩家:添加任务(r)
                r = 生成任务 {名称 = '称谓4_摄魂鬼', 进度 = 0}
                玩家:添加任务(r)
                r = 生成任务 {名称 = '称谓4_滋扰高小姐的妖怪', 进度 = 0}
                玩家:添加任务(r)
            elseif self.cw==4 then
                local r = 生成任务 {名称 = '称谓5_天宫名菜', 进度 = 0, 对话进度 = 0}
                玩家:添加任务(r)
                r = 生成任务 {名称 = '称谓5_天宫玉酒', 进度 = 0}
                玩家:添加任务(r)
                r = 生成任务 {名称 = '称谓5_找到紫霞', 进度 = 0}
                玩家:添加任务(r)
            elseif self.cw==5 then
                local r = 生成任务 {名称 = '称谓6_孽缘', 进度 = 0, 对话进度 = 0}
                玩家:添加任务(r)
                r = 生成任务 {名称 = '称谓6_孽缘之太上老君', 进度 = 0}
                玩家:添加任务(r)
                r = 生成任务 {名称 = '称谓6_孽缘之思情', 进度 = 0}
                玩家:添加任务(r)
                r = 生成任务 {名称 = '称谓6_孽缘之海底妖尸', 进度 = 0}
                玩家:添加任务(r)
            elseif self.cw==6 then
                local r = 生成任务 {名称 = '称谓7_拯救唐僧', 进度 = 0, 对话进度 = 0}
                玩家:添加任务(r)
                r = 生成任务 {名称 = '称谓7_玄天神鞭', 进度 = 0}
                玩家:添加任务(r)
            elseif self.cw==7 then
                local r = 生成任务 {名称 = '称谓8_一万三千年之前', 进度 = 0, 对话进度 = 0}
                玩家:添加任务(r)
                r = 生成任务 {名称 = '称谓8_妙法莲华经', 进度 = 0}
                玩家:添加任务(r)
            elseif self.cw==8 then
                if 玩家.性别 == 1 then
                    生成装备 { 名称 = "龙骨甲", 部位 = 6, 等级需求 = 60, 属性要求 = { "力量", 60 }, 属性 = { 物理吸收 = 35, 防御 = 1780, 速度 = -25 } }
                    生成装备 { 名称 = "乾坤帽", 部位 = 2, 等级需求 = 60, 属性要求 = { "力量", 60 }, 属性 = { 物理吸收 = 35, 命中率 = -11 } }
                else
                    生成装备 { 名称 = "龙鳞羽衣", 部位 = 6, 等级需求 = 60, 属性要求 = { "力量", 60 }, 属性 = { 物理吸收 = 35, 防御 = 1780, 速度 = -25 } }
                    生成装备 { 名称 = "七彩花环", 部位 = 2, 等级需求 = 60, 属性要求 = { "力量", 60 }, 属性 = { 物理吸收 = 35, 命中率 = -11 } }
                end
                生成装备 { 名称 = "魔龙之心", 部位 = 4, 等级需求 = 70 , 属性 = { 附加气血 = 2800 ,附加魔法 = 3800 , 物理吸收 = 15 , 躲闪率 = 35 } }
                local r = 生成任务 {名称 = '称谓9_抹杀孙悟空', 进度 = 0, 对话进度 = 0}
                玩家:添加任务(r)
                r = 生成任务 {名称 = '称谓9_斧头帮的白虎', 进度 = 0}
                玩家:添加任务(r)
                r = 生成任务 {名称 = '称谓9_蟠桃园的山妖', 进度 = 0}
                玩家:添加任务(r)
            elseif self.cw==9 then
                local r = 生成任务 {名称 = '称谓10_九生九死', 进度 = 0, 对话进度 = 0}
                玩家:添加任务(r)
			elseif self.cw==10 then
                local r = 生成任务 {名称 = '称谓11_佛家宝物', 进度 = 0, 对话进度 = 0}
                玩家:添加任务(r)
				r = 生成任务 {名称 = '称谓11_夕阳武士', 进度 = 0, 对话进度 = 0}
                玩家:添加任务(r)
				r = 生成任务 {名称 = '称谓11_紫霞的金铃', 进度 = 0, 对话进度 = 0}
                玩家:添加任务(r)
			elseif self.cw==11 then
                local r = 生成任务 {名称 = '称谓12_度亡经', 进度 = 0, 对话进度 = 0}
                玩家:添加任务(r)	
				r = 生成任务 {名称 = '称谓12_四圣戏禅心', 进度 = 0, 对话进度 = 0}
                玩家:添加任务(r)	
				r = 生成任务 {名称 = '称谓12_玄奘身世', 进度 = 0, 对话进度 = 0}
                玩家:添加任务(r)	
			elseif self.cw==12 then
                local r = 生成任务 {名称 = '称谓13_取经路上', 进度 = 0, 对话进度 = 0}
                玩家:添加任务(r)	
				r = 生成任务 {名称 = '称谓13_偷吃人参果', 进度 = 0, 对话进度 = 0}
                玩家:添加任务(r)
			elseif self.cw==13 then
                local r = 生成任务 {名称 = '称谓14_三打白骨精', 进度 = 0, 对话进度 = 0}
                玩家:添加任务(r)	
			elseif self.cw==14 then
                local r = 生成任务 {名称 = '称谓15_九生九死', 进度 = 0, 对话进度 = 0}
                玩家:添加任务(r)	
            end
            self:删除()
        end
    end
	玩家:刷新追踪面板()
end

function 任务:完成(玩家)

end

function 任务:任务NPC给予(玩家, NPC, cash, items)
end

function 任务:任务攻击事件(玩家, NPC)

end

function 任务:战斗初始化(玩家)
end

function 任务:战斗回合开始(dt)
end

function 任务:战斗结束(x, y)
end

return 任务
