-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2022-08-24 09:47:51
-- @Last Modified time  : 2023-05-06 06:41:44
local 法术 = {
    类别 = '坐骑',
    类型 = 2,
    对象 = 0,
    条件 = 0,
    名称 = '追魂夺命',
    种族 = 1
}

function 法术:计算(坐骑, 召唤)
    local sp, mlz = self:效果计算(坐骑)
    召唤.速度=召唤.速度+math.floor( 召唤.速度*sp*0.01 )
    召唤.抗性.命中率=召唤.抗性.命中率+mlz
    召唤.抗性.致命几率=召唤.抗性.致命几率+mlz
    召唤.抗性.连击率=召唤.抗性.连击率+mlz
end

function 法术:效果计算(坐骑)
    local 坐骑参数={
        [1]={[1]=4.115226337,[2]=1.141552511},
        [2]={[1]=14.40329218,[2]=3.99543379},
        [3]={[1]=4.8,[2]=1.333333333},
        [4]={[1]=14.4,[2]=4},
        [5]={[1]=14.4,[2]=4},
        [6]={[1]=3.6,[2]=1},
        [7]={[1]=7.2,[2]=2},
        [8]={[1]=4.8,[2]=1.333333333},
        [9]={[1]=7.2,[2]=2},
        [10]={[1]=4.8,[2]=1.333333333},
        [11]={[1]=7.2,[2]=2},
        [12]={[1]=4.8,[2]=1.333333333},
        [13]={[1]=7.2,[2]=2},
        [14]={[1]=7.2,[2]=2},
        [15]={[1]=4.8,[2]=1.333333333},
        [16]={[1]=7.2,[2]=2},
        [17]={[1]=14.4,[2]=4},
        [18]={[1]=4.8,[2]=1.333333333},
        [19]={[1]=7.2,[2]=2},
        [20]={[1]=4.8,[2]=1.333333333},
        [21]={[1]=3.6,[2]=1},
        [22]={[1]=14.4,[2]=4},
        [23]={[1]=7.2,[2]=2}}
    local 坐骑系数={[1]=0.3,[2]=0.3,[3]=0.7,[4]=0.7,[5]=0,[6]=0,[7]=10000,[8]=10000,[9]=1.2}
    local 等级=坐骑.等级
    local 熟练=self.熟练度
    local 根骨=坐骑.根骨
    local 灵性=坐骑.灵性
    local 力量=坐骑.力量
    local 成长=1

    local sp = (根骨 * 坐骑系数[5] + 灵性 * 坐骑系数[1] + 力量 * 坐骑系数[4]) * 成长 / 坐骑参数[22][1] + 熟练 / 坐骑系数[7] / 坐骑参数[22][2]
    local mlz = (根骨 * 坐骑系数[6] + 灵性 * 坐骑系数[2] + 力量 * 坐骑系数[3]) * 成长 / 坐骑参数[23][1] + 熟练 / 坐骑系数[7] / 坐骑参数[23][2]
    sp = math.ceil(sp * 100) / 100
    mlz = math.ceil(mlz * 100) / 100
    return sp, mlz
end

function 法术:取描述(坐骑)
    local sp, mlz = self:效果计算(坐骑)
    return string.format("#G增加SP#R%s%%#G,增加命中率#R%s%%#G,增加致命几率#R%s%%#G,连击率#R%s%%", sp, mlz
        , mlz, mlz)
end

return 法术
