-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2022-08-24 09:47:51
-- @Last Modified time  : 2023-05-06 06:45:01
local 法术 = {
    类别 = '坐骑',
    类型 = 2,
    对象 = 0,
    条件 = 0,
    名称 = '金身不坏',
    种族 = 1
}

function 法术:计算(坐骑, 召唤)
    local hp, wlxs, kzs, kzd, kssc = self:效果计算(坐骑)
    local jhp = math.floor(召唤.最大气血 * hp * 0.01)
    召唤.最大气血 = 召唤.最大气血 + jhp
    召唤.气血 = 召唤.气血 + jhp
    召唤.抗性.物理吸收 = 召唤.抗性.物理吸收 + wlxs
    召唤.抗性.抗震慑 = 召唤.抗性.抗震慑 + kzs
    召唤.抗性.抗中毒 = 召唤.抗性.抗中毒 + kzd
    召唤.抗性.抗三尸虫 = 召唤.抗性.抗三尸虫 + kssc
end

function 法术:效果计算(坐骑)
    local 坐骑参数={
        [1]={[1]=4.115226337,[2]=1.141552511},
        [2]={[1]=14.40329218,[2]=3.99543379},
        [3]={[1]=4.8,[2]=1.333333333},
        [4]={[1]=14.4,[2]=4},
        [5]={[1]=14.4,[2]=4},
        [6]={[1]=3.6,[2]=1},
        [7]={[1]=7.2,[2]=2},
        [8]={[1]=4.8,[2]=1.333333333},
        [9]={[1]=7.2,[2]=2},
        [10]={[1]=4.8,[2]=1.333333333},
        [11]={[1]=7.2,[2]=2},
        [12]={[1]=4.8,[2]=1.333333333},
        [13]={[1]=7.2,[2]=2},
        [14]={[1]=7.2,[2]=2},
        [15]={[1]=4.8,[2]=1.333333333},
        [16]={[1]=7.2,[2]=2},
        [17]={[1]=14.4,[2]=4},
        [18]={[1]=4.8,[2]=1.333333333},
        [19]={[1]=7.2,[2]=2},
        [20]={[1]=4.8,[2]=1.333333333},
        [21]={[1]=3.6,[2]=1},
        [22]={[1]=14.4,[2]=4},
        [23]={[1]=7.2,[2]=2}}
    local 坐骑系数={[1]=0.3,[2]=0.3,[3]=0.7,[4]=0.7,[5]=0,[6]=0,[7]=10000,[8]=10000,[9]=1.2}
    local 等级=坐骑.等级
    local 熟练=self.熟练度
    local 根骨=坐骑.根骨
    local 灵性=坐骑.灵性
    local 力量=坐骑.力量
    local 成长=1

    local hp = (根骨 * 坐骑系数[3] + 灵性 * 坐骑系数[5] + 力量 * 坐骑系数[2]) * 成长 / 坐骑参数[5][1] + 熟练 / 坐骑系数[7] / 坐骑参数[5][2]
    local wlxs = (根骨 * 坐骑系数[4] + 灵性 * 坐骑系数[6] + 力量 * 坐骑系数[1]) * 成长 / 坐骑参数[6][1] + 熟练 / 坐骑系数[7] / 坐骑参数[6][2]
    local kzs = (根骨 * 坐骑系数[4] + 灵性 * 坐骑系数[5] + 力量 * 坐骑系数[2]) * 成长 / 坐骑参数[7][1] + 熟练 / 坐骑系数[7] / 坐骑参数[7][2]
    local kzd = (根骨 * 坐骑系数[3] + 灵性 * 坐骑系数[5] + 力量 * 坐骑系数[1]) * 成长 / 坐骑参数[8][1] + 熟练 / 坐骑系数[7] / 坐骑参数[8][2]
    local kssc = (根骨 * 坐骑系数[3] + 灵性 * 坐骑系数[5] + 力量 * 坐骑系数[1]) * 125 / 3 + 熟练 * 1500 / 100000
    hp = math.ceil(hp * 100) / 100
    wlxs = math.ceil(wlxs * 100) / 100
    kzs = math.ceil(kzs * 100) / 100
    kzd = math.ceil(kzd * 100) / 100
    kssc = math.floor(kssc)
    return hp, wlxs, kzs, kzd, kssc
end

function 法术:取描述(坐骑)
    local hp, wlxs, kzs, kzd, kssc = self:效果计算(坐骑)
    return string.format("#G增加HP#R%s%%#G,增加物理吸收#R%s%%#G,增加抗震慑#R%s%%#G,增加抗中毒#R%s%%#G,增加抗三尸虫#R%s#G。"
        , hp, wlxs, kzs, kzd, kssc)
end

return 法术
