-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2022-09-02 20:05:35
-- @Last Modified time  : 2024-10-18 21:11:14
return {
    {
        名字 = '热卖',
        { 类别 = '道具', 名称 = '圣旨', 价格 = 80},
    { 类别 = '道具', 名称 = '高级孔明灯', 价格 = 30},

        { 类别 = '道具', 名称 = '银票', 参数 = 10000000, 属性="#Y增加银两 10000000",价格 = 120, 热卖 = true},
        { 类别 = '道具', 名称 = '炼化礼包', 价格 = 300, 热卖 = true },
        { 类别 = '道具', 名称 = '玉枢返虚丸', 价格 = 5, 热卖 = true },
        { 类别 = '道具', 名称 = '神兵石', 价格 = 60, 热卖 = true},
        { 类别 = '道具', 名称 = '高级金柳露', 价格 = 100, 热卖 = true },
        { 类别 = '道具', 名称 = '超级金柳露', 价格 = 288, 热卖 = true},
        { 类别 = '道具', 名称 = '清盈果', 价格 = 100, 热卖 = true},
        { 类别 = '道具', 名称 = '修正卡', 价格 = 300, 热卖 = true},



        { 类别 = '道具', 名称 = '人参果王', 价格 = 1},
       { 类别 = '道具', 名称 = '银票', 参数 = 50000000, 属性="#Y增加银两 500000000",价格 = 120 },
         { 类别 = '道具', 名称 = '测试人参果王', 价格 = 1},
         { 类别 = '道具', 名称 = '超级神兽丹', 价格 = 1},
         { 类别 = '道具', 名称 = '蟠桃王', 价格 = 1 },
        { 类别 = '道具', 名称 = '仙器礼盒',参数=1,属性="#Y获得1阶随机仙器", 价格 = 1   },
        { 类别 = '道具', 名称 = '仙器礼盒',参数=6,属性="#Y获得6阶随机仙器", 价格 = 1   },
        { 类别 = '道具', 名称 = '神兵礼盒', 价格 = 1 },
        { 类别 = '道具', 名称 = '神兵礼盒', 参数 = 5, 价格 = 5},
        { 类别 = '道具', 名称 = '神兵礼盒', 参数 = 6, 价格 = 5},
        { 类别 = '道具', 名称 = '银票', 参数 = 20000000, 属性="#Y增加银两 20000000",价格 = 1},
        { 类别 = '道具', 名称 = '银票', 参数 = 50000000, 属性="#Y增加银两 50000000",价格 = 1},
        { 类别 = '道具', 名称 = '神兵礼盒', 价格 = 1},
        { 类别 = '道具', 名称 = '超级元气丹', 价格 = 1},
        { 类别 = '道具', 名称 = '超级变色丹', 价格 = 1},
        { 类别 = '道具', 名称 = '随机天书召唤兽', 价格 = 1},
         { 类别 = '道具', 名称 = '随机神兽宝盒', 价格 = 1},
        { 类别 = '道具', 名称 = '筋骨提气丸', 价格 = 1},
        { 类别 = '道具', 名称 = '帮派成就册', 参数 = 10000, 价格 = 1 },
         { 类别 = '道具', 名称 = '蓬莱仙泉水', 价格 = 1 },
         { 类别 = '道具', 名称 = '六脉化神丸', 价格 = 1 },
        { 类别 = '道具', 名称 = '玉枢返虚丸', 价格 = 1 },
         { 类别 = '道具', 名称 = '三界召集令', 价格 = 1 },
         { 类别 = '道具', 名称 = '任我行·组队', 价格 = 20 },
         { 类别 = '道具', 名称 = '任我行·单人', 价格 = 10 },
         { 类别 = '道具', 名称 = '特赦令', 价格 = 800 },
        { 类别 = '道具', 名称 = '帮派成就册', 参数 = 10000, 价格 = 480 },
        { 类别 = '道具', 名称 = '更名卡', 价格 = 800 },
        { 类别 = '道具', 名称 = '九玄仙玉', 价格 = 1},
        { 类别 = '道具', 名称 = '神功笔录', 价格 = 1},
        { 类别 = '道具', 名称 = '落魂砂', 价值 = 125, 价格 = 1 },
        { 类别 = '道具', 名称 = '炼化礼包', 价格 = 1 },
        { 类别 = '道具', 名称 = '高级坐骑令', 价格 = 1 },
        { 类别 = '道具', 名称 = '伐骨洗髓丹', 价格 = 1 },
        { 类别 = '道具', 名称 = '神兽碎片', 价格 = 1 },
        { 类别 = '道具', 名称 = '超级神兽丹', 价格 = 1},
        { 类别 = '道具', 名称 = '蟠桃', 价格 = 1 },
        { 类别 = '道具', 名称 = '凝精聚气丹', 价格 = 1 },
         { 类别 = '道具', 名称 = '高级悔梦石', 参数=4,属性="#Y用来对四阶和四阶以下仙器进行高级重铸",价格 = 1},
         { 类别 = '道具', 名称 = '高级悔梦石', 参数=5,属性="#Y可用来对五阶仙器进行高级重铸",价格 = 1},
         { 类别 = '道具', 名称 = '高级悔梦石', 参数=6,属性="#Y可用来对六阶仙器进行高级重铸",价格 = 1},
         { 类别 = '道具', 名称 = '仙器礼盒',参数=6,属性="#Y获得6阶随机仙器", 价格 = 6   },
          { 类别 = '道具', 名称 = '随机神兽宝盒', 价格 = 1},
        { 类别 = '道具', 名称 = '守护宝鉴', 价格 = 168 },
        { 类别 = '道具', 名称 = '龙涎丸宝卷', 价格 = 288 },
        { 类别 = '道具', 名称 = '神兽自选礼包', 价格 = 288 },
         { 类别 = '道具', 名称 = '五级神兵自选', 价格 = 5 },
         { 类别 = '道具', 名称 = '六级神兵自选', 价格 = 5 },
         { 类别 = '道具', 名称 = '启魂丹', 价格 = 5 },
         { 类别 = '道具', 名称 = '聚魄丹', 价格 = 5 },
          { 类别 = '道具', 名称 = '超级亲密丹', 价格 = 5 },
          { 类别 = '道具', 名称 = 'VIP月卡', 价格 = 5 },
          { 类别 = '道具', 名称 = '高级坐骑令', 价格 = 5 },
          { 类别 = '道具', 名称 = '坐骑经验书', 价格 = 5 },
          { 类别 = '道具', 名称 = '坐骑熟练丹', 价格 = 5 },
		  { 类别 = '道具', 名称 = '夜光珠', 价格 = 5 },


       -- { 类别 = '道具', 名称 = '人参果王', 价格 = 0},
       --{ 类别 = '道具', 名称 = '银票', 参数 = 50000000, 属性="#Y增加银两 500000000",价格 = 120, 热卖 = true},
        -- { 类别 = '道具', 名称 = '测试人参果王', 价格 = 1},
        -- { 类别 = '道具', 名称 = '超级神兽丹', 价格 = 1},
        -- { 类别 = '道具', 名称 = '蟠桃王', 价格 = 1 },
       -- { 类别 = '道具', 名称 = '仙器礼盒',参数=1,属性="#Y获得1阶随机仙器", 价格 = 0 , 热卖 = true },
        --{ 类别 = '道具', 名称 = '仙器礼盒',参数=6,属性="#Y获得6阶随机仙器", 价格 = 0 , 热卖 = true },
       -- { 类别 = '道具', 名称 = '神兵礼盒', 价格 = 180, 热卖 = true},
       -- { 类别 = '道具', 名称 = '仙器礼盒',参数=1,属性="#Y获得1阶随机仙器", 价格 = 250 , 热卖 = true },
        --{ 类别 = '道具', 名称 = '神兵礼盒', 参数 = 5, 价格 = 999999},
       -- { 类别 = '道具', 名称 = '银票', 参数 = 20000000, 属性="#Y增加银两 20000000",价格 = 0},
       -- { 类别 = '道具', 名称 = '银票', 参数 = 50000000, 属性="#Y增加银两 50000000",价格 = 0},
        --{ 类别 = '道具', 名称 = '神兵礼盒', 价格 = 0},
       -- { 类别 = '道具', 名称 = '超级元气丹', 价格 = 0},
       -- { 类别 = '道具', 名称 = '超级变色丹', 价格 = 0},
        --{ 类别 = '道具', 名称 = '随机天书召唤兽', 价格 = 0},
        -- { 类别 = '道具', 名称 = '随机神兽宝盒', 价格 = 0},
        -- { 类别 = '道具', 名称 = '二级配饰盒子', 价格 = 1},
        -- { 类别 = '道具', 名称 = '三级配饰盒子', 价格 = 100},
       -- { 类别 = '道具', 名称 = '筋骨提气丸', 价格 = 0},
       -- { 类别 = '道具', 名称 = '帮派成就册', 参数 = 10000, 价格 = 0 },
        -- { 类别 = '道具', 名称 = '蓬莱仙泉水', 价格 = 0 },
        -- { 类别 = '道具', 名称 = '六脉化神丸', 价格 = 0 },
       -- { 类别 = '道具', 名称 = '玉枢返虚丸', 价格 = 0 },
        -- { 类别 = '道具', 名称 = '三界召集令', 价格 = 0 },
        -- { 类别 = '道具', 名称 = '任我行·组队', 价格 = 20 },
        -- { 类别 = '道具', 名称 = '任我行·单人', 价格 = 10 },
        -- { 类别 = '道具', 名称 = '特赦令', 价格 = 800 },

    },
    {
        名字 = '人物',
        { 类别 = '道具', 名称 = '清盈果', 价格 = 100},
        { 类别 = '道具', 名称 = '超级星梦石', 价格 = 20},
        { 类别 = '道具', 名称 = '修正卡', 价格 = 300},
        { 类别 = '道具', 名称 = '神兵礼盒', 价格 = 180},
        { 类别 = '道具', 名称 = '特赦令', 价格 = 800 },



         --{ 类别 = '道具', 名称 = '神兵礼盒', 参数 = 5, 价格 = 999999},
        --{ 类别 = '道具', 名称 = '帮派成就册', 参数 = 10000, 价格 = 480 },
       -- { 类别 = '道具', 名称 = '更名卡', 价格 = 800 },
       -- { 类别 = '道具', 名称 = '九玄仙玉', 价格 = 0},
       -- { 类别 = '道具', 名称 = '神功笔录', 价格 = 0},
       -- { 类别 = '道具', 名称 = '落魂砂', 价值 = 125, 价格 = 0 },
      --  { 类别 = '道具', 名称 = '炼化礼包', 价格 = 0 },
       -- { 类别 = '道具', 名称 = '高级坐骑令', 价格 = 0 },





    },
    {
        名字 = '召唤兽',
        { 类别 = '道具', 名称 = '亲密丹', 参数=100000,属性="#Y增加亲密度 100000",价格 = 100 },
        { 类别 = '道具', 名称 = '龙之骨', 价格 = 120 },

        { 类别 = '道具', 名称 = '混元丹', 价格 = 10 },
        { 类别 = '道具', 名称 = '九转易筋丸', 价格 = 60 },
        { 类别 = '道具', 名称 = '高级金柳露', 价格 = 20},
        { 类别 = '道具', 名称 = '超级金柳露', 价格 = 300},



        ---{ 类别 = '道具', 名称 = '伐骨洗髓丹', 价格 = 0 },
        ---{ 类别 = '道具', 名称 = '神兽碎片', 价格 = 0 },
       -- { 类别 = '道具', 名称 = '超级神兽丹', 价格 = 0},

    },
    {
        名字 = '强化',

       { 类别 = '道具', 名称 = '悔梦石', 价格 = 80},
        { 类别 = '道具', 名称 = '九玄仙玉', 价格 = 10},
        { 类别 = '道具', 名称 = '神功笔录', 价格 = 10},
        { 类别 = '道具', 名称 = '落魂砂', 价值 = 125, 价格 = 10 },
        { 类别 = '道具', 名称 = '炼化礼包', 价格 = 300 },
        { 类别 = '道具', 名称 = '神兵石', 价格 = 60 },
        { 类别 = '道具', 名称 = '六魂之玉', 价格 = 60 },



        --{ 类别 = '道具', 名称 = '蟠桃', 价格 = 0 },
        --{ 类别 = '道具', 名称 = '凝精聚气丹', 价格 = 0 },
        --{ 类别 = '道具', 名称 = '仙器礼盒',参数=6,属性="#Y获得3阶随机仙器", 价格 = 10000 , 热卖 = true },
        -- { 类别 = '道具', 名称 = '高级悔梦石', 参数=4,属性="#Y用来对四阶和四阶以下仙器进行高级重铸",价格 = 0},
        -- { 类别 = '道具', 名称 = '高级悔梦石', 参数=5,属性="#Y可用来对五阶仙器进行高级重铸",价格 = 0},
        -- { 类别 = '道具', 名称 = '高级悔梦石', 参数=6,属性="#Y可用来对六阶仙器进行高级重铸",价格 = 0},
        -- { 类别 = '道具', 名称 = '仙器礼盒',参数=6,属性="#Y获得6阶随机仙器", 价格 = 9999 , 热卖 = true },
        -- { 类别 = '道具', 名称 = '神兵礼盒',参数=5,属性="#Y获得5级随机神兵", 价格 = 999},
    },
    {
        名字 = '养育',

        { 类别 = '道具', 名称 = '三字经', 价格 = 20 },
        { 类别 = '道具', 名称 = '六韬三略' , 价格 = 20 },
        { 类别 = '道具', 名称 = '内功心法' , 价格 = 20 },
        { 类别 = '道具', 名称 = '千字文' , 价格 = 20 },
        { 类别 = '道具', 名称 = '孝经' , 价格 = 20 },
        { 类别 = '道具', 名称 = '戒指' , 价格 = 20 },
        { 类别 = '道具', 名称 = '玉佩' , 价格 = 20 },
        { 类别 = '道具', 名称 = '百年何首乌' , 价格 = 20 },
        { 类别 = '道具', 名称 = '百年茯苓' , 价格 = 20 },




    },
        {
        名字 = '限时',

        { 类别 = '道具', 名称 = '百年雪莲' , 价格 = 20 },
        { 类别 = '道具', 名称 = '鬼谷子' , 价格 = 20 },
        { 类别 = '道具', 名称 = '金丹' , 价格 = 20 },
        { 类别 = '道具', 名称 = '猕猴桃' , 价格 = 20 },
        { 类别 = '道具', 名称 = '元气丹',属性="#Y购买后获得随机一种可变色召唤兽的元气丹", 价格 = 280 },
        { 类别 = '道具', 名称 = '变色丹',属性="#Y购买后获得随机一种可变色召唤兽的变色丹", 价格 = 180 },
        { 类别 = '道具', 名称 = '随机天书召唤兽', 价格 = 68 },



        -- { 类别 = '道具', 名称 = '随机神兽宝盒', 价格 = 0},
       -- { 类别 = '道具', 名称 = '守护宝鉴', 价格 = 168 },
       -- { 类别 = '道具', 名称 = '龙涎丸宝卷', 价格 = 288 },



    },
}
