-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-08-17 00:52:55
-- @Last Modified time  : 2022-09-02 09:56:27
local 商店 = {}

local list = {
    { 类别 = "普通装备", 名称 = "长刀", 价格 = 500 },
    { 类别 = "普通装备", 名称 = "短斧", 价格 = 500 },
    { 类别 = "普通装备", 名称 = "朝天棍", 价格 = 500 },
    { 类别 = "普通装备", 名称 = "纸扇", 价格 = 500 },
    { 类别 = "普通装备", 名称 = "松木拂尘", 价格 = 500 },
    { 类别 = "普通装备", 名称 = "长剑", 价格 = 500 },
    { 类别 = "普通装备", 名称 = "九节鞭", 价格 = 500 },
    { 类别 = "普通装备", 名称 = "长枪", 价格 = 500 },
    { 类别 = "普通装备", 名称 = "五色缎带", 价格 = 500 },
    { 类别 = "普通装备", 名称 = "双钩刀", 价格 = 500 },
    { 类别 = "普通装备", 名称 = "铁拳套", 价格 = 500 },
    { 类别 = "普通装备", 名称 = "铁爪", 价格 = 500 },
    { 类别 = "普通装备", 名称 = "木环", 价格 = 500 },
    { 类别 = "普通装备", 名称 = "大锤", 价格 = 500 },
}

function 商店:取商品()
    return list
end

function 商店:购买(玩家, i, n)
    local 总价 = n * list[i].价格
    if 玩家.银子 >= 总价 then
        local t = 复制表(list[i])
        t.类别 = nil
        t.价格 = nil
        local 物品表 = {}
        local 第一 = 生成装备(t)
        if 第一.是否叠加 then
            第一.数量 = n
            table.insert(物品表, 第一)
        else
            for _ = 1, n do
                table.insert(物品表, 生成装备(t))
            end
        end
        if 玩家:添加物品_无提示(物品表) then
            玩家:扣除银子(总价)
            玩家:提示窗口('#Y你购买了%s个#G%s#Y,共花费%s银两。',  n,t.名称, 总价)
            return true
        else
            return '#Y空间不足'
        end

    else
        return '#Y你的银两不足，不能购买！'
    end
end

return 商店
