-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2022-08-17 00:52:55
-- @Last Modified time  : 2024-10-14 20:49:03
local 商店 = {}

local list = {
    { 类别 = "道具", 名称 = "八荒遗风", 价格 = 2000000 },
    { 类别 = "道具", 名称 = "飞行旗", 价格 = 650 },
    { 类别 = "道具", 名称 = "高级飞行旗", 价格 = 24000 },
    { 类别 = "道具", 名称 = "孔明灯", 价格 = 650000 },
    { 类别 = "道具", 名称 = "宠物口粮", 价格 = 50 },
    { 类别 = "道具", 名称 = "高级宠物口粮", 价格 = 1000 },
    { 类别 = "道具", 名称 = "百里香", 价格 = 500 },
    { 类别 = "道具", 名称 = "摄妖香", 价格 = 1000 },
    { 类别 = "道具", 名称 = "夺命香", 价格 = 10000000 },
    { 类别 = "道具", 名称 = "还我漂漂丹", 价格 = 1000 },
    { 类别 = "药品", 名称 = "六脉化神丸", 价格 = 500000 },
    { 类别 = "道具", 名称 = "组队飞行符", 价格 = 200000 },
    { 类别 = "道具", 名称 = "二坐骑召唤卡", 价格 = 1 },
    { 类别 = "道具", 名称 = "三坐骑召唤卡", 价格 = 1 },
    { 类别 = "道具", 名称 = "四坐骑召唤卡", 价格 = 1 },
    { 类别 = "道具", 名称 = "五坐骑召唤卡", 价格 = 1 },
    { 类别 = "道具", 名称 = "六坐骑召唤卡", 价格 = 1 },
    { 类别 = "道具", 名称 = "5000点仙玉卡", 价格 = 1 },



}

function 商店:取商品()
    return list
end

function 商店:购买(玩家, i, n)
    if n == 0 then
        return
    end
    local 总价 = n * list[i].价格
    if 玩家.银子 >= 总价 then
        local t = 复制表(list[i])
        t.类别 = nil
        t.价格 = nil
        local 物品表 = {}
        local 第一 = 生成物品(t)
        if 第一.是否叠加 then
            第一.数量 = n
            table.insert(物品表, 第一)
        else
            for _ = 1, n do
                table.insert(物品表, 生成物品(t))
            end
        end
        if 玩家:添加物品_无提示(物品表) then
            玩家:扣除银子(总价)
            玩家:提示窗口('#Y你购买了%s个#G%s#Y,共花费%s银两。',  n,t.名称, 总价)
            return true
        else
            return '#Y空间不足'
        end

    else
        return '#Y你的银两不足，不能购买！'
    end
end

return 商店
