-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2022-08-17 00:52:55
-- @Last Modified time  : 2024-02-16 08:47:39
local 商店 = {}

local list = {
    { 类别 = "道具", 名称 = "玉佩", 价格 = 1000000 },
    { 类别 = "道具", 名称 = "鬼谷子", 价格 = 1000000 },
    { 类别 = "道具", 名称 = "六韬三略", 价格 = 1000000 },
    { 类别 = "道具", 名称 = "百年茯苓", 价格 = 1000000 },
    { 类别 = "道具", 名称 = "戒指", 价格 = 1000000 },
    { 类别 = "道具", 名称 = "千字文", 价格 = 1000000 },
    { 类别 = "道具", 名称 = "百年雪莲", 价格 = 1000000 },
    { 类别 = "道具", 名称 = "内功心法", 价格 = 1000000 },
    { 类别 = "道具", 名称 = "百年何首乌", 价格 = 1000000 },
    { 类别 = "道具", 名称 = "三字经", 价格 = 1000000 },
    { 类别 = "道具", 名称 = "仙童果", 价格 = 5000000 },
    { 类别 = "道具", 名称 = "孝经", 价格 = 5000000 },
    { 类别 = "道具", 名称 = "粗布衣", 价格 = 1 , 孩子装备 = true , 部位 = 3 },
    { 类别 = "道具", 名称 = "麻裙", 价格 = 1 , 孩子装备 = true , 部位 = 3 },
}

function 商店:取商品()
    return list
end

function 商店:购买(玩家, i, n)
    local 总价 = n * list[i].价格
    if 玩家.银子 >= 总价 then
        local t = 复制表(list[i])
        t.类别 = nil
        t.价格 = nil
        local 物品表 = {}
        local 第一 = 生成物品(t)
        if 第一.是否叠加 then
            第一.数量 = n
            table.insert(物品表, 第一)
        else
            for _ = 1, n do
                table.insert(物品表, 生成物品(t))
            end
        end
        if 玩家:添加物品_无提示(物品表) then
            玩家:扣除银子(总价)
            玩家:提示窗口('#Y你购买了%s个#G%s#Y,共花费%s银两。',  n,t.名称, 总价)
            return true
        else
            return '#Y空间不足'
        end

    else
        return '#Y你的银两不足，不能购买！'
    end
end

return 商店
