-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2023-08-26 02:04:28
-- @Last Modified time  : 2023-08-26 06:08:22

local 战斗 = {}

function 战斗:战斗初始化(玩家)
    local _技能 = {
        [1] = { {名称 = '借刀杀人' , 熟练度 = 25000} , {名称 = '失心狂乱' , 熟练度 = 25000} },
        [2] = { {名称 = '天诛地灭' , 熟练度 = 25000} },
        [3] = {{名称 = '吸星大法' , 熟练度 = 25000} }
    }
    local _怪物 = {
        [1] = {名称 = '娄金狗' , 外形 = 52 , 等级 = 10 , 血初值 = 13000 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 1500 , 技能 = {'互相拉血'} , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 10 , 抗火 = 10 , 抗鬼火 = 10 , 抗混乱 = 140 , 抗昏睡 = 120 , 抗封印 = 110 , 抗遗忘 = 120 , 抗震慑 = 20 , 物理吸收 = 30 , 抗致命几率 = 30 , 躲闪率 = 60} },
        [2] = {名称 = '昂日鸡' , 外形 = 53 , 等级 = 10 , 血初值 = 13000 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 1150 , 技能 = {'互相拉血'} , 抗性 = {抗风 = 20 , 抗雷 = 20 , 抗水 = 20 , 抗火 = 20 , 抗鬼火 = 20 , 抗混乱 = 110 , 抗昏睡 = 110 , 抗封印 = 100 , 抗遗忘 = 110 , 抗震慑 = 30 , 物理吸收 = 30 , 抗致命几率 = 30 , 躲闪率 = 60} },
        [3] = {名称 = '胃土雉' , 外形 = 62 , 等级 = 10 , 血初值 = 12000 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 500 , 技能 = {'天魔解体_AI'} , 施法几率 = 100 , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 10 , 抗火 = 10 , 抗鬼火 = 10 , 抗混乱 = 130 , 抗昏睡 = 100 , 抗封印 = 100 , 抗遗忘 = 100 , 抗震慑 = 45 , 物理吸收 = 30 , 抗致命几率 = 30 , 躲闪率 = 60} , 内丹 = { { 技能 = "天魔解体", 转生 = 3, 等级 = 140 } } },
        [4] = {名称 = '觜火猴' , 外形 = 50 , 等级 = 10 , 血初值 = 10500 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 1300 , 技能 = _技能[1] , 施法几率 = 100 , 抗性 = {抗混乱 = 130 , 抗昏睡 = 130 , 抗封印 = 130 , 抗遗忘 = 130 , 抗震慑 = 20 , 物理吸收 = 30 , 抗致命几率 = 30 , 躲闪率 = 60} },
        [5] = {名称 = '毕月鸟' , 外形 = 14 , 等级 = 10 , 血初值 = 6000 , 法初值 = 300 , 攻初值 = 3500 , 敏初值 = 900 , 技能 = _技能[2] , 施法几率 = 100 , 抗性 = {抗风 = 15 , 抗雷 = 15 , 抗水 = 15 , 抗火 = 15 , 抗鬼火 = 15 , 抗混乱 = 120 , 抗昏睡 = 110 , 抗封印 = 110 , 抗遗忘 = 80 , 抗震慑 = 25 , 物理吸收 = 30 , 抗致命几率 = 30 , 躲闪率 = 60 , 忽视抗雷 = 20 , 加强雷 = 20} },
        [6] = {名称 = '参水猿' , 外形 = 60 , 等级 = 10 , 血初值 = 13500 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 1000 , 技能 = _技能[3] , 施法几率 = 100 , 抗性 = {抗混乱 = 140 , 抗昏睡 = 120 , 抗封印 = 120 , 抗遗忘 = 120 , 抗震慑 = 15 , 物理吸收 = 30 , 抗致命几率 = 30 , 躲闪率 = 60} }
    }
    for i = 1, 6 do
        _怪物[i].等级 = 玩家.等级 + 20
        if _怪物[i].等级 < 100 then
            _怪物[i].等级 = 100
        end
        local r = 生成战斗怪物(生成怪物属性(_怪物[i] ))
        self:加入敌方(i, r)
    end
end

function 战斗:战斗回合开始(dt)
end

function 战斗:战斗结束(x, y)
end

return 战斗
