-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2023-08-26 02:04:28
-- @Last Modified time  : 2023-08-26 04:45:12

local 战斗 = {}

function 战斗:战斗初始化(玩家)
    local _技能 = {
        [1] = { {名称 = '龙卷雨击' , 熟练度 = 12000} , {名称 = '九龙冰封' , 熟练度 = 12000} , {名称 = '蛟龙出海' , 熟练度 = 12000} },
        [2] = { {名称 = '龙卷雨击' , 熟练度 = 20000} , {名称 = '九龙冰封' , 熟练度 = 20000} , {名称 = '蛟龙出海' , 熟练度 = 20000} }
    }
    local _怪物 = {
        [1] = {名称 = '水德星君' , 外形 = 44 , 等级 = 10 , 血初值 = 100000 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 10 , 技能 = {'互相拉血'} , 抗性 = {} },
        [2] = {名称 = '乌龟' , 外形 = 2064 , 等级 = 10 , 血初值 = 5600 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 300 , 技能 = _技能[1] , 施法几率 = 100 , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 30 , 抗火 = 10 , 抗混乱 = 90 , 抗昏睡 = 90 , 抗封印 = 70 , 抗遗忘 = 90 , 抗鬼火 = 10 , 抗震慑 = 10 , 物理吸收 = 30 } },
        [3] = {名称 = '乌龟' , 外形 = 2064 , 等级 = 10 , 血初值 = 5600 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 300 , 技能 = _技能[1] , 施法几率 = 100 , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 30 , 抗火 = 10 , 抗混乱 = 90 , 抗昏睡 = 90 , 抗封印 = 70 , 抗遗忘 = 90 , 抗鬼火 = 10 , 抗震慑 = 10 , 物理吸收 = 30 } },
        [4] = {名称 = '水灵仙' , 外形 = 2100 , 等级 = 10 , 血初值 = 6300 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 400 , 技能 = _技能[2] , 施法几率 = 100 , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 30 , 抗火 = 10 , 抗混乱 = 90 , 抗昏睡 = 90 , 抗封印 = 70 , 抗遗忘 = 90 , 抗鬼火 = 10 , 抗震慑 = 10 , 物理吸收 = 30 } },
        [5] = {名称 = '水灵仙' , 外形 = 2100 , 等级 = 10 , 血初值 = 6300 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 400 , 技能 = _技能[2] , 施法几率 = 100 , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 30 , 抗火 = 10 , 抗混乱 = 90 , 抗昏睡 = 90 , 抗封印 = 70 , 抗遗忘 = 90 , 抗鬼火 = 10 , 抗震慑 = 10 , 物理吸收 = 30 } },
        [6] = {名称 = '水灵仙' , 外形 = 2100 , 等级 = 10 , 血初值 = 6300 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 400 , 技能 = _技能[2] , 施法几率 = 100 , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 30 , 抗火 = 10 , 抗混乱 = 90 , 抗昏睡 = 90 , 抗封印 = 70 , 抗遗忘 = 90 , 抗鬼火 = 10 , 抗震慑 = 10 , 物理吸收 = 30 } },
        [7] = {名称 = '蛟龙' , 外形 = 2070 , 等级 = 10 , 血初值 = 7300 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 500 , 技能 = _技能[2] , 施法几率 = 100 , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 30 , 抗火 = 10 , 抗混乱 = 90 , 抗昏睡 = 90 , 抗封印 = 70 , 抗遗忘 = 90 , 抗鬼火 = 30 , 抗震慑 = 15 , 物理吸收 = 30 } },
        [8] = {名称 = '蛟龙' , 外形 = 2070 , 等级 = 10 , 血初值 = 7300 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 500 , 技能 = _技能[2] , 施法几率 = 100 , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 30 , 抗火 = 10 , 抗混乱 = 90 , 抗昏睡 = 90 , 抗封印 = 70 , 抗遗忘 = 90 , 抗鬼火 = 30 , 抗震慑 = 15 , 物理吸收 = 30 } },
        [9] = {名称 = '蛟龙' , 外形 = 2070 , 等级 = 10 , 血初值 = 7300 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 500 , 技能 = _技能[2] , 施法几率 = 100 , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 30 , 抗火 = 10 , 抗混乱 = 90 , 抗昏睡 = 90 , 抗封印 = 70 , 抗遗忘 = 90 , 抗鬼火 = 30 , 抗震慑 = 15 , 物理吸收 = 30 } },
        [10] = {名称 = '蛟龙' , 外形 = 2070 , 等级 = 10 , 血初值 = 7300 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 500 , 技能 = _技能[2] , 施法几率 = 100 , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 30 , 抗火 = 10 , 抗混乱 = 90 , 抗昏睡 = 90 , 抗封印 = 70 , 抗遗忘 = 90 , 抗鬼火 = 30 , 抗震慑 = 15 , 物理吸收 = 30 } },
    }
    for i = 1, 10 do
        _怪物[i].等级 = 玩家.等级 + 20
        if _怪物[i].等级 < 100 then
            _怪物[i].等级 = 100
        end
        local r = 生成战斗怪物(生成怪物属性(_怪物[i] ))
        self:加入敌方(i, r)
    end
end

function 战斗:战斗回合开始(dt)
end

function 战斗:战斗结束(x, y)
end

return 战斗
