-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2023-08-26 02:04:28
-- @Last Modified time  : 2023-08-27 22:03:10

local 战斗 = {}

function 战斗:战斗初始化(玩家)
    local _技能 = {
        { {名称 = '九龙冰封' , 熟练度 = 15000} },
        { {名称 = '阎罗追命' , 熟练度 = 15000} },
    }
    local _怪物 = {
        [1] = {名称 = '龟丞相' , 外形 = 2064 , 等级 = 10 , 血初值 = math.random(4500, 5500) , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 200 , 技能 = _技能[1] , 施法几率 = 100 , 抗性 = {} },
        [2] = {名称 = '水妖护法' , 外形 = 2069 , 等级 = 10 , 血初值 = math.random(3500, 4500) , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 150 , 技能 = _技能[2] , 施法几率 = 60 , 抗性 = {} },
        [3] = {名称 = '水妖护法' , 外形 = 2069 , 等级 = 10 , 血初值 = math.random(3500, 4500) , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 150 , 技能 = _技能[2] , 施法几率 = 60 , 抗性 = {} },
        [4] = {名称 = '虾兵' , 外形 = 2062 , 等级 = 10 , 血初值 = math.random(3200, 4000) , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 300 , 技能 = {} , 施法几率 = 60 , 抗性 = {} },
        [5] = {名称 = '虾兵' , 外形 = 2062 , 等级 = 10 , 血初值 = math.random(3200, 4000) , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 300 , 技能 = {} , 施法几率 = 60 , 抗性 = {} },
        [6] = {名称 = '蟹将' , 外形 = 2063 , 等级 = 10 , 血初值 = math.random(3200, 4000) , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 300 , 技能 = {} , 施法几率 = 60 , 抗性 = {} },
        [7] = {名称 = '蟹将' , 外形 = 2063 , 等级 = 10 , 血初值 = math.random(3200, 4000) , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 300 , 技能 = {} , 施法几率 = 60 , 抗性 = {} },
        [8] = {名称 = '鱼怪' , 外形 = 2094 , 等级 = 10 , 血初值 = math.random(3200, 4000) , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 300 , 技能 = {} , 施法几率 = 60 , 抗性 = {} },
        [9] = {名称 = '鱼怪' , 外形 = 2094 , 等级 = 10 , 血初值 = math.random(3200, 4000) , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 300 , 技能 = {} , 施法几率 = 60 , 抗性 = {} }
    }
    for i = 1, 9 do
        _怪物[i].等级 = 玩家.等级
        if _怪物[i].等级 < 80 then
            _怪物[i].等级 = 80
        end
        local r = {}
        if i == 1 then
            r = 生成战斗怪物( 生成怪物属性( _怪物[i] , '困难' ) )
        elseif i == 2 or i == 3 then
            r = 生成战斗怪物( 生成怪物属性( _怪物[i] , '中等' ) )
            r.抗性.抗震慑 = 66
        else
            r = 生成战斗怪物( 生成怪物属性( _怪物[i] , '困难' , nil , '中级法术' ) )
        end
        self:加入敌方(i, r)
    end
end

function 战斗:战斗回合开始(dt)
end

function 战斗:战斗结束(x, y)
end

return 战斗
