-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2023-08-26 02:04:28
-- @Last Modified time  : 2024-05-20 16:38:58

local 战斗 = {}

function 战斗:战斗初始化(玩家)
    local _技能 = {
        [1] = { {名称 = '借刀杀人' , 熟练度 = 25000} , {名称 = '失心狂乱' , 熟练度 = 20000} },
        [2] = { {名称 = '啮骨抽髓' , 熟练度 = 25000} , {名称 = '吸星大法' , 熟练度 = 25000} },
        [3] = {{名称 = '乾坤借速' , 熟练度 = 25000} , {名称 = '九阴纯火' , 熟练度 = 25000} },
        [4] = { {名称 = '阎罗追命' , 熟练度 = 25000} , {名称 = '含情脉脉' , 熟练度 = 25000} },
        [5] = {},
        [6] = { {名称 = '天诛地灭' , 熟练度 = 25000} },
        [7] = { {名称 = '九龙冰封' , 熟练度 = 25000} },
        [8] = { {名称 = '魔神附身' , 熟练度 = 25000} , {名称 = '袖里乾坤' , 熟练度 = 25000} }
    }
    local _怪物 = {
        [1] = {名称 = '李靖' , 外形 = 2122 , 等级 = 10 , 血初值 = 85000 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 600 , 技能 = _技能[1] , 施法几率 = 100 , 抗性 = {抗风 = 50 , 抗雷 = 50 , 抗水 = 15 , 抗火 = 15 , 抗鬼火 = 15 , 抗混乱 = 140 , 抗昏睡 = 300 , 抗封印 = 110 , 抗遗忘 = 120 , 抗震慑 = 20 , 物理吸收 = 30 , 抗致命几率 = 30 , 忽视抗混 = 10} },
        [2] = {名称 = '多闻天王' , 外形 = 2126 , 等级 = 10 , 血初值 = 14500 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 300 , 技能 = _技能[2] , 施法几率 = 100 , 抗性 = {抗鬼火 = 35 , 抗混乱 = 130 , 抗昏睡 = 300 , 抗封印 = 110 , 抗遗忘 = 130 , 抗震慑 = 30 , 物理吸收 = 10 , 抗致命几率 = 20 , 躲闪率 = 40 , 加强三尸虫回血程度 = 40} },
        [3] = {名称 = '哪吒' , 外形 = 3060 , 等级 = 10 , 血初值 = 36000 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 1300 , 技能 = _技能[3] , 施法几率 = 100 , 抗性 = {抗风 = 35 , 抗雷 = 35 , 抗水 = 35 , 抗火 = 35 , 抗鬼火 = 35 , 抗混乱 = 110 , 抗昏睡 = 300 , 抗封印 = 100 , 抗遗忘 = 100 , 抗震慑 = 10 , 物理吸收 = 30 , 抗致命几率 = 20 , 火系狂暴几率 = 30 , 忽视抗火 = 25 , 加强火 = 35} },
        [4] = {名称 = '飞天' , 外形 = 2150 , 等级 = 10 , 血初值 = 35000 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 1600 , 技能 = _技能[4] , 施法几率 = 100 , 抗性 = {抗风 = 50 , 抗雷 = 50 , 抗水 = 50 , 抗火 = 50 , 抗鬼火 = 20 , 抗混乱 = 110 , 抗昏睡 = 300 , 抗封印 = 100 , 抗遗忘 = 100 , 抗震慑 = 20 , 物理吸收 = 50 , 抗致命几率 = 30} },
        [5] = {名称 = '巨灵神' , 外形 = 2088 , 等级 = 10 , 血初值 = 35000 , 法初值 = 300 , 攻初值 = 3500 , 敏初值 = 200 , 技能 = _技能[5] , 抗性 = {抗风 = 50 , 抗雷 = 50 , 抗水 = 50 , 抗火 = 10 , 抗鬼火 = 10 , 抗混乱 = 110 , 抗昏睡 = 300 , 抗封印 = 100 , 抗震慑 = 30 , 物理吸收 = 20 , 抗致命几率 = 20 , 连击率 = 60 , 连击次数 = 5 , 致命几率 = 40 , 忽视防御几率 = 100 , 忽视防御程度 = 100} },
        [6] = {名称 = '五叶' , 外形 = 2111 , 等级 = 10 , 血初值 = 85000 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 900 , 技能 = _技能[6] , 施法几率 = 100 , 抗性 = {抗风 = 50 , 抗雷 = 50 , 抗水 = 50 , 抗火 = 50 , 抗鬼火 = 20 , 抗混乱 = 100 , 抗昏睡 = 300 , 抗封印 = 100 , 抗遗忘 = 100 , 抗震慑 = 10 , 物理吸收 = 30 , 抗致命几率 = 20} },
        [7] = {名称 = '垂云叟' , 外形 = 2112 , 等级 = 10 , 血初值 = 85000 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 250 , 技能 = _技能[7] , 施法几率 = 100 , 抗性 = {抗风 = 50 , 抗雷 = 50 , 抗水 = 50 , 抗火 = 50 , 抗鬼火 = 20 , 抗混乱 = 100 , 抗昏睡 = 300 , 抗封印 = 100 , 抗遗忘 = 100 , 抗震慑 = 10 , 物理吸收 = 30 , 抗致命几率 = 20} },
        [8] = {名称 = '年' , 外形 = 8095 , 等级 = 10 , 血初值 = 28000 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 2000 , 技能 = _技能[8] , 施法几率 = 100 , 抗性 = {抗风 = 50 , 抗雷 = 50 , 抗水 = 50 , 抗火 = 50 , 抗鬼火 = 20 , 抗混乱 = 100 , 抗昏睡 = 300 , 抗封印 = 100 , 抗遗忘 = 100 , 抗震慑 = 10 , 物理吸收 = 20 , 抗致命几率 = 20 , 连击率 = 100 , 连击次数 = 8 , 致命几率 = 40} },
        [9] = {名称 = '颜如玉' , 外形 = 2113 , 等级 = 10 , 血初值 = 25000 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 1100 , 技能 = _技能[1] , 施法几率 = 100 , 抗性 = {抗风 = 50 , 抗雷 = 50 , 抗水 = 50 , 抗火 = 10 , 抗鬼火 = 10 , 抗混乱 = 110 , 抗昏睡 = 300 , 抗封印 = 100 , 抗震慑 = 30 , 物理吸收 = 20 , 抗致命几率 = 20 , 连击率 = 100 , 连击次数 = 8 , 致命几率 = 40} },
        [10] = {名称 = '浪淘沙' , 外形 = 2114 , 等级 = 10 , 血初值 = 25000 , 法初值 = 300 , 攻初值 = 3500 , 敏初值 = 350 , 技能 = _技能[1] , 施法几率 = 100 , 抗性 = {抗风 = 50 , 抗雷 = 50 , 抗水 = 50 , 抗火 = 10 , 抗鬼火 = 10 , 抗混乱 = 110 , 抗昏睡 = 300 , 抗封印 = 100 , 抗震慑 = 30 , 物理吸收 = 20 , 抗致命几率 = 20 , 连击率 = 60 , 连击次数 = 5 , 致命几率 = 40 , 忽视防御几率 = 100 , 忽视防御程度 = 100} , 内丹 = { { 技能 = "隔山打牛", 转生 = 3, 等级 = 160 } } },
    }
    for i = 1, 10 do
        _怪物[i].等级 = 玩家.等级 + 20
        if _怪物[i].等级 < 100 then
            _怪物[i].等级 = 100
        end
        local r = 生成战斗怪物(生成怪物属性(_怪物[i] ))
        self:加入敌方(i, r)
    end
end

function 战斗:战斗回合开始(dt)
end

function 战斗:战斗结束(x, y)
end

return 战斗
