-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2023-08-26 02:04:28
-- @Last Modified time  : 2023-08-27 22:19:45

local 战斗 = {}

function 战斗:战斗初始化(玩家)
    local _技能 = {
        { {名称 = '九龙冰封' , 熟练度 = 25000} , {名称 = '天诛地灭' , 熟练度 = 25000} , {名称 = '袖里乾坤' , 熟练度 = 25000} },
        { {名称 = '阎罗追命' , 熟练度 = 25000} },
        { {名称 = '万毒攻心' , 熟练度 = 25000} },
        { {名称 = '失心狂乱' , 熟练度 = 25000} },
        { {名称 = '百日眠' , 熟练度 = 25000} },
        { {名称 = '吸星大法' , 熟练度 = 25000} },
    }
    local _怪物 = {
        [1] = {名称 = '龙王' , 外形 = 14 , 等级 = 10 , 血初值 = 17800 , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 900 , 技能 = _技能[1] , 施法几率 = 100 , 抗性 = {抗混乱 = 130 , 抗封印 = 110 , 抗昏睡 = 100 , 抗遗忘 = 100 , 抗风 = 35 , 抗雷 = 35 , 抗水 = 35 , 抗火 = 35 , 物理吸收 = 20 , 抗致命几率 = 25 , 忽视抗火 = 25 , 加强火 = 25 , 火系狂暴几率 = 30 , 忽视抗水 = 25 , 加强水 = 25 , 水系狂暴几率 = 30 , 忽视抗风 = 25 , 加强风 = 25 , 风系狂暴几率 = 30 , 忽视抗雷 = 25 , 加强雷 = 25 , 雷系狂暴几率 = 30} },
        [2] = {名称 = '大台子' , 外形 = 2287 , 等级 = 10 , 血初值 = 17800 , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 600 , 技能 = _技能[1] , 施法几率 = 100 , 抗性 = {抗混乱 = 130 , 抗封印 = 110 , 抗昏睡 = 100 , 抗遗忘 = 100 , 抗风 = 35 , 抗雷 = 35 , 抗水 = 35 , 抗火 = 35 , 物理吸收 = 20 , 抗致命几率 = 25 , 忽视抗火 = 25 , 加强火 = 25 , 火系狂暴几率 = 30 , 忽视抗水 = 25 , 加强水 = 25 , 水系狂暴几率 = 30 , 忽视抗风 = 25 , 加强风 = 25 , 风系狂暴几率 = 30 , 忽视抗雷 = 25 , 加强雷 = 25 , 雷系狂暴几率 = 30} },
        [3] = {名称 = '二台子' , 外形 = 2287 , 等级 = 10 , 血初值 = 17800 , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 700 , 技能 = _技能[1] , 施法几率 = 100 , 抗性 = {抗混乱 = 130 , 抗封印 = 110 , 抗昏睡 = 100 , 抗遗忘 = 100 , 抗风 = 35 , 抗雷 = 35 , 抗水 = 35 , 抗火 = 35 , 物理吸收 = 20 , 抗致命几率 = 25 , 忽视抗火 = 25 , 加强火 = 25 , 火系狂暴几率 = 30 , 忽视抗水 = 25 , 加强水 = 25 , 水系狂暴几率 = 30 , 忽视抗风 = 25 , 加强风 = 25 , 风系狂暴几率 = 30 , 忽视抗雷 = 25 , 加强雷 = 25 , 雷系狂暴几率 = 30} },
        [4] = {名称 = '精卫' , 外形 = 2169 , 等级 = 10 , 血初值 = 18000 , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 1400 , 技能 = _技能[2] , 施法几率 = 60 , 抗性 = {抗混乱 = 120 , 抗封印 = 120 , 抗昏睡 = 100 , 抗遗忘 = 100 , 抗风 = 25 , 抗雷 = 25 , 抗水 = 25 , 抗火 = 25 , 物理吸收 = 40 , 抗致命几率 = 25 } },
        [5] = {名称 = '精卫' , 外形 = 2169 , 等级 = 10 , 血初值 = 18000 , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 1500 , 技能 = _技能[2] , 施法几率 = 60 , 抗性 = {抗混乱 = 120 , 抗封印 = 120 , 抗昏睡 = 100 , 抗遗忘 = 100 , 抗风 = 25 , 抗雷 = 25 , 抗水 = 25 , 抗火 = 25 , 物理吸收 = 40 , 抗致命几率 = 25 } },
        [6] = {名称 = '精卫' , 外形 = 2169 , 等级 = 10 , 血初值 = 18000 , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 1000 , 技能 = _技能[2] , 施法几率 = 60 , 抗性 = {抗混乱 = 120 , 抗封印 = 120 , 抗昏睡 = 100 , 抗遗忘 = 100 , 抗风 = 25 , 抗雷 = 25 , 抗水 = 25 , 抗火 = 25 , 物理吸收 = 40 , 抗致命几率 = 25 } },
        [7] = {名称 = '龙女' , 外形 = 2128 , 等级 = 10 , 血初值 = 21000 , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 850 , 技能 = _技能[3] , 施法几率 = 100 , 抗性 = {抗混乱 = 140 , 抗封印 = 130 , 抗昏睡 = 110 , 抗遗忘 = 110 , 物理吸收 = 35 , 抗致命几率 = 25 , 反震率 = 65 , 反震程度 = 80 , 忽视抗混 = 15 } },
        [8] = {名称 = '龙女' , 外形 = 2128 , 等级 = 10 , 血初值 = 21000 , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 750 , 技能 = _技能[4] , 施法几率 = 100 , 抗性 = {抗混乱 = 140 , 抗封印 = 130 , 抗昏睡 = 110 , 抗遗忘 = 110 , 物理吸收 = 35 , 抗致命几率 = 25 , 反震率 = 65 , 反震程度 = 80 , 忽视抗混 = 15 } },
        [9] = {名称 = '龙女' , 外形 = 2128 , 等级 = 10 , 血初值 = 21000 , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 950 , 技能 = _技能[5] , 施法几率 = 100 , 抗性 = {抗混乱 = 140 , 抗封印 = 130 , 抗昏睡 = 110 , 抗遗忘 = 110 , 物理吸收 = 35 , 抗致命几率 = 25 , 反震率 = 65 , 反震程度 = 80 , 忽视抗睡 = 15 } },
        [9] = {名称 = '狮蝎' , 外形 = 2106 , 等级 = 10 , 血初值 = 30000 , 法初值 = 300 , 攻初值 = 400 , 敏初值 = -300 , 技能 = _技能[6] , 施法几率 = 100 , 抗性 = {抗风 = -20 , 抗雷 = -20 , 抗水 = -20 , 抗火 = -20 , 抗封印 = 130 , 抗昏睡 = 110 , 抗遗忘 = 110 , 物理吸收 = 15 , 抗致命几率 = 25 , 躲闪率 = 60 , 加强三尸虫回血程度 = 15} }
    }
    for i = 1, 9 do
        _怪物[i].等级 = 玩家.等级 + 20
        if _怪物[i].等级 < 110 then
            _怪物[i].等级 = 110
        end
        local r = 生成战斗怪物( 生成怪物属性( _怪物[i] ) )
        self:加入敌方(i, r)
    end
end

function 战斗:战斗回合开始(dt)
end

function 战斗:战斗结束(x, y)
end

return 战斗
