-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2023-08-26 02:04:28
-- @Last Modified time  : 2023-08-27 04:57:11

local 战斗 = {}

function 战斗:战斗初始化(玩家)
    local _技能 = { {名称 = '袖里乾坤' , 熟练度 = 10000} , {名称 = '九阴纯火' , 熟练度 = 10000} , {名称 = '天诛地灭' , 熟练度 = 10000} , {名称 = '九龙冰封' , 熟练度 = 10000} }
    local _怪物 = {
        [1] = {名称 = '胡敬德' , 外形 = 2077 , 等级 = 10 , 血初值 = 15800 , 法初值 = 300 , 攻初值 = 100 , 敏初值 = 700 , 技能 = { {名称 = '借刀杀人' , 熟练度 = 15000} , {名称 = '失心狂乱' , 熟练度 = 15000} } , 施法几率 = 100 , 抗性 = {抗混乱 = 120 , 抗昏睡 = 100 , 抗封印 = 100 , 抗遗忘 = 80 , 抗震慑 = 30 , 物理吸收 = 50 , 抗致命几率 = 25 , 忽视抗混 = 15 } },
        [2] = {名称 = '打手' , 外形 = 2109 , 等级 = 10 , 血初值 = 14100 , 法初值 = 300 , 攻初值 = 2000 , 敏初值 = 1100 , 技能 = {} , 抗性 = { 抗风 = 15 , 抗雷 = 15 , 抗水 = 15 , 抗火 = 15 ,  抗混乱 = 100 , 抗昏睡 = 90 , 抗封印 = 90 , 抗遗忘 = 80 , 抗震慑 = 15 , 物理吸收 = 30 , 连击率 = 70 , 狂暴几率 = 40 , 致命几率 = 40 , 连击次数 = 5 , 忽视防御几率 = 80 , 忽视防御程度 = 100 , 抗致命几率 = 25 } , 内丹 = {{ 技能 = "隔山打牛", 转生 = 3, 等级 = 160 }} },
        [3] = {名称 = '夏鹏展' , 外形 = 2087 , 等级 = 10 , 血初值 = 15180 , 法初值 = 300 , 攻初值 = 100 , 敏初值 = 800 , 技能 = { {名称 = '阎罗追命' , 熟练度 = 9000} , {名称 = '魔音摄心' , 熟练度 = 9000} } , 施法几率 = 80 , 抗性 = { 抗风 = 35 , 抗雷 = 35 , 抗水 = 35 , 抗火 = 35 , 抗混乱 = 110 , 抗昏睡 = 90 , 抗封印 = 90 , 抗遗忘 = 90 , 抗震慑 = 15} },
        [4] = {名称 = '夏鹏展' , 外形 = 2087 , 等级 = 10 , 血初值 = 14180 , 法初值 = 300 , 攻初值 = 100 , 敏初值 = 800 , 技能 = { {名称 = '阎罗追命' , 熟练度 = 9000} , {名称 = '魔音摄心' , 熟练度 = 9000} } , 施法几率 = 80 , 抗性 = { 抗风 = 35 , 抗雷 = 35 , 抗水 = 35 , 抗火 = 35 , 抗混乱 = 110 , 抗昏睡 = 90 , 抗封印 = 90 , 抗遗忘 = 90 , 抗震慑 = 15} },
        [5] = {名称 = '花忍' , 外形 = 2096 , 等级 = 10 , 血初值 = 15000 , 法初值 = 300 , 攻初值 = 100 , 敏初值 = 700 , 技能 = _技能[1] , 施法几率 = 80 , 抗性 = { 抗风 = 15 , 抗雷 = 15 , 抗水 = 15 , 抗火 = 15 , 抗混乱 = 100 , 抗昏睡 = 90 , 抗封印 = 90 , 抗遗忘 = 80 , 抗震慑 = 10 , 物理吸收率 = 60 , 抗致命几率 = 25} },
        [6] = {名称 = '打手' , 外形 = 2109 , 等级 = 10 , 血初值 = 15000 , 法初值 = 300 , 攻初值 = 2000 , 敏初值 = 1100 , 技能 = {} , 抗性 = { 抗风 = 15 , 抗雷 = 15 , 抗水 = 15 , 抗火 = 15 ,  抗混乱 = 100 , 抗昏睡 = 90 , 抗封印 = 90 , 抗遗忘 = 80 , 抗震慑 = 15 , 物理吸收 = 30 , 连击率 = 70 , 狂暴几率 = 40 , 致命几率 = 40 , 连击次数 = 5 , 忽视防御几率 = 80 , 忽视防御程度 = 100 , 抗致命几率 = 25 } , 内丹 = {{ 技能 = "隔山打牛", 转生 = 3, 等级 = 160 }} },
        [7] = {名称 = '花忍' , 外形 = 2096 , 等级 = 10 , 血初值 = 13800 , 法初值 = 300 , 攻初值 = 100 , 敏初值 = 900 , 技能 = _技能[1] , 施法几率 = 80 , 抗性 = { 抗风 = 15 , 抗雷 = 15 , 抗水 = 15 , 抗火 = 15 , 抗混乱 = 100 , 抗昏睡 = 90 , 抗封印 = 90 , 抗遗忘 = 80 , 抗震慑 = 10 , 物理吸收率 = 60 , 抗致命几率 = 25} },
    }
    for i = 1, 7 do
        _怪物[i].等级 = 玩家.等级 + 20
        if _怪物[i].等级 < 100 then
            _怪物[i].等级 = 100
        end
        local r = 生成战斗怪物( 生成怪物属性( _怪物[i] ) )
        self:加入敌方(i, r)
    end
end

function 战斗:战斗回合开始(dt)
end

function 战斗:战斗结束(x, y)
end

return 战斗
