-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2023-08-26 02:04:28
-- @Last Modified time  : 2023-08-25 07:08:41

local 战斗 = {}

function 战斗:战斗初始化(玩家)
    local _技能 = { {名称 = '袖里乾坤' , 熟练度 = 20000} , {名称 = '九阴纯火' , 熟练度 = 20000} , {名称 = '天诛地灭' , 熟练度 = 20000} , {名称 = '九龙冰封' , 熟练度 = 20000} , {名称 = '阎罗追命' , 熟练度 = 20000} }
    local _怪物 = {
        [1] = {名称 = '秦琼' , 外形 = 2082 , 等级 = 10 , 血初值 = 14000 , 法初值 = 300 , 攻初值 = 1600 , 敏初值 = 500 , 技能 = {} , 抗性 = { 抗混乱 = 110 , 抗昏睡 = 100 , 抗封印 = 100 , 抗遗忘 = 80 , 抗震慑 = 30 , 物理吸收 = 30 , 连击率 = 70 , 狂暴几率 = 40 , 致命几率 = 40 , 连击次数 = 5 , 忽视防御几率 = 80 , 忽视防御程度 = 100 , 抗致命几率 = 25} },
        [2] = {名称 = '秦琼的跟班' , 外形 = 2203 , 等级 = 10 , 血初值 = 20000 , 法初值 = 300 , 攻初值 = 100 , 敏初值 = 1100 , 技能 = {{名称 = '落日熔金' , 熟练度 = 15000}} , 施法几率 = 80 , 抗性 = { 抗风 = 40 , 抗雷 = 40 , 抗水 = 40 , 抗火 = 40 , 抗混乱 = 80 , 抗震慑 = 30 , 忽视抗鬼火 = 50 , 加强鬼火 = 50 , 鬼火狂暴几率 = 60 } },
        [3] = {名称 = '秦琼的跟班' , 外形 = 2203 , 等级 = 10 , 血初值 = 20000 , 法初值 = 300 , 攻初值 = 100 , 敏初值 = 1100 , 技能 = {{名称 = '失心疯' , 熟练度 = 15000}} , 施法几率 = 80 , 抗性 = { 抗风 = 40 , 抗雷 = 40 , 抗水 = 40 , 抗火 = 40 , 抗混乱 = 80 , 抗震慑 = 30 , 加强遗忘 = 15 , 忽视抗遗忘 = 10 } }
    }
    for i = 1, 3 do
        _怪物[i].等级 = 玩家.等级 + 20
        if _怪物[i].等级 < 100 then
            _怪物[i].等级 = 100
        end
        local r = 生成战斗怪物( 生成怪物属性( _怪物[i] ) )
        self:加入敌方(i, r)
    end
end

function 战斗:战斗回合开始(dt)
end

function 战斗:战斗结束(x, y)
end

return 战斗
