-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2023-08-26 02:04:28
-- @Last Modified time  : 2023-08-27 05:52:08

local 战斗 = {}

function 战斗:战斗初始化(玩家)
    local _技能 = {
        { {名称 = '天诛地灭' , 熟练度 = 25000} },
        { {名称 = '借刀杀人' , 熟练度 = 25000} },
        { {名称 = '血海深仇' , 熟练度 = 25000} , {名称 = '天诛地灭' , 熟练度 = 25000} },
        { {名称 = '迷魂醉' , 熟练度 = 25000} },
        { {名称 = '血海深仇' , 熟练度 = 25000} , {名称 = '吸星大法' , 熟练度 = 25000} },
        { {名称 = '烈火骄阳' , 熟练度 = 25000} },
        { {名称 = '血海深仇' , 熟练度 = 25000} , {名称 = '吸星大法' , 熟练度 = 25000} },
        { {名称 = '含情脉脉' , 熟练度 = 25000} , {名称 = '阎罗追命' , 熟练度 = 25000} },
        { {名称 = '失心狂乱' , 熟练度 = 25000} },
        { {名称 = '乾坤借速' , 熟练度 = 25000} , {名称 = '阎罗追命' , 熟练度 = 25000} },
    }
    local _怪物 = {
        [1] = {名称 = '长孙无忌' , 外形 = 50 , 等级 = 10 , 血初值 = 30000 , 法初值 = 300 , 攻初值 = 1600 , 敏初值 = 1300 , 技能 = _技能[1] , 施法几率 = 100 , 抗性 = {} },
        [2] = {名称 = '云里雾' , 外形 = 2367 , 等级 = 10 , 血初值 = 25500 , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 700 , 技能 = _技能[2] , 施法几率 = 100 , 抗性 = {} },
        [3] = {名称 = '雾里云' , 外形 = 2109 , 等级 = 10 , 血初值 = 22500 , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 550 , 技能 = _技能[3] , 施法几率 = 100 , 抗性 = {} },
        [4] = {名称 = '云里雾' , 外形 = 2367 , 等级 = 10 , 血初值 = 25500 , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 400 , 技能 = _技能[4] , 施法几率 = 100 , 抗性 = {} },
        [5] = {名称 = '雾里云' , 外形 = 2109 , 等级 = 10 , 血初值 = 22500 , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 600 , 技能 = _技能[5] , 施法几率 = 100 , 抗性 = {} },
        [6] = {名称 = '赤身鬼使' , 外形 = 2176 , 等级 = 10 , 血初值 = 28500 , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 800 , 技能 = _技能[6] , 施法几率 = 100 , 抗性 = {} },
        [7] = {名称 = '雾里云' , 外形 = 2109 , 等级 = 10 , 血初值 = 22500 , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 700 , 技能 = _技能[7] , 施法几率 = 100 , 抗性 = {} },
        [8] = {名称 = '云里雾' , 外形 = 2367 , 等级 = 10 , 血初值 = 25500 , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 600 , 技能 = _技能[8] , 施法几率 = 100 , 抗性 = {} },
        [9] = {名称 = '小精灵' , 外形 = 2351 , 等级 = 10 , 血初值 = 1 , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 1100 , 技能 = _技能[9] , 施法几率 = 100 , 抗性 = {} },
        [10] = {名称 = '云里雾' , 外形 = 2367 , 等级 = 10 , 血初值 = 25500 , 法初值 = 300 , 攻初值 = 400 , 敏初值 = 550 , 技能 = _技能[10] , 施法几率 = 100 , 抗性 = {} }
    }
    for i = 1, 10 do
        _怪物[i].等级 = 玩家.等级 + 20
        if _怪物[i].等级 < 100 then
            _怪物[i].等级 = 100
        end
        local r = 生成战斗怪物( 生成怪物属性( _怪物[i] , '炼狱' ) )
        self:加入敌方(i, r)
    end
end

function 战斗:战斗回合开始(dt)
end

function 战斗:战斗结束(x, y)
end

return 战斗
