-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2023-08-26 02:04:28
-- @Last Modified time  : 2023-08-26 02:25:43

local 战斗 = {}

function 战斗:战斗初始化(玩家)
    local _技能 = { {名称 = '袖里乾坤' , 熟练度 = 20000} , {名称 = '九阴纯火' , 熟练度 = 20000} , {名称 = '天诛地灭' , 熟练度 = 20000} , {名称 = '九龙冰封' , 熟练度 = 20000} , {名称 = '阎罗追命' , 熟练度 = 20000} }
    local _怪物 = {
        [1] = {名称 = '奎木狼' , 外形 = 42 , 等级 = 10 , 血初值 = 9800 , 法初值 = 300 , 攻初值 = 500 , 敏初值 = 260 , 技能 = _技能 , 抗性 = { 反击率 = 80 , 反击次数 = 6 , 躲闪率 = 35} , 施法几率 = 100 },
        [2] = {名称 = '奎宿死卫' , 外形 = 2130 , 等级 = 10 , 血初值 = 3200 , 法初值 = 300 , 攻初值 = 300 , 敏初值 = 200 , 技能 = {} , 抗性 = {} },
        [3] = {名称 = '奎宿死卫' , 外形 = 2130 , 等级 = 10 , 血初值 = 3200 , 法初值 = 300 , 攻初值 = 300 , 敏初值 = 200 , 技能 = {} , 抗性 = {} }
    }
    for i = 1, 3 do
        _怪物[i].等级 = 玩家.等级 + 20
        if _怪物[i].等级 < 100 then
            _怪物[i].等级 = 100
        end
        local r = {}
        if i == 1 then
            r = 生成战斗怪物(生成怪物属性(_怪物[i] , '地狱'))
        else
            r = 生成战斗怪物(生成怪物属性(_怪物[i] , '困难' , nil , '高级法术'))
        end
        self:加入敌方(i, r)
    end
end

function 战斗:战斗回合开始(dt)
end

function 战斗:战斗结束(x, y)
end

return 战斗
