-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2023-08-26 02:04:28
-- @Last Modified time  : 2023-08-27 05:50:34

local 战斗 = {}

function 战斗:战斗初始化(玩家)
    local _技能 = {
        {{名称 = '含情脉脉' , 熟练度 = 15000} , {名称 = '借刀杀人' , 熟练度 = 15000} , {名称 = '天诛地灭' , 熟练度 = 15000} },
        {{名称 = '阎罗追命' , 熟练度 = 15000} , {名称 = '天诛地灭' , 熟练度 = 15000} },
    }
    local _怪物 = {
        [1] = {名称 = '房玄龄' , 外形 = 1 , 等级 = 10 , 血初值 = 14000 , 法初值 = 300 , 攻初值 = 100 , 敏初值 = 700 , 技能 = _技能[1] , 施法几率 = 100 , 抗性 = { 抗风 = 25 , 抗雷 = 25 , 抗水 = 25 , 抗火 = 25 , 抗鬼火 = 25 , 抗混乱 = 130 , 抗昏睡 = 110 , 抗封印 = 100 , 抗遗忘 = 100 , 抗震慑 = 25 , 物理吸收 = 40 , 抗致命几率 = 25 } },
        [2] = {名称 = '房遗直' , 外形 = 2 , 等级 = 10 , 血初值 = 11000 , 法初值 = 300 , 攻初值 = 1500 , 敏初值 = 900 , 技能 = {} , 抗性 = { 抗风 = 30 , 抗雷 = 30 , 抗水 = 30 , 抗火 = 30 , 抗鬼火 = 30 , 抗混乱 = 110 , 抗昏睡 = 100 , 抗封印 = 100 , 抗遗忘 = 80 , 抗震慑 = 15 , 物理吸收 = 20 , 连击率 = 60 , 狂暴几率 = 40 , 致命几率 = 40 , 连击次数 = 5 , 忽视防御几率 = 80 , 忽视防御程度 = 80 , 抗致命几率 = 25 , 反击率 = 40 , 反击次数 = 4 } },
        [3] = {名称 = '房遗直' , 外形 = 2 , 等级 = 10 , 血初值 = 12000 , 法初值 = 300 , 攻初值 = 1500 , 敏初值 = 900 , 技能 = {} , 抗性 = { 抗风 = 30 , 抗雷 = 30 , 抗水 = 30 , 抗火 = 30 , 抗鬼火 = 30 , 抗混乱 = 110 , 抗昏睡 = 100 , 抗封印 = 100 , 抗遗忘 = 80 , 抗震慑 = 15 , 物理吸收 = 20 , 连击率 = 60 , 狂暴几率 = 40 , 致命几率 = 40 , 连击次数 = 5 , 忽视防御几率 = 80 , 忽视防御程度 = 80 , 抗致命几率 = 25 , 反击率 = 40 , 反击次数 = 4 } },
        [4] = {名称 = '房遗爱' , 外形 = 1 , 等级 = 10 , 血初值 = 11000 , 法初值 = 300 , 攻初值 = 100 , 敏初值 = 1100 , 技能 = _技能[2] , 施法几率 = 100 , 抗性 = { 抗风 = 10 , 抗雷 = 10 , 抗水 = 10 , 抗火 = 10 , 抗混乱 = 120 , 抗昏睡 = 100 , 抗封印 = 100 , 抗遗忘 = 80 , 抗震慑 = 20 , 物理吸收率 = 20 , 抗致命几率 = 20 } },
        [5] = {名称 = '房遗爱' , 外形 = 1 , 等级 = 10 , 血初值 = 8000 , 法初值 = 300 , 攻初值 = 100 , 敏初值 = 1100 , 技能 = _技能[2] , 施法几率 = 100 , 抗性 = { 抗风 = 10 , 抗雷 = 10 , 抗水 = 10 , 抗火 = 10 , 抗混乱 = 120 , 抗昏睡 = 100 , 抗封印 = 100 , 抗遗忘 = 80 , 抗震慑 = 20 , 物理吸收率 = 20 , 抗致命几率 = 20 } },
        [6] = {名称 = '房遗则' , 外形 = 2 , 等级 = 10 , 血初值 = 1 , 法初值 = 300 , 攻初值 = 1 , 敏初值 = 100 , 技能 = { {名称 = '金蛇缠丝' , 熟练度 = 30000} } , 施法几率 = 100 , 抗性 = { 抗风 = 300 , 抗雷 = 300 , 抗水 = 300 , 抗火 = 300 , 抗鬼火 = 300 ,  抗混乱 = 300 , 抗昏睡 = 300 , 抗封印 = 300 , 抗遗忘 = 300 , 抗毒伤害 = 99999999 , 物理吸收 = 300 , 抗致命几率 = 300 } },
        [7] = {名称 = '房遗则' , 外形 = 2 , 等级 = 10 , 血初值 = 1 , 法初值 = 300 , 攻初值 = 1 , 敏初值 = 100 , 技能 = { {名称 = '金蛇缠丝' , 熟练度 = 30000} } , 施法几率 = 100 , 抗性 = { 抗风 = 300 , 抗雷 = 300 , 抗水 = 300 , 抗火 = 300 , 抗鬼火 = 300 ,  抗混乱 = 300 , 抗昏睡 = 300 , 抗封印 = 300 , 抗遗忘 = 300 , 抗毒伤害 = 99999999 , 物理吸收 = 300 , 抗致命几率 = 300 } },
    }
    for i = 1, 7 do
        _怪物[i].等级 = 玩家.等级 + 20
        if _怪物[i].等级 < 100 then
            _怪物[i].等级 = 100
        end
        local r = 生成战斗怪物( 生成怪物属性( _怪物[i] ) )
        self:加入敌方(i, r)
    end
end

function 战斗:战斗回合开始(dt)
end

function 战斗:战斗结束(x, y)
end

return 战斗
