-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-26 07:12:31
-- @Last Modified time  : 2024-08-24 21:25:41

local 战斗 = {
    是否惩罚 = true
}

local _野怪 = {
    [1213] = {
        { 名称 = "小五叶", 外形 = 2111, 血初值 = 600, 法初值 = 0, 攻初值 = 10, 敏初值 = 720, 成长 = 0.612, 技能 = {} ,等级 = 1, 不可捕捉 = true },
    },--珊瑚海岛
    [1214] = {
            { 名称 = "小罗刹鬼姬", 外形 = 2107, 血初值 = 62, 法初值 = 360, 攻初值 = 12, 敏初值 = 0, 成长 = 1.275, 技能 = {"龙卷雨击", "龙腾水溅", "龙啸九天", "蛟龙出海", } ,等级 = 3, 不可捕捉 = true },
    },--珊瑚山洞１层
    [1215] = {
            { 名称 = "小雷兽", 外形 = 2108, 血初值 = 102, 法初值 = 199, 攻初值 = 12, 敏初值 = -120, 成长 = 1.275, 技能 = {"雷霆霹雳", "日照光华", "雷神怒击", "电闪雷鸣", } ,等级 = 4, 不可捕捉 = true },
    },--珊瑚山洞２层
    [1216] = {
            { 名称 = "小剑精灵", 外形 = 2109, 血初值 = 60, 法初值 = 120, 攻初值 = 12, 敏初值 = 120, 成长 = 1.275, 技能 = {"魔之飞步", "急速之魔", "魔神飞舞", "天外飞魔", } ,等级 = 7, 不可捕捉 = true },
    },--珊瑚山洞３层
    [1466] = {
        { 名称 = "小罗刹鬼姬", 外形 = 2107, 血初值 = 62, 法初值 = 360, 攻初值 = 12, 敏初值 = 0, 成长 = 1.275, 技能 = {"龙卷雨击", "龙腾水溅", "龙啸九天", "蛟龙出海", } ,等级 = 3, 不可捕捉 = true },
        { 名称 = "小雷兽", 外形 = 2108, 血初值 = 102, 法初值 = 199, 攻初值 = 12, 敏初值 = -120, 成长 = 1.275, 技能 = {"雷霆霹雳", "日照光华", "雷神怒击", "电闪雷鸣", } ,等级 = 4, 不可捕捉 = true },
        { 名称 = "小剑精灵", 外形 = 2109, 血初值 = 60, 法初值 = 120, 攻初值 = 12, 敏初值 = 120, 成长 = 1.275, 技能 = {"魔之飞步", "急速之魔", "魔神飞舞", "天外飞魔", } ,等级 = 7, 不可捕捉 = true },
    },--地下鬼岛
    [1193] = {
        { 名称 = "小哥俩好", 外形 = 2110, 血初值 = 120, 法初值 = 0, 攻初值 = 180, 敏初值 = 48, 成长 = 1.275, 技能 = {} ,等级 = 6, 不可捕捉 = true },
        { 名称 = "小狮蝎", 外形 = 2106, 血初值 = 46, 法初值 = 156, 攻初值 = 120, 敏初值 = 12, 成长 = 1.275, 技能 = {"地狱烈火", "天雷怒火", "三味真火", "烈火骄阳", } ,等级 = 9, 不可捕捉 = true },
    },--长安城东
    [1110] = {
        { 名称 = "家丁", 外形 = 2047, 血初值 = 120, 法初值 = 0, 攻初值 = 84, 敏初值 = 6, 成长 = 1.035, 技能 = {} ,等级 = 11 },
        { 名称 = "武士", 外形 = 2043, 血初值 = 120, 法初值 = 0, 攻初值 = 132, 敏初值 = 12, 成长 = 1.045, 技能 = {} ,等级 = 13 },
        { 名称 = "士兵", 外形 = 2048, 血初值 = 120, 法初值 = 0, 攻初值 = 120, 敏初值 = 6, 成长 = 1.06, 技能 = {} ,等级 = 15 },
        { 名称 = "衙役", 外形 = 2078, 血初值 = 108, 法初值 = 0, 攻初值 = 108, 敏初值 = 12, 成长 = 1.05, 技能 = {} , 等级 = 16 },
    },--大唐境内
    [1004] = {
        { 名称 = "兔妖", 外形 = 2001, 血初值 = 108, 法初值 = 0, 攻初值 = 84, 敏初值 = 12, 成长 = 1.04, 技能 = {}, 等级 = 12 },
        { 名称 = "羊头怪", 外形 = 2007, 血初值 = 90, 法初值 = 0, 攻初值 = 78, 敏初值 = 6, 成长 = 1.034, 技能 = {}, 等级 = 13 },
    },--大雁塔一层
    [1005] = {
            { 名称 = "猪怪", 外形 = 2002, 血初值 = 102, 法初值 = 0, 攻初值 = 72, 敏初值 = 0, 成长 = 1.037, 技能 = {}, 等级 = 16 },
            { 名称 = "夜叉", 外形 = 2072, 血初值 = 108, 法初值 = 96, 攻初值 = 60, 敏初值 = 12, 成长 = 1.037, 技能 = {"地狱烈火", "天雷怒火", "三味真火", "烈火骄阳"}, 等级 = 17 },
    },--大雁塔二层
    [1006] = {
            { 名称 = "小妖", 外形 = 2004, 血初值 = 108, 法初值 = 0, 攻初值 = 108, 敏初值 = 6, 成长 = 1.04, 技能 = {}, 等级 = 19 },
            { 名称 = "牛妖", 外形 = 2066, 血初值 = 120, 法初值 = 0, 攻初值 = 114, 敏初值 = 12, 成长 = 1.044, 技能 = {}, 等级 = 21 },
    },--大雁塔三层
    [1007] = {
            { 名称 = "花妖", 外形 = 2012, 血初值 = 120, 法初值 = 0, 攻初值 = 108, 敏初值 = 12, 成长 = 1.058, 技能 = {}, 等级 = 23 },
            { 名称 = "狐狸精", 外形 = 2059, 血初值 = 120, 法初值 = 0, 攻初值 = 132, 敏初值 = 24, 成长 = 1.071, 技能 = {}, 等级 = 24 },
    },--大雁塔四层
    [1008] = {
            { 名称 = "女妖", 外形 = 2009, 血初值 = 120, 法初值 = 0, 攻初值 = 120, 敏初值 = 12, 成长 = 1.055, 技能 = {}, 等级 = 25 },
            { 名称 = "小龙女", 外形 = 2009, 血初值 = 84, 法初值 = 96, 攻初值 = 84, 敏初值 = 36, 成长 = 1.06, 技能 = {"龙卷雨击", "龙腾水溅", "龙啸九天", "蛟龙出海"}, 等级 = 26 },
    },--大雁塔五层
    [1090] = {
            { 名称 = "骷髅怪", 外形 = 2017, 血初值 = 84, 法初值 = 0, 攻初值 = 144, 敏初值 = 24, 成长 = 1.05, 技能 = {}, 等级 = 28 },
            { 名称 = "千年老妖", 外形 = 2073, 血初值 = 144, 法初值 = 96, 攻初值 = 42, 敏初值 = 0, 成长 = 1.142, 技能 = {"飞砂走石", "乘风破浪", "太乙生风", "风雷涌动", }, 等级 = 29 },
            { 名称 = "战神女娲", 外形 = 2289, 血初值 = 84, 法初值 = 84, 攻初值 = 84, 敏初值 = 72, 成长 = 1.173, 技能 = {"雷霆霹雳", "日照光华", "雷神怒击", "电闪雷鸣", }, 等级 = 30 },
    },--大雁塔六层
    [1194] = {
        { 名称 = "流氓", 外形 = 2046, 血初值 = 132, 法初值 = 0, 攻初值 = 102, 敏初值 = 12, 成长 = 1.042, 技能 = {}, 等级 = 13 },
        { 名称 = "女贼", 外形 = 2020, 血初值 = 108, 法初值 = 0, 攻初值 = 96, 敏初值 = 30, 成长 = 1.065, 技能 = {}, 等级 = 16 },
        { 名称 = "山贼", 外形 = 2045, 血初值 = 120, 法初值 = 0, 攻初值 = 144, 敏初值 = 12, 成长 = 1.045, 技能 = {}, 等级 = 19 },
    },--五指山
    [1203] = {
        { 名称 = "强盗", 外形 = 2044, 血初值 = 120, 法初值 = 0, 攻初值 = 96, 敏初值 = 24, 成长 = 1.06, 技能 = {}, 等级 = 30 },
        { 名称 = "打手", 外形 = 2087, 血初值 = 108, 法初值 = 0, 攻初值 = 156, 敏初值 = 24, 成长 = 1.071, 技能 = {}, 等级 = 35 },
    },--斧头帮
    [1173] = {
        { 名称 = "野狗", 外形 = 2034, 血初值 = 84, 法初值 = 0, 攻初值 = 90, 敏初值 = 30, 成长 = 1.041, 技能 = {}, 等级 = 22 },
        { 名称 = "毒蜂", 外形 = 2033, 血初值 = 72, 法初值 = 0, 攻初值 = 144, 敏初值 = 60, 成长 = 1.05, 技能 = {}, 等级 = 25 },
        { 名称 = "鸡精", 外形 = 2003, 血初值 = 96, 法初值 = 0, 攻初值 = 120, 敏初值 = 30, 成长 = 1.05, 技能 = {}, 等级 = 28 },
        { 名称 = "鳄鱼", 外形 = 2042, 血初值 = 144, 法初值 = 0, 攻初值 = 120, 敏初值 = 18, 成长 = 1.071, 技能 = {}, 等级 = 30 },
        { 名称 = "银狐", 外形 = 2039, 血初值 = 96, 法初值 = 0, 攻初值 = 114, 敏初值 = 36, 成长 = 1.065, 技能 = {}, 等级 = 31 },
        { 名称 = "老虎", 外形 = 2028, 血初值 = 120, 法初值 = 0, 攻初值 = 120, 敏初值 = 24, 成长 = 1.081, 技能 = {}, 等级 = 34 },
        { 名称 = "狮子", 外形 = 2084, 血初值 = 120, 法初值 = 0, 攻初值 = 114, 敏初值 = 18, 成长 = 1.06, 技能 = {}, 等级 = 30 },
        { 名称 = "大象", 外形 = 2085, 血初值 = 168, 法初值 = 0, 攻初值 = 108, 敏初值 = -30, 成长 = 1.091, 技能 = {}, 等级 = 30 },
        { 名称 = "大鹏", 外形 = 2086, 血初值 = 96, 法初值 = 0, 攻初值 = 138, 敏初值 = 60, 成长 = 1.06, 技能 = {}, 等级 = 30 },
    },--大唐边境
    [1091] = {
        { 名称 = "黑熊", 外形 = 2029, 血初值 = 132, 法初值 = 0, 攻初值 = 120, 敏初值 = -24, 成长 = 1.071, 技能 = {}, 等级 = 37 },
        { 名称 = "鳄鱼", 外形 = 2042, 血初值 = 144, 法初值 = 0, 攻初值 = 120, 敏初值 = 18, 成长 = 1.071, 技能 = {}, 等级 = 38 },
    },--长寿村外
    [1092] = {
        { 名称 = "树妖", 外形 = 2010, 血初值 = 144, 法初值 = 0, 攻初值 = 96, 敏初值 = 0, 成长 = 1.076, 技能 = {}, 等级 = 37 },
        { 名称 = "蛤蟆精", 外形 = 2022, 血初值 = 132, 法初值 = 0, 攻初值 = 102, 敏初值 = -12, 成长 = 1.086, 技能 = {}, 等级 = 40 },
    },--傲来国
    [1118] = {
        { 名称 = "虾兵", 外形 = 2062, 血初值 = 156, 法初值 = 0, 攻初值 = 108, 敏初值 = 12, 成长 = 1.071, 技能 = {}, 等级 = 42 },
    },--海底迷宫1
    [1119] = {
        { 名称 = "蟹将", 外形 = 2063, 血初值 = 144, 法初值 = 0, 攻初值 = 114, 敏初值 = 12, 成长 = 1.071, 技能 = {}, 等级 = 44 },
    },--海底迷宫2
    [1120] = {
        { 名称 = "龟丞相", 外形 = 2064, 血初值 = 180, 法初值 = 72, 攻初值 = 36, 敏初值 = -96, 成长 = 1.116, 技能 = {"龙卷雨击", "龙腾水溅", "龙啸九天", "蛟龙出海", }, 等级 = 46 },
    },--海底迷宫3
    [1121] = {
        { 名称 = "水妖", 外形 = 2069, 血初值 = 120, 法初值 = 0, 攻初值 = 120, 敏初值 = 36, 成长 = 1.106, 技能 = {}, 等级 = 48 },
        { 名称 = "复活女娲", 外形 = 2288, 血初值 = 54, 法初值 = 180, 攻初值 = 30, 敏初值 = 36, 成长 = 1.152, 技能 = {"飞砂走石", "乘风破浪", "太乙生风", "风雷涌动", }, 等级 = 50 },
    },--海底迷宫4
    [1140] = {
        { 名称 = "黑熊精", 外形 = 2006, 血初值 = 144, 法初值 = 0, 攻初值 = 144, 敏初值 = -36, 成长 = 1.096, 技能 = {}, 等级 = 48  },
    },--普陀山
    [1127] = {
        { 名称 = "无头鬼", 外形 = 2057, 血初值 = 108, 法初值 = 0, 攻初值 = 132, 敏初值 = 12, 成长 = 1.081, 技能 = {}, 等级 = 51 },
        { 名称 = "无身鬼", 外形 = 2056, 血初值 = 96, 法初值 = 0, 攻初值 = 144, 敏初值 = 12, 成长 = 1.091, 技能 = {}, 等级 = 52 },
    },--地狱迷宫1
    [1128] = {
        { 名称 = "吸血鬼", 外形 = 2058, 血初值 = 72, 法初值 = 0, 攻初值 = 168, 敏初值 = 12, 成长 = 1.142, 技能 = {}, 等级 = 54 },
        { 名称 = "野鬼", 外形 = 2055, 血初值 = 84, 法初值 = 0, 攻初值 = 156, 敏初值 = 12, 成长 = 1.086, 技能 = {}, 等级 = 53 },
    },--地狱迷宫2
    [1129] = {
        { 名称 = "冤魂", 外形 = 2049, 血初值 = 84, 法初值 = 0, 攻初值 = 150, 敏初值 = 12, 成长 = 1.111, 技能 = {}, 等级 = 55 },
        { 名称 = "孤魂", 外形 = 2054, 血初值 = 96, 法初值 = 0, 攻初值 = 162, 敏初值 = 12, 成长 = 1.106, 技能 = {}, 等级 = 56 },
    },--地狱迷宫3
    [1130] = {
        { 名称 = "幽灵", 外形 = 2051, 血初值 = 84, 法初值 = 0, 攻初值 = 138, 敏初值 = 12, 成长 = 1.173, 技能 = {}, 等级 = 58 },
        { 名称 = "修罗", 外形 = 2050, 血初值 = 108, 法初值 = 0, 攻初值 = 174, 敏初值 = 12, 成长 = 1.101, 技能 = {}, 等级 = 59 },
        { 名称 = "符咒女娲", 外形 = 2292, 血初值 = 24, 法初值 = 60, 攻初值 = 24, 敏初值 = 96, 成长 = 1.142, 技能 = {"雷霆霹雳", "日照光华", "雷神怒击", "电闪雷鸣", }, 等级 = 60 },
    },--地狱迷宫4
    [1174] = {
        { 名称 = "冰熊", 外形 = 2040, 血初值 = 144, 法初值 = 0, 攻初值 = 96, 敏初值 = -24, 成长 = 1.091, 技能 = {}, 等级 = 60 },
        { 名称 = "白虎", 外形 = 2038, 血初值 = 120, 法初值 = 0, 攻初值 = 120, 敏初值 = 12, 成长 = 1.188, 技能 = {}, 等级 = 63 },
        { 名称 = "两角怪", 外形 = 2013, 血初值 = 132, 法初值 = 0, 攻初值 = 108, 敏初值 = 6, 成长 = 1.071, 技能 = {}, 等级 = 64 },
    },--北俱芦洲
    [1177] = {
        { 名称 = "三尾怪", 外形 = 2016, 血初值 = 156, 法初值 = 0, 攻初值 = 90, 敏初值 = 18, 成长 = 1.081, 技能 = {}, 等级 = 70 },
    },--龙窟1层
    [1178] = {
        { 名称 = "鸟嘴兽", 外形 = 2014, 血初值 = 132, 法初值 = 0, 攻初值 = 108, 敏初值 = -12, 成长 = 1.096, 技能 = {}, 等级 = 72 },
    },--龙窟2层
    [1179] = {
        { 名称 = "古代瑞兽", 外形 = 2041, 血初值 = 84, 法初值 = 180, 攻初值 = 36, 敏初值 = 0, 成长 = 1.203, 技能 = {"雷霆霹雳", "日照光华", "雷神怒击", "电闪雷鸣", }, 等级 = 74 },
    },--龙窟3层
    [1180] = {
        { 名称 = "寒钢怪", 外形 = 2008, 血初值 = 66, 法初值 = 108, 攻初值 = 48, 敏初值 = 18, 成长 = 1.106, 技能 = {"雷霆霹雳", "日照光华", "雷神怒击", "电闪雷鸣", }, 等级 = 76 },
    },--龙窟4层
    [1181] = {
        { 名称 = "死灵", 外形 = 2027, 血初值 = 120, 法初值 = 0, 攻初值 = 162, 敏初值 = 12, 成长 = 1.111, 技能 = {}, 等级 = 78 },
    },--龙窟5层
    [1182] = {
        { 名称 = "地狱战神", 外形 = 2074, 血初值 = 96, 法初值 = 144, 攻初值 = 36, 敏初值 = -36, 成长 = 1.173, 技能 = {"雷霆霹雳", "日照光华", "雷神怒击", "电闪雷鸣", }, 等级 = 81 },
    },--龙窟6层
    [1183] = {
        { 名称 = "蛟龙", 外形 = 2070, 血初值 = 48, 法初值 = 180, 攻初值 = 60, 敏初值 = 48, 成长 = 1.254, 技能 = {"龙卷雨击", "龙腾水溅", "龙啸九天", "蛟龙出海", }, 等级 = 84 },
        { 名称 = "火神女娲", 外形 = 2291, 血初值 = 48, 法初值 = 120, 攻初值 = 168, 敏初值 = 18, 成长 = 1.203, 技能 = {"地狱烈火", "天雷怒火", "三味真火", "烈火骄阳", }, 等级 = 80 },
    },--龙窟7层
    [1186] = {
        { 名称 = "蜘蛛精", 外形 = 2065, 血初值 = 96, 法初值 = 120, 攻初值 = 48, 敏初值 = 24, 成长 = 1.086, 技能 = {"飞砂走石", "乘风破浪", "太乙生风", "风雷涌动", }, 等级 = 70 },
    },--凤巢1层
    [1187] = {
        { 名称 = "冲冲虫", 外形 = 2005, 血初值 = 120, 法初值 = 96, 攻初值 = 30, 敏初值 = 84, 成长 = 1.193, 技能 = {"红袖添香", "莲步轻舞", "楚楚可怜", "魔神护体", }, 等级 = 72 },
    },--凤巢2层
    [1188] = {
        { 名称 = "蝴蝶仙子", 外形 = 2011, 血初值 = 96, 法初值 = 0, 攻初值 = 96, 敏初值 = 84, 成长 = 1.081, 技能 = {}, 等级 = 74 },
    },--凤巢3层
    [1189] = {
        { 名称 = "雷鸟人", 外形 = 2023, 血初值 = 120, 法初值 = 0, 攻初值 = 144, 敏初值 = 12, 成长 = 1.213, 技能 = {}, 等级 = 76 },
    },--凤巢4层
    [1190] = {
        { 名称 = "独眼巨人", 外形 = 2018, 血初值 = 54, 法初值 = 96, 攻初值 = 78, 敏初值 = 24, 成长 = 1.116, 技能 = {}, 等级 = 78 },
    },--凤巢5层
    [1191] = {
        { 名称 = "野蛮王", 外形 = 2026, 血初值 = 60, 法初值 = 108, 攻初值 = 120, 敏初值 = 18, 成长 = 1.101, 技能 = {"地狱烈火", "天雷怒火", "三味真火", "烈火骄阳", }, 等级 = 81 },
    },--凤巢6层
    [1192] = {
        { 名称 = "凤凰", 外形 = 2071, 血初值 = 36, 法初值 = 180, 攻初值 = 48, 敏初值 = 60, 成长 = 1.275, 技能 = {"地狱烈火", "天雷怒火", "三味真火", "烈火骄阳", }, 等级 = 84 },
        { 名称 = "舍生女娲", 外形 = 2290, 血初值 = 120, 法初值 = 168, 攻初值 = 72, 敏初值 = -24, 成长 = 1.224, 技能 = {"地狱烈火", "天雷怒火", "三味真火", "烈火骄阳", }, 等级 = 90 },
    },--凤巢7层
    [1131] = {
        { 名称 = "精怪", 外形 = 2019, 血初值 = 96, 法初值 = 0, 攻初值 = 144, 敏初值 = 0, 成长 = 1.086, 技能 = {}, 等级 = 72 },
        { 名称 = "山妖", 外形 = 2025, 血初值 = 108, 法初值 = 0, 攻初值 = 132, 敏初值 = 12, 成长 = 1.091, 技能 = {}, 等级 = 74 },
        { 名称 = "鼠怪", 外形 = 2021, 血初值 = 96, 法初值 = 0, 攻初值 = 144, 敏初值 = 72, 成长 = 1.106, 技能 = {}, 等级 = 76 },
    },--狮驼岭
    [1199] = {
        { 名称 = "猴精", 外形 = 2060, 血初值 = 108, 法初值 = 0, 攻初值 = 168, 敏初值 = 36, 成长 = 1.173, 技能 = {}, 等级 = 86 },
    },--御马监
    [1201] = {
        { 名称 = "神兵", 外形 = 2061, 血初值 = 90, 法初值 = 0, 攻初值 = 132, 敏初值 = 60, 成长 = 1.203, 技能 = {}, 等级 = 89 },
    },--瑶池
    [1217] = {
        { 名称 = "神灵", 外形 = 2068, 血初值 = 60, 法初值 = 168, 攻初值 = 42, 敏初值 = 60, 成长 = 1.275, 技能 = {"雷霆霹雳", "日照光华", "雷神怒击", "电闪雷鸣", }, 等级 = 93 },
    },--蟠桃园后
    [101295] = {
        { 名称 = "桃树精", 外形 = 2095, 血初值 = 144, 法初值 = 0, 攻初值 = 12, 敏初值 = -240, 成长 = 1.275, 技能 = {}, 等级 = 102 },
        { 名称 = "桃花仙", 外形 = 2096, 血初值 = 72, 法初值 = 72, 攻初值 = 48, 敏初值 = 48, 成长 = 1.275, 技能 = {"龙卷雨击", "龙腾水溅", "龙啸九天", "蛟龙出海", }, 等级 = 105 },
        { 名称 = "黄金兽", 外形 = 2097, 血初值 = 12, 法初值 = 0, 攻初值 = 180, 敏初值 = 240, 成长 = 1.275, 技能 = {}, 等级 = 111 },
        { 名称 = "金刚仙", 外形 = 2098, 血初值 = 48, 法初值 = 216, 攻初值 = 48, 敏初值 = 36, 成长 = 1.275, 技能 = {"雷霆霹雳", "日照光华", "雷神怒击", "电闪雷鸣", }, 等级 = 108 },
    },--四圣庄
    [101299] = {
        { 名称 = "冰雪魔", 外形 = 2099, 血初值 = 132, 法初值 = 0, 攻初值 = 12, 敏初值 = 240, 成长 = 1.275, 技能 = {}, 等级 = 120 },
        { 名称 = "水灵仙", 外形 = 2100, 血初值 = 12, 法初值 = 360, 攻初值 = 12, 敏初值 = 36, 成长 = 1.275, 技能 = {"龙卷雨击", "龙腾水溅", "龙啸九天", "蛟龙出海", }, 等级 = 117 },
        { 名称 = "泥石怪", 外形 = 2101, 血初值 = 60, 法初值 = 0, 攻初值 = 360, 敏初值 = -480, 成长 = 1.275, 技能 = {}, 等级 = 114 },
        { 名称 = "食土兽", 外形 = 2102, 血初值 = 72, 法初值 = 72, 攻初值 = 72, 敏初值 = 48, 成长 = 1.275, 技能 = {"飞砂走石", "乘风破浪", "太乙生风", "风雷涌动", }, 等级 = 123 },
    },--万寿山
    [101300] = {
        { 名称 = "赤焰妖", 外形 = 2103, 血初值 = 12, 法初值 = 72, 攻初值 = 120, 敏初值 = 72, 成长 = 1.275, 技能 = {"雷霆霹雳", "日照光华", "雷神怒击", "电闪雷鸣", }, 等级 = 136 },
        { 名称 = "喷火牛", 外形 = 2104, 血初值 = 96, 法初值 = 48, 攻初值 = 96, 敏初值 = 60, 成长 = 1.275, 技能 = {"地狱烈火", "天雷怒火", "三味真火", "烈火骄阳", }, 等级 = 132 },
        { 名称 = "麒麟兽", 外形 = 2105, 血初值 = 144, 法初值 = 144, 攻初值 = 12, 敏初值 = -240, 成长 = 1.275, 技能 = {"地狱烈火", "天雷怒火", "三味真火", "烈火骄阳", }, 等级 = 128 },
    },--白骨山
}

local function _取怪物属性(玩家, id)
    local list = {}
    local t = _野怪[id][math.random(#_野怪[id])]
    for k, v in pairs(t) do
        list[k] = v
    end
    return list
end

local function _取怪物属性平均值(玩家, id)
    local list = {血初值 = 0, 法初值 = 0, 攻初值 = 0, 敏初值 = 0, 成长 = 0, 技能 = {}, 等级 = 0}
    local t = _野怪[id]
    for i=1,#t do
        for k,v in pairs(list) do
            if k == '技能' then
                if #t[i].技能 >= 1 then
                    for n=1,#t[i].技能 do
                        table.insert(v, t[i].技能[n])
                    end
                end
            else
                list[k] = list[k] + t[i][k]
            end
        end
    end
    for k,v in pairs(list) do
        if k ~= '技能' then
            if k == '成长' then
                list[k] = list[k] / #t * 1.5
            elseif k == '等级' then
                list[k] = math.floor(list[k] / #t + 20)
            else
                list[k] = math.floor(list[k] / #t * 10)
            end
        end
    end
    return list
end

local _boss = {
    [1193] = { 名称 = "食婴鬼的手下", 外形 = 2017 },
    [1110] = { 名称 = "食婴鬼", 外形 = 2018 },
    [1005] = { 名称 = "山贼之灵", 外形 = 2045 },
    [1006] = { 名称 = "山贼之灵", 外形 = 2045 },
    [1007] = { 名称 = "山贼之灵", 外形 = 2045 },
    [1008] = { 名称 = "山贼之灵", 外形 = 2045 },
    [1090] = { 名称 = "山贼之灵", 外形 = 2045 },
    [1194] = { 名称 = "山贼之灵", 外形 = 2045 },
    [1127] = { 名称 = "绝地魔", 外形 = 2072 },
    [1128] = { 名称 = "绝地魔", 外形 = 2072 },
    [1129] = { 名称 = "绝地魔", 外形 = 2072 },
    [1130] = { 名称 = "绝地魔", 外形 = 2072 },
    [1174] = { 名称 = "绝地魔", 外形 = 2072 },
    [1140] = { 名称 = "护山黑熊怪", 外形 = 2006 },
    [1173] = { 名称 = "春三十娘", 外形 = 2079 },
    [1091] = { 名称 = "避水金睛兽", 外形 = 2041 },
    [1194] = { 名称 = "晶晶姑娘", 外形 = 2080 },
    [1203] = { 名称 = "三当家", 外形 = 2044 },
    [1092] = { 名称 = "九头精怪", 外形 = 2089 },
    [1118] = { 名称 = "龙王", 外形 = 14 },
    [1119] = { 名称 = "龙王", 外形 = 14 },
    [1120] = { 名称 = "龙王", 外形 = 14 },
    [1121] = { 名称 = "龙王", 外形 = 14 },
    [1174] = { 名称 = "翻天鬼", 外形 = 2074 },
    [1177] = { 名称 = "天一神将", 外形 = 2088 },
    [1178] = { 名称 = "天一神将", 外形 = 2088 },
    [1179] = { 名称 = "天一神将", 外形 = 2088 },
    [1180] = { 名称 = "天一神将", 外形 = 2088 },
    [1181] = { 名称 = "天一神将", 外形 = 2088 },
    [1182] = { 名称 = "天一神将", 外形 = 2088 },
    [1183] = { 名称 = "天一神将", 外形 = 2088 },
    [1186] = { 名称 = "炎之凤", 外形 = 2071 },
    [1187] = { 名称 = "炎之凤", 外形 = 2071 },
    [1188] = { 名称 = "炎之凤", 外形 = 2071 },
    [1189] = { 名称 = "炎之凤", 外形 = 2071 },
    [1190] = { 名称 = "炎之凤", 外形 = 2071 },
    [1191] = { 名称 = "炎之凤", 外形 = 2071 },
    [1192] = { 名称 = "炎之凤", 外形 = 2071 },
    [1131] = { 名称 = "疯牛怪", 外形 = 2052 },
    [1199] = { 名称 = "六耳灵猴", 外形 = 2060 },
    [1201] = { 名称 = "九龙天兵", 外形 = 2061 },
    [1217] = { 名称 = "护园大神", 外形 = 2068 },
    [101295] = { 名称 = "千年老树精", 外形 = 2095 },
    [101299] = { 名称 = "万寿山神", 外形 = 2101 },
    [101300] = { 名称 = "赤焰妖王", 外形 = 2103 }
}

function 战斗:战斗初始化(玩家, id)
    if _野怪[id] then
        local n = 1
        if not 玩家.是否组队 then
            n = math.random(2, 3)
        else
            n = 玩家:取队伍人数()
            n = math.random(n + 1, n * 2 + 1)
        end
        if n > 10 then
            n = 10
        end
        --练功区boss
        if _boss[id] and 玩家.是否组队 and math.random(1, 100) <= 20 then
            for i = 1, n do
                if i == 1 then
                    local t = _取怪物属性平均值(玩家, id)
                    t.名称 = _boss[id].名称
                    t.外形 = _boss[id].外形
                    self:加入敌方(i, 生成战斗怪物(生成怪物属性( t, '困难' )))
                else
                    local t = _取怪物属性(玩家, id)
                    t.血初值 = t.血初值 * 2
                    t.法初值 = t.法初值 * 2
                    t.攻初值 = t.攻初值 * 2
                    t.敏初值 = t.敏初值 * 2
                    t.等级 = t.等级 + 10
                    self:加入敌方(i, 生成战斗怪物(生成怪物属性(t)))
                end
            end
            玩家:提示窗口('#Y你有幸遇到了正在闲逛的#R'.._boss[id].名称..'#Y,由于嫉妒你的长相,#R'.._boss[id].名称..'#Y狠狠的瞪了你一眼,二话不说已经对你发起了攻击！')
        else
            for i = 1, n do
                local t = _取怪物属性(玩家, id)
                t.原名 = t.名称
                local 类型参数 = math.random(100)
                if 类型参数 < 10 then
                    t.名称 = t.名称 .. "头领"
                    t.头领 = true
                    t.等级 = t.等级 + 10
                elseif 类型参数 < 20 then
                    if not t.不可捕捉 then
                        t.名称 = t.名称 .. "宝宝"
                        t.宝宝 = true
                        t.等级 = 0
                    end
                end
                if not t.不可捕捉 and not t.头领 then
                    t.可以捕捉 = true
                end
                self:加入敌方(i, 生成战斗怪物(生成怪物属性(t)))
            end
        end

    else
        for i = 1, 1 do
            local r = 生成战斗怪物 {
                外形 = 38,
                名称 = '野怪信息需补充',
                攻击 = 1,
                速度 = 10,
                气血 = 100,
            }
            self:加入敌方(i, r)
        end
    end

end

--熟练度 l*100
function 战斗:战斗回合开始(v)
    --   local  r = self:取对象(1)
    --     r.连击率 = 9999999
    --     r.连击次数 = 9


end

function 战斗:战斗回合结束(v)


end

function 战斗:战斗结束(v)
    if v then
        for k, v in self:遍历我方() do
            if v.是否玩家 then
                local dj = v.对象.接口:取当前地图等级()
                v.对象.接口:添加银子(math.floor(dj * 13))
                v.对象.接口:添加任务经验(math.floor(dj * 29))
                local r = v.对象.接口:取物品是否存在("元气蛋")
                if r then
                    r:添加血气(v.对象.接口)
                end
                --坐骑相关
                local z = v.对象.接口:取乘骑坐骑()
                if z then
                    z:添加经验(2)
                    z:添加熟练(2)
                end
                local r = v.对象.接口:取任务('日常_帮派任务')
                if r then
                    if r.分类 == 9 then
                        if (r.位置 == '青灵草' and v.对象.接口:取当前地图().名称 == '傲来国') or (r.位置 == '血色茶花' and (v.对象.接口:取当前地图().名称 == '地狱迷宫一层' or v.对象.接口:取当前地图().名称 == '地狱迷宫二层' or v.对象.接口:取当前地图().名称 == '地狱迷宫三层' or v.对象.接口:取当前地图().名称 == '地狱迷宫四层')) or (r.位置 == '千年寒冰' and v.对象.接口:取当前地图().名称 == '北俱芦洲') then
                            if math.random(100) <= 25 then
                                v.对象.接口:添加物品({生成物品 {名称 = r.位置, 数量 = 1}})
                            end
                        end
                    end
                end
                r = v.对象.接口:取任务('灵兽降世')
                if r then
                    local 地图 = v.对象.接口:取当前地图().名称
                    if 地图 == '北俱芦洲' then
                        r:添加进度(v.对象.接口)
                    end
                end
                r = v.对象.接口:取任务('新手剧情')
                if r then
                    v.对象.接口:刷新追踪面板()
                end
            end
            -- print(k, v.对象,v.对象.接口, v.名称, v.是否召唤)
        end
    end


end

return 战斗
