-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2023-04-16 15:46:47
-- @Last Modified time  : 2024-08-13 12:18:09

local 物品 = {
    名称 = '超级藏宝图',
    叠加 = 0,
    类别 = 10,
    类型 = 0,
    对象 = 1,
    条件 = 2,
    绑定 = false
}

function 物品:初始化()
end

function 物品:判断移动范围(对象,记录,距离)
    if math.abs(对象.X - 记录.x) > 距离 or math.abs(对象.Y - 记录.y) > 距离 then
        return true
    else
        return false
    end
end

function 物品:使用(对象)
    local map = 对象:取当前地图()--对象.X

    if self.参数.地图信息 and self.参数.坐标 then
        if map.名称 ~= self.参数.地图信息.名称 or map.id ~= self.参数.地图信息.id or self:判断移动范围(对象,self.参数.坐标,3) then
            对象:提示窗口('#Y可是地点似乎不对，这里显然没有宝藏。')
            return
        end
    end
    local 奖励类型 = {装备 = 15,放妖 = 4,道具 = 80}
    local 奖励
    for i,v in pairs(奖励类型) do
        if math.random(100) <= v then
            奖励 = k
        end
    end
    local 奖励 = 是否奖励(2000,对象.等级,对象.转生)
    if 奖励 ~= nil and type(奖励) == 'table' then
        if 奖励.道具信息.道具 == '高级装备' then
            local 装备列表 = {"血饮魔刀","魂刃","虚空之刃","弑神","青霜剑","流光剑","天魔邪剑","诛仙","雷光矛","天罡战戟","嗜血魔枪","破日","大力降魔杵","轮回杖","乾坤棒","定海神针","雷神钩","烈火钩","阴阳钩","夺魂","穿云索","捆仙绳","阴灵索","情丝","天宫战斧","阴灵斧","刑天战斧","斗魂","寒玉手","玄阴鬼手","烈焰修罗手","碎星","青云扇","风月宝扇","八卦阴阳扇","天怒","八卦紫金锤","天魔破","混元魔锤","乾坤破","归藏之卷","血煞之卷","贞观伏魔录","兰台秘典","天魔爪","流云爪","混元血爪","嗜魂","风火之轮","凝霜之轮","水镜之轮","七夕","五鬼追魂幡","天王夺命幡","八卦阴阳幡","断魂","八宝天岚丝","玄天紫金绫","九转天魔丝","葬月","寒玉拂尘","紫金拂尘","金光拂尘","拨云","菩提灯笼","残荷听雨灯","天涯明月灯","金荷盏","玄武战盔","朱雀羽冠","凤羽环","天魔冠","龙魂角","七彩玲珑玉","神羽","龙吟","九转水晶","月之守护","九日护心","星辰","天香百花裙","青龙甲","火神战甲","凤凰羽衣","天仙羽衣","龙魂战甲","狂雷","玄火","八宝仙履","修罗战靴","天魔追魂履","追日"}
            local 随机 = math.random(1, #装备列表)
            local r = 生成装备 { 名称 = 装备列表[随机] }
            if r then
                对象:添加物品 { r }
                if 奖励.道具信息.是否广播 == 1 and 奖励.广播 ~= nil then
                    对象:发送系统(奖励.广播, r.nid, r.名称)
                end
            end
        elseif 奖励.道具信息.道具 == '放妖' then
            local _地图 = { 1217, 1201, 101295, 101299, 101300 }
            local 随机 = math.random(1, #_地图)
            local _map = 对象:取地图(_地图[随机])

            if _map then
                print('放妖',_map.名称)
                for i=1,math.random(5, 10) do
                    local X, Y = _map:取随机坐标()
                    local NPC =
                        _map:添加NPC {
                        名称 = '三界妖王',
                        外形 = 2018,
                        时间 = 3600,
                        脚本 = 'scripts/event/三界妖王.lua',
                        X = X,
                        Y = Y,
                        事件 = self
                    }
                end
                对象:提示窗口('#Y你打开宝箱，箱内金光闪闪，突然一片黑影闪过，宝箱空空如也，黑夜也消失的无影无踪······')
                对象:发送系统('#R%s#W挖宝时挖出金光闪闪的宝贝，一旁窥探的#G三界妖王#W一把抢去逃亡#Y%s#W。', 对象.名称, _map.名称)
            end
        else
            local r = 生成物品 { 名称 = 奖励.道具信息.道具, 数量 = 奖励.道具信息.数量, 参数 = 奖励.道具信息.参数 }
            if r then
                对象:添加物品({ r })
                if 奖励.道具信息.是否广播 == 1 and 奖励.广播 ~= nil then
                    对象:发送系统(奖励.广播, r.nid, r.名称)
                end
            end
        end
        self.数量 = self.数量 - 1
    end
end

function 物品:取描述()
    if self.参数 then
        return string.format('宝藏大概藏在#G%s(%d,%d)#W附近', self.参数.地图信息.名称, self.参数.坐标.x, self.参数.坐标.y)
    end
end

return 物品
