-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2022-08-06 16:04:54
-- @Last Modified time  : 2023-05-17 19:00:40
local 物品 = {
    名称 = 'vip2',
    叠加 = 999,
    类别 = 11,
    类型 = 0,
    对象 = 1,
    条件 = 2,
    绑定 = false
}

function 物品:使用(对象)
    if 对象:添加物品({
        生成物品 { 名称 = '银票', 参数 = 20000000, 属性="#Y增加银两 20000000", 数量 = 1 },
        生成物品 { 名称 = '帮派成就册', 参数 = 10000,属性="#Y增加帮派成就 10000", 数量 = 1 },
        生成物品 { 名称 = '亲密丹', 参数=100000,属性="#Y增加亲密度 100000", 数量 = 20 },
        生成物品 { 名称 = '补天神石', 数量 = 5 },
        生成物品 { 名称 = '盘古精铁', 数量 = 5 },
        生成物品 { 名称 = '天外飞石', 数量 = 5 },
        生成物品 { 名称 = '千年寒铁', 数量 = 5 },
        生成物品 { 名称 = '神兵礼盒', 数量 = 10 },
        生成物品 { 名称 = '清盈果',属性="#Y恢复1000点体力", 数量 = 20 },
        生成物品 { 名称 = '龙涎丸', 数量 = 9 },
        生成物品 { 名称 = '龙之骨', 数量 = 3 },
        生成物品 { 名称 = '伐骨洗髓丹', 数量 = 1 },
    }) then
        self.数量 = self.数量 - 1
    end

end

return 物品
