-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2023-04-11 04:21:54
-- @Last Modified time  : 2024-08-27 09:06:19

local 物品 = {
    名称 = '游侠盟锦囊',
    类别 = 11,
    类型 = 0,
    对象 = 1,
    条件 = 2,
    禁止交易 = true,
    绑定 = true
}

local _对话 = [[
menu
1|送我去找游侠盟主
2|我要打开游侠锦囊
99|我再想想
]]


function 物品:初始化()
    self.转生组 = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3, 3, 3 }
    self.等级组 = { 10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 15, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 15,
        30, 70, 100, 140, 70, 100, 140 }
    self.次数 = 1
end

local _物品奖励 = {
    [1] = {
        { 名称 = "风水混元丹", 数量 = 50, 禁止交易 = true },
        { 名称 = "灵翼天香", 数量 = 50, 禁止交易 = true },
        { 名称 = "孔明灯", 数量 = 1, 禁止交易 = true },
        { 名称 = "二坐骑召唤卡", 数量 = 1, 禁止交易 = true },
        { 名称 = "三坐骑召唤卡", 数量 = 1, 禁止交易 = true },
        { 名称 = "四坐骑召唤卡", 数量 = 1, 禁止交易 = true },
        { 名称 = "五坐骑召唤卡", 数量 = 1, 禁止交易 = true },
        { 名称 = "六坐骑召唤卡", 数量 = 1, 禁止交易 = true },
        { 名称 = "摄妖香", 数量 = 20, 禁止交易 = true }, },
    [2] = {
        { 名称 = "风水混元丹", 数量 = 50, 禁止交易 = true },
        { 名称 = "灵翼天香", 数量 = 50, 禁止交易 = true },
        { 名称 = "六脉化神丸", 数量 = 1, 禁止交易 = true }, },
    [3] = {
        { 名称 = "风水混元丹", 数量 = 50, 禁止交易 = true },
        { 名称 = "灵翼天香", 数量 = 50, 禁止交易 = true },
        { 名称 = "混元丹", 数量 = 1, 禁止交易 = true }, },
    [4] = {
        { 名称 = "风水混元丹", 数量 = 50, 禁止交易 = true },
        { 名称 = "灵翼天香", 数量 = 50, 禁止交易 = true },
        { 名称 = "超级星梦石", 数量 = 1, 禁止交易 = true }, },
    [5] = {
        { 名称 = "风水混元丹", 数量 = 50, 禁止交易 = true },
        { 名称 = "灵翼天香", 数量 = 50, 禁止交易 = true },
        { 名称 = "孔明灯", 数量 = 1, 禁止交易 = true },
        { 名称 = "孔明灯", 数量 = 1, 禁止交易 = true }, },
    [6] = {
        { 名称 = "千年灵花", 数量 = 50, 禁止交易 = true },
        { 名称 = "血烟石", 数量 = 50, 禁止交易 = true }, },
    [7] = {
        { 名称 = "千年灵花", 数量 = 50, 禁止交易 = true },
        { 名称 = "血烟石", 数量 = 50, 禁止交易 = true },
        { 名称 = "千年寒铁", 数量 = 1, 禁止交易 = true },
        { 名称 = "武帝袍", 数量 = 1, 参数 = 12, 禁止交易 = true },
        { 名称 = "武帝袍", 数量 = 1, 参数 = 12, 禁止交易 = true },
        { 名称 = "武帝袍", 数量 = 1, 参数 = 12, 禁止交易 = true }, },
    [8] = {
        { 名称 = "千年灵花", 数量 = 50, 禁止交易 = true },
        { 名称 = "血烟石", 数量 = 50, 禁止交易 = true },
        { 名称 = "天外飞石", 数量 = 1, 禁止交易 = true },
        { 名称 = "六脉化神丸", 数量 = 1, 禁止交易 = true }, },
    [9] = {
        { 名称 = "千年灵花", 数量 = 50, 禁止交易 = true },
        { 名称 = "血烟石", 数量 = 50, 禁止交易 = true },
        { 名称 = "盘古精铁", 数量 = 1, 禁止交易 = true }, },
    [10] = {
        { 名称 = "千年灵花", 数量 = 50, 禁止交易 = true },
        { 名称 = "血烟石", 数量 = 50, 禁止交易 = true },
        { 名称 = "补天神石", 数量 = 1, 禁止交易 = true }, },
    [11] = {
        { 名称 = "风水混元丹", 数量 = 50, 禁止交易 = true },
        { 名称 = "灵翼天香", 数量 = 50, 禁止交易 = true },
        { 名称 = "六脉化神丸", 数量 = 2, 禁止交易 = true }, },
    [12] = {
        { 名称 = "风水混元丹", 数量 = 50, 禁止交易 = true },
        { 名称 = "灵翼天香", 数量 = 50, 禁止交易 = true },
        { 名称 = "超级星梦石", 数量 = 1, 禁止交易 = true }, },
    [13] = {
        { 名称 = "风水混元丹", 数量 = 50, 禁止交易 = true },
        { 名称 = "灵翼天香", 数量 = 50, 禁止交易 = true },
        { 名称 = "六脉化神丸", 数量 = 1, 禁止交易 = true }, },
    [14] = {
        { 名称 = "风水混元丹", 数量 = 50, 禁止交易 = true },
        { 名称 = "灵翼天香", 数量 = 50, 禁止交易 = true },
        { 名称 = "混元丹", 数量 = 1, 禁止交易 = true }, },
    [15] = {
        { 名称 = "风水混元丹", 数量 = 50, 禁止交易 = true },
        { 名称 = "灵翼天香", 数量 = 50, 禁止交易 = true },
        { 名称 = "高级藏宝图", 数量 = 1, 禁止交易 = true }, },
    [16] = {
        { 名称 = "青月灵草", 数量 = 50, 禁止交易 = true },
        { 名称 = "龙之心屑", 数量 = 50, 禁止交易 = true },
        { 名称 = "高级金柳露", 数量 = 1, 禁止交易 = true }, },
    [17] = {
        { 名称 = "青月灵草", 数量 = 50, 禁止交易 = true },
        { 名称 = "龙之心屑", 数量 = 50, 禁止交易 = true },
        { 名称 = "九转易筋丸", 数量 = 1, 禁止交易 = true }, },
    [18] = {
        { 名称 = "青月灵草", 数量 = 50, 禁止交易 = true },
        { 名称 = "龙之心屑", 数量 = 50, 禁止交易 = true },
        { 名称 = "六脉化神丸", 数量 = 1, 禁止交易 = true }, },
    [19] = {
        { 名称 = "青月灵草", 数量 = 50, 禁止交易 = true },
        { 名称 = "龙之心屑", 数量 = 50, 禁止交易 = true },
        { 名称 = "组队飞行符", 数量 = 5, 禁止交易 = true }, },
    [20] = {
        { 名称 = "夜叉石", 数量 = 50, 禁止交易 = true },
        { 名称 = "海蓝石", 数量 = 50, 禁止交易 = true },
        { 名称 = "白露为霜", 数量 = 10, 禁止交易 = true }, },
    [21] = {
        { 名称 = "夜叉石", 数量 = 50, 禁止交易 = true },
        { 名称 = "海蓝石", 数量 = 50, 禁止交易 = true },
        { 名称 = "红雪散", 数量 = 10, 禁止交易 = true }, },
    [22] = {
        { 名称 = "夜叉石", 数量 = 50, 禁止交易 = true },
        { 名称 = "海蓝石", 数量 = 50, 禁止交易 = true },
        { 名称 = "孔雀明王羽", 数量 = 10, 禁止交易 = true }, },
    [23] = {
        { 名称 = "青月灵草", 数量 = 50, 禁止交易 = true },
        { 名称 = "龙之心屑", 数量 = 50, 禁止交易 = true },
        { 名称 = "炼化礼包", 数量 = 1, 禁止交易 = true }, },
    [24] = {
        { 名称 = "青月灵草", 数量 = 50, 禁止交易 = true },
        { 名称 = "龙之心屑", 数量 = 50, 禁止交易 = true },
        { 名称 = "守护宝鉴", 数量 = 1, 禁止交易 = true }, },
    [25] = {
        { 名称 = "青月灵草", 数量 = 50, 禁止交易 = true },
        { 名称 = "龙之心屑", 数量 = 50, 禁止交易 = true },
        { 名称 = "补天神石", 数量 = 1, 禁止交易 = true }, },
    [26] = {
        { 名称 = "夜叉石", 数量 = 50, 禁止交易 = true },
        { 名称 = "海蓝石", 数量 = 50, 禁止交易 = true },
        { 名称 = "六魂之玉", 数量 = 1, 禁止交易 = true }, },
    [27] = {
        { 名称 = "夜叉石", 数量 = 50, 禁止交易 = true },
        { 名称 = "海蓝石", 数量 = 50, 禁止交易 = true },
        { 名称 = "高级藏宝图", 数量 = 5, 禁止交易 = true }, },
    [28] = {
        { 名称 = "夜叉石", 数量 = 50, 禁止交易 = true },
        { 名称 = "海蓝石", 数量 = 50, 禁止交易 = true }, },
    [29] = {
        { 名称 = "夜叉石", 数量 = 50, 禁止交易 = true },
        { 名称 = "海蓝石", 数量 = 50, 禁止交易 = true },
        { 名称 = "组队飞行符", 数量 = 10, 禁止交易 = true }, },
    [30] = {
        { 名称 = "太乙玄黄丹", 数量 = 30, 禁止交易 = true },
        { 名称 = "华韵流光", 数量 = 20, 禁止交易 = true },
        { 名称 = "神兵礼盒", 数量 = 1, 参数 = 3, 禁止交易 = true }, },
}
local _经验师贡 = {
    [1] = { 20000, 500000 },
    [2] = { 100000, 500000 },
    [3] = { 250000, 500000 },
    [4] = { 500000, 1000000 },
    [5] = { 1000000, 1000000 },
    [6] = { 2000000, 1000000 },
    [7] = { 3000000, 1500000 },
    [8] = { 4000000, 1500000 },
    [9] = { 6000000, 1500000 },
    [10] = { 8000000, 2000000 },
    [11] = { 100000, 2000000 },
    [12] = { 100000, 2000000 },
    [13] = { 250000, 2500000 },
    [14] = { 500000, 2500000 },
    [15] = { 1000000, 2500000 },
    [16] = { 2000000, 3000000 },
    [17] = { 3000000, 3000000 },
    [18] = { 4000000, 3000000 },
    [19] = { 6000000, 3500000 },
    [20] = { 8000000, 3500000 },
    [21] = { 8000000, 3500000 },
    [22] = { 8000000, 4000000 },
    [23] = { 250000, 4000000 },
    [24] = { 250000, 4000000 },
    [25] = { 3000000, 4500000 },
    [26] = { 8000000, 5000000 },
    [27] = { 10000000, 8000000 },
    [28] = { 15000000, 10000000 },
    [29] = { 18000000, 0 },
    [30] = { 22000000, 0 },
}
local _熟练奖励 = {
    [1] = {{1 , 5000}, {2 , 5000}, {3 , 5000}, {4 , 5000}, {5 , 5000}},
    [2] = {},
    [3] = {},
    [4] = {},
    [5] = {},
    [6] = {{1 , 5000}, {2 , 5000}, {3 , 5000}, {4 , 5000}, {5 , 5000}},
    [7] = {},
    [8] = {},
    [9] = {},
    [10] = {},
    [11] = {{1 , 5000}, {2 , 5000}, {3 , 5000}, {4 , 5000}, {5 , 5000}},
    [12] = {},
    [13] = {},
    [14] = {},
    [15] = {},
    [16] = {},
    [17] = {},
    [18] = {},
    [19] = {},
    [20] = {},
    [21] = {},
    [22] = {},
    [23] = {{1 , 5000}, {2 , 5000}, {3 , 5000}, {4 , 5000}, {5 , 5000}},
    [24] = {},
    [25] = {},
    [26] = {},
    [27] = {},
    [28] = {},
    [29] = {},
    [30] = {},
}

function 物品:使用(对象)
    local r = 对象:选择窗口(_对话)
    if r == "1" then
        对象:切换地图(1208, 21, 47)
    elseif r == "2" then
        return self:打开奖励(对象)
    end
end

function 物品:打开奖励(对象)
    if self.次数 >= #self.等级组 then
        -- self.数量 = self.数量 - 1
        self:删除()
    end
    local 允许使用 = true

    if 对象.转生 < self.转生组[self.次数] then
        允许使用 = false
    end
    if 对象.等级 < self.等级组[self.次数] and 对象.转生 <= self.转生组[self.次数] then
        允许使用 = false
    end
    if 允许使用 then
        if _物品奖励[self.次数] then
            local r = 批量生成物品(_物品奖励[self.次数])
            if 对象:添加物品(r) then
                if _经验师贡[self.次数] then
                    对象:添加任务经验(_经验师贡[self.次数][1], '游侠盟锦囊')
                    对象:添加师贡(_经验师贡[self.次数][2])
                end
                if _熟练奖励[self.次数] then
                    for i = 1, #_熟练奖励[self.次数] do
                        对象:指定阶数技能添加熟练(_熟练奖励[self.次数][i][1], _熟练奖励[self.次数]
                        [i][2])
                    end
                end
                if self.次数 == 6 then
                    对象:添加召唤(生成召唤 { 名称 = '猴精' })
                end
                self.次数 = self.次数 + 1
                return "#Y你获得了御武盟给的奖励！"
            else
                return "#Y你的包裹没有那么多位置！"
            end
        end
    end
end


function 物品:取描述()
    if self.转生组 and self.等级组 then
        return string.format("#Y需要%s转%s级以上才能打开！", self.转生组[self.次数], self.等级组[self.次数])
    end
end

return 物品
