-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2023-04-06 19:05:21
-- @Last Modified time  : 2023-08-24 23:54:21

local 物品 = {
    名称 = '高级随便',
    叠加 = 999,
    类别 = 11,
    类型 = 0,
    对象 = 1,
    条件 = 2,
    绑定 = false
}
function 物品:初始化()
end

local _孩子 = { "琼浆玉液","猕猴桃","无字天书","金丹","高级诗经","高级剑诀","高级琴谱","高级孙子兵法","高级三字经","高级百年何首乌","高级内功心法","高级百年雪莲","高级千字文","高级戒指","高级百年茯苓","高级六韬三略","高级鬼谷子","高级玉佩"}
local _低级 = { "人参果王", "千年寒铁","天外飞石","盘古精铁","补天神石","见闻录","超级神兽丹","凝精聚气丹","炼化礼包","清盈果","神功笔录","混元丹","九玄仙玉","毓秀石","落魂砂"}
local _中级 = { "超级星梦石", "更名卡" ,"修正卡","月光宝盒","筋骨提气丸","神兵石","九转易筋丸","六魂之玉","高级金柳露","龙之骨","龙涎丸","神兽碎片","伐骨洗髓丹","元气丹","变色丹","金风玉露","天书残卷第一卷","天书残卷第二卷","天书残卷第三卷","天书残卷第四卷","天书残卷第五卷","天书残卷第六卷","五环令","天机密令"}
local _高级 = { "神兵礼盒", "超级金柳露","伐骨洗髓丹","超级元气丹","超级变色丹","超级人参果王","杜若无心","随机天书召唤兽","特赦令"}
local _顶级 = { "守护宝鉴","二级神兵自选","太乙玄黄丹","高级帮派成就册","高级藏宝图","超级六脉化神丸","超级玉枢返虚丸","祝福劵"}
local _超级 = { "随机神兽宝盒","四级神兵自选","三级神兵自选","超级炼妖自选礼包","超级藏宝图","超级帮派成就册"}
local _究极 = { "年封印卡","六级神兵自选","五级神兵自选","华韵流光"}
function 物品:使用(对象)
    local 名称 = "落魂砂"
    local 几率 = math.random(10)
    if 几率 <= 6 then
        名称 = _孩子[math.random(#_孩子)]
    elseif 几率 <= 8 then
        名称 = _低级[math.random(#_低级)]
    elseif 几率 <= 9 then
        名称 = _中级[math.random(#_中级)]
    elseif 几率 <= 8 then
        名称 = _高级[math.random(#_高级)]
    elseif 几率 <= 2 then
        名称 = _顶级[math.random(#_顶级)]
    elseif 几率 <= 1 then
        名称 = _超级[math.random(#_超级)]
    elseif 几率 <= 0.1 then
        名称 = _究极[math.random(#_究极)]
	else
	    名称 = _低级[math.random(#_低级)]
    
    end
    local r = 生成物品 { 名称 = 名称 }

    if r then
        if 对象:添加物品({r}) then
            self.数量 = self.数量 - 1
            对象:发送系统("#R%s#C爽快打开大盲盒得到了#G#m(%s)[%s]#m#n#44"
                , 对象.名称, r.nid, r.名称)
        end
    end




end

function 物品:取描述()
end

return 物品
