
-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2023-04-15 05:36:50
-- @Last Modified time  : 2024-08-26 13:39:41

function 获取奖励表(编号,等级,转生)
    local tables = {
        [1001] = {
            sun = 0,
            广播 = '#C玩家%s在执行帮派任务中,勤勤恳恳,获得帮派总管奖励的#G#m(%s)[%s]#m#n',
            物品配置 = {
                {道具 = '补天神石', 几率 = 0.05, 数量 = 1, 是否广播 = 1, 等级限制 = 100},--1为广播 0 为不广播,另外像亲密丹这种 如需设置亲密度则加上   , 参数 = 1000
                {道具 = '盘古精铁', 几率 = 0.07, 数量 = 1, 是否广播 = 0, 等级限制 = 50},--等级限制:如果获得奖励的单位等级不足这里设置的等级限制,则不会被统计入掉落表中
                {道具 = '天外飞石', 几率 = 0.09, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '千年寒铁', 几率 = 0.11, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
            }
        },--帮派任务_每轮
        [1002] = {
            sun = 0,
            广播 = '#C玩家%s在执行帮派任务中,勤勤恳恳,获得帮派总管奖励的#G#m(%s)[%s]#m#n',
            物品配置 = {
                {道具 = '神兵礼盒', 几率 = 0.001, 数量 = 1, 是否广播 = 1, 等级限制 = 100},
                {道具 = '内丹精华', 几率 = 0.05, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '血玲珑', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '九彩云龙珠', 几率 = 0.15, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
            }
        },--帮派任务_每次

        [1003] = {
            sun = 0,
            广播 = '#C玩家%s在抓鬼任务中,表现优异获得钟馗奖励的#G#m(%s)[%s]#m#n',
            物品配置 = {
                {道具 = '龙之骨', 几率 = 0.005, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '随机天书', 几率 = 0.05, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '神兵礼盒', 几率 = 0.05, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '见闻录', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '千年寒铁', 几率 = 0.25, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '天外飞石', 几率 = 0.2, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '神兽丹', 几率 = 0.345, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
            }
        },--抓鬼任务_每轮
        [1004] = {
            sun = 0,
            广播 = '#C玩家%s在抓鬼任务中,表现优异获得钟馗奖励的#G#m(%s)[%s]#m#n',
            物品配置 = {
                {道具 = '亲密丹', 几率 = 0.05, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '内丹精华', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '血玲珑', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '九彩云龙珠', 几率 = 0.15, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
            }
        },--抓鬼任务_每次

        [1005] = {
            sun = 0,
            广播 = '#C玩家%s在天庭任务中,表现优异获得玉帝奖励的#G#m(%s)[%s]#m#n',
            物品配置 = {
                {道具 = '补天神石', 几率 = 0.05, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '补天神石', 几率 = 0.1, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '神兵礼盒', 几率 = 0.05, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '二级配饰盒子', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '天外飞石', 几率 = 0.05, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '盘古精铁', 几率 = 0.05, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '盘古精铁', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
            }
        },--天庭任务_每轮
        [1006] = {
            sun = 0,
            广播 = '#C玩家%s在天庭任务中,表现优异获得玉帝奖励的#G#m(%s)[%s]#m#n',
            物品配置 = {
                {道具 = '一级配饰盒子', 几率 = 0.05, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '人参果', 几率 = 0.05, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '亲密丹', 几率 = 0.05, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '神兽丹', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '内丹精华', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '血玲珑', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '盘古精铁', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '百分比药品', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
            }
        },--天庭任务_每次

        [1007] = {
            sun = 0,
            广播 = '#C%s#c00FFFF驱鬼有功，特将私藏多年的#G#m(%s)[%s]#m#n#c00FFFF赐予，作为嘉奖！',
            物品配置 = {
                {道具 = '神兵礼盒', 几率 = 0.04, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '人参果王', 几率 = 0.1, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '神兵礼盒', 几率 = 0.06, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '补天神石', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '随机天书', 几率 = 0.2, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '清盈果', 几率 = 0.2, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '补天神石', 几率 = 0.2, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
            }
        },--鬼王任务_每轮
        [1008] = {
            sun = 0,
            广播 = '#C%s#c00FFFF驱鬼有功，特将私藏多年的#G#m(%s)[%s]#m#n#c00FFFF赐予，作为嘉奖！',
            物品配置 = {
                {道具 = '盘古精铁', 几率 = 0.05, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '人参果', 几率 = 0.05, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '内丹精华', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '血玲珑', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '盘古精铁', 几率 = 0.15, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '九彩云龙珠', 几率 = 0.15, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
            }
        },--鬼王任务_每次

        [1009] = {
            sun = 0,
            广播 = '#C%s#c00FFFF在战胜修罗后意外发现了#G#m(%s)[%s]#m#n#c00FFFF乐呵呵的收进背包里#49',
            物品配置 = {
                {道具 = '神兵礼盒', 几率 = 0.05, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '人参果王', 几率 = 0.2, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '神兵礼盒', 几率 = 0.05, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '补天神石', 几率 = 0.2, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '高级装备', 几率 = 0.1, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '炼妖宝盒', 几率 = 0.1, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '补天神石', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '盘古精铁王', 几率 = 0.2, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
            }
        },--修罗任务_每轮
        [1010] = {
            sun = 0,
            广播 = '#C%s#c00FFFF在战胜修罗后意外发现了#G#m(%s)[%s]#m#n#c00FFFF乐呵呵的收进背包里#49',
            物品配置 = {
                {道具 = '盘古精铁', 几率 = 0.05, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '人参果', 几率 = 0.05, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '内丹精华', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '血玲珑', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '盘古精铁', 几率 = 0.15, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '九彩云龙珠', 几率 = 0.15, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
            }
        },--修罗任务_每次

        [2000] = {
            sun = 0,
            广播 = '#c44afbf某人在挖宝中获得一个#G#m(%s)[%s]#m#n#c00FFFF。',
            物品配置 = {
                {道具 = '神兵礼盒', 几率 = 0.05, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '神兵礼盒', 几率 = 0.1, 数量 = 1, 是否广播 = 1, 等级限制 = 0, 参数 = 2},
                {道具 = '神兵礼盒', 几率 = 0.05,  数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '指南录',   几率 = 0.05,  数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '补天神石', 几率 = 0.1, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '高级装备', 几率 = 0.1, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '人参果王', 几率 = 0.1, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '炼妖宝盒', 几率 = 0.05, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '龙之骨',       几率 = 0.05, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '高级金柳露',   几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '补天神石', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '放妖',        几率 = 0.15, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
            }
        },--挖宝任务
        [2001] = {
            sun = 0,
            广播 = '#c44afbf【三界妖王】玩家#R%s#c44afbf打倒三界妖王后获得了#G#m(%s)[%s]#m#n#c00FFFF的奖励！#93',
            物品配置 = {
                {道具 = '神兵礼盒', 几率 = 0.03, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '龙之骨', 几率 = 0.03, 数量 = 1, 是否广播 = 1, 等级限制 = 0 },
                {道具 = '神兵礼盒', 几率 = 0.1,  数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '神兽碎片',   几率 = 0.05,  数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '补天神石', 几率 = 0.15, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '人参果王', 几率 = 0.2, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '补天神石', 几率 = 0.2, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '六魂之玉', 几率 = 0.04, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
            }
        },--挖宝任务
        [2002] = {
            sun = 0,
            广播 = '#c44afbf玩家#R%s#c44afbf在交换赈灾之银时,获得了唐王的青睐,特赐予起#G#m(%s)[%s]#m#n#c00FFFF#89',
            物品配置 = {
                {道具 = '人参果王', 几率 = 0.08, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '龙之骨', 几率 = 0.01, 数量 = 1, 是否广播 = 1, 等级限制 = 0 },
                {道具 = '神兵礼盒', 几率 = 0.05,  数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '补天神石',   几率 = 0.08,  数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '天外飞石', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '星梦石', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '神之石', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '炼化材料', 几率 = 0.2, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
            }
        },--赈灾之银
        [2003] = {
            sun = 0,
            广播 = '#c44afbf千惊万喜！#50#R%s#c44afbf跟奎木狼打了一架,奎木狼送了个#G#m(%s)[%s]#m#n#c00FFFF给他。不打不相识啊！#40',
            物品配置 = {
                {道具 = '人参果王', 几率 = 0.08, 数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '龙之骨', 几率 = 0.01, 数量 = 1, 是否广播 = 1, 等级限制 = 0 },
                {道具 = '神兵礼盒', 几率 = 0.05,  数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '补天神石',   几率 = 0.08,  数量 = 1, 是否广播 = 1, 等级限制 = 0},
                {道具 = '天外飞石', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '星梦石', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '神之石', 几率 = 0.1, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
                {道具 = '炼化材料', 几率 = 0.2, 数量 = 1, 是否广播 = 0, 等级限制 = 0},
            }
        },--奎木狼
    }
    local 奖励表 = {}
    if tables[编号] ~= nil then
        奖励表 = tables[编号]
    else
        return nil
    end
    if 转生 == 1 and 等级 < 100 then
        等级 = 100
    elseif 转生 == 2 and 等级 < 122 then
        等级 = 122
    elseif 转生 == 3 and 等级 < 142 then
        等级 = 142
    end
    for k,v in pairs(奖励表) do
        if k == '物品配置' then
            for i=#v,1,-1 do -- 从后往前循环
                if v[i].等级限制 > 等级 then
                    table.remove(v, i)
                end
            end
        end
        if k == 'sun' then
            local 总几率 = 0
            for i=1,#奖励表.物品配置 do
                if 奖励表.物品配置[i].几率 ~= nil then
                    总几率 = 总几率 + 奖励表.物品配置[i].几率
                end
            end
            奖励表[k] = 总几率
        end
    end
    return 奖励表
end

function 是否奖励(编号,等级,转生)
    if 编号 == nil or type(编号) ~= 'number' then 编号 = 0 end
    if 等级 == nil or type(等级) ~= 'number' then 等级 = 0 end
    if 转生 == nil or type(转生) ~= 'number' then 转生 = 0 end
    local 奖励表 = 获取奖励表(编号,等级,转生)
    if 奖励表 == nil then
        return
    end
    local 总概率 = 奖励表.sun --总概率
    local 随机数 = math.random() --是否可以获得道具随机数
    if 总概率 >= 随机数 then --如果总概率大于获得的随机数必定获得道具
        local 目标权重 = math.random(0, math.floor(总概率 * 10000)) / 10000 --获取一个随机小数
        local 当前权重 = 0 --初始化获得道具概率
        for i=1,#奖励表.物品配置 do
            for k, v in pairs(奖励表.物品配置[i]) do --遍历掉落表
                if k == '几率' then
                    当前权重 = 当前权重 + v --概率重新赋值,概率=概率+随机一项概率的值
                    if 当前权重 >= 目标权重 then --如果道具概率大于等于随机数则返回对应掉落信息
                        local 道具 = 奖励表.物品配置[i]
                        if 道具.道具 == '随机天书' then
                            道具.道具 = 取随机天书()
                        elseif 道具.道具 == '百分比药品' then
                            道具.道具 = 取随机百分比药()
                        elseif 道具.道具 == '炼化材料' then
                            道具.道具 = 取随机炼化材料()
                        end
                        return {道具信息 = 道具,广播 = 奖励表.广播}
                    end
                end
            end
        end
    end
    return nil
end

function 取随机天书()
    local itmes = {'天书残卷第一卷','天书残卷第一卷','天书残卷第一卷','天书残卷第二卷','天书残卷第二卷','天书残卷第二卷','天书残卷第三卷','天书残卷第三卷','天书残卷第三卷','天书残卷第四卷','天书残卷第四卷','天书残卷第四卷','天书残卷第五卷','天书残卷第五卷','天书残卷第六卷','天书残卷第七卷','天书残卷第八卷','天书残卷第九卷'}
    return itmes[math.random(#itmes)]
end

function 取随机百分比药()
    local itmes = {'千年熊胆','玫瑰仙叶','仙鹿茸','修罗玉','海蓝石','夜叉石'}
    return itmes[math.random(#itmes)]
end

function 取随机炼化材料()
    local itmes = {'九彩云龙珠','血玲珑','内丹精华','九彩云龙珠','血玲珑','九玄仙玉','落魂砂'}
    return itmes[math.random(#itmes)]
end