-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2023-05-05 03:05:24
-- @Last Modified time  : 2024-02-11 20:58:08

local 物品 = {
    名称 = '变身卡',
    叠加 = 999,
    类别 = 10,
    类型 = 0,
    对象 = 1,
    条件 = 2,
    绑定 = false,
}

function 物品:初始化()

end

function 物品:使用(对象)
    -- if self.参数 then
    --     table.print(self.参数)
    -- end
    local 属性 = {'气血','法力','攻击','速度'}
    local 简称 = {'HP','MP','AP','SP'}
    local 属性文本 = ''
    for i=1,#属性 do
        if self.参数[简称[i]] then
            if self.参数[简称[i]] > 0 then
                属性文本 = 属性文本..属性[i]..'：+'..self.参数[简称[i]]..'%,'
            else
                属性文本 = 属性文本..属性[i]..'：'..self.参数[简称[i]]..'%,'
            end
        end
    end
    local 强法属性={"加强混乱","加强封印","加强昏睡","加强毒伤害","加强火","加强风","加强雷","加强水","加强鬼火","加强遗忘","加强三尸虫回血程度"}
    local 物理属性={"连击次数","连击率","反震程度","反震率","反击率","反击","躲闪率","狂暴几率","致命几率","忽视防御程度","忽视防御几率"}
    local 抗性属性={"物理吸收","抗火","抗水","抗雷","抗风","抗混乱","抗昏睡","抗封印","抗中毒","抗震慑","抗鬼火","抗遗忘","抗三尸虫"}
    local 五行属性={"金","木","水","火","土"}
    local 抗性文本 = ''
    local 五行文本 = ''
    local 调用属性 = 强法属性
    if self.参数.类型 == '抗性' then
        调用属性 = 抗性属性
    elseif self.参数.类型 == '物理' then
        调用属性 = 物理属性
    end
    for i=1,#调用属性 do
        if self.参数[调用属性[i]] and self.参数[调用属性[i]] ~= 0 then
            if self.参数[调用属性[i]] > 0 then
                抗性文本 = 抗性文本..调用属性[i]..'：+'..self.参数[调用属性[i]]..'%,'
            else
                抗性文本 = 抗性文本..调用属性[i]..'：-'..self.参数[调用属性[i]]..'%,'
            end
        end
    end
    local 文本 = '【等级】'..self.参数.等级..','..'【亲和力】'..self.参数.亲和..','..'【种类】'..self.参数.种类..','..属性文本..抗性文本..'#c30ecf8持续时间：360分钟\nmenu\n1|变身\n2|放到变身卡集\n3|什么也不做'
    local x = 对象:选择窗口(文本)
    if x then
        if x == '1' then
            local r = 生成任务 { 名称 = '变身卡', 变身属性 = self.参数 }
            if r then
                r:添加任务(对象)
                self.数量 = self.数量 - 1
            end
        elseif x == '2' then
            if not 对象.变身卡册 then
                对象.变身卡册 = {强法 = {}, 抗性 = {}, 物理 = {}}
            end
            local b = 对象:寻找卡册变身卡(self.参数.名称,self.参数.类型)
            if b then
                if type(b) == 'number' then
                    对象.变身卡册[self.参数.类型][b].数量 = 对象.变身卡册[self.参数.类型][b].数量 + self.数量
                elseif type(b) == 'string' then
                    table.insert(对象.变身卡册[self.参数.类型], self.参数)
                    对象.变身卡册[self.参数.类型][#对象.变身卡册[self.参数.类型]].数量 = self.数量
                    对象:变身卡排序()
                end
                self.数量 = self.数量 - 1
                对象:提示窗口('#Y变身卡已放入七十二变卡册！')
            end
        end
    end
end

function 物品:取描述()
    if self.参数 then
        local 属性 = {'气血','法力','攻击','速度'}
        local 简称 = {'HP','MP','AP','SP'}
        local 属性文本 = ''
        for i=1,#属性 do
            if self.参数[简称[i]] then
                if self.参数[简称[i]] > 0 then
                    属性文本 = '#Y'..属性文本..属性[i]..'：+'..self.参数[简称[i]]..'%'..'#r'
                else
                    属性文本 = '#Y'..属性文本..属性[i]..'：'..self.参数[简称[i]]..'%'..'#r'
                end
            end
        end
        local 强法属性={"加强混乱","加强封印","加强昏睡","加强毒伤害","加强火","加强风","加强雷","加强水","加强鬼火","加强遗忘","加强三尸虫回血程度"}
        local 物理属性={"连击次数","连击率","反震程度","反震率","反击率","反击","躲闪率","狂暴几率","致命几率","忽视防御程度","忽视防御几率"}
        local 抗性属性={"物理吸收","抗火","抗水","抗雷","抗风","抗混乱","抗昏睡","抗封印","抗中毒","抗震慑","抗鬼火","抗遗忘","抗三尸虫"}
        local 五行属性={"金","木","水","火","土"}
        local 抗性文本 = ''
        local 五行文本 = ''
        local 调用属性 = 强法属性
        if self.参数.类型 == '抗性' then
            调用属性 = 抗性属性
        elseif self.参数.类型 == '物理' then
            调用属性 = 物理属性
        end
        for i=1,#调用属性 do
            if self.参数[调用属性[i]] and self.参数[调用属性[i]] ~= 0 then
                if self.参数[调用属性[i]] > 0 then
                    抗性文本 = 抗性文本.."#G"..调用属性[i]..'：+'..self.参数[调用属性[i]]..'%#r'
                else
                    抗性文本 = 抗性文本.."#G"..调用属性[i]..'：'..self.参数[调用属性[i]]..'%#r'
                end
            end
        end
        for i=1,#五行属性 do
            if self.参数[五行属性[i]] and self.参数[五行属性[i]] ~= 0 then
                五行文本 = 五行文本.."#Y"..五行属性[i]..'： '..self.参数[五行属性[i]]..'%  '
            end
        end
        抗性文本 = 抗性文本..'#c30ecf8持续时间：360分钟#r'
        return '【等级】'..self.参数.等级..'#r'..'【亲和力】'..self.参数.亲和..'#r'..'【种类】'..self.参数.种类..'#r'..属性文本..抗性文本..五行文本
    end
end

return 物品
