-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-06-20 19:05:13
-- @Last Modified time  : 2022-07-13 06:26:26
--  1普通宝宝  2天书宝宝 3 守护宝宝    4龙涎丸宝宝 5 神兽5老版神兽     6珍稀神兽   7五常神兽  8 人形神兽   9六艺神兽
return {
    {
        id = 3,
        nid = 'c9MIH_CdFBorTUJuLyWwV',
        uid = 1,
        等级 = 1,
        转生 = 0,
        飞升 = 0,
        点化 = 0,
        外形 = 2097,
        名称 = '测试召唤兽',
        亲密度 = 0,
        忠诚度 = 0,
        根骨 = 1,
        灵性 = 1,
        力量 = 1,
        敏捷 = 1,
        潜力 = 4,
        -- 初血=42,
        --初法=0,
        -- 初攻=60,
        -- 初敏=17,
        --成长=1.033,
        气血 = 1000,
        -- 最大气血=1000,
        魔法 = 1000,
        -- 最大魔法=1000,
        --攻击=1000,
        --速度=122,
        经验 = 10,
        -- 最大经验=80,
        -- 金=45,
        --木=0,
        -- 水=55,
        -- 火=0,
        --土=0,
        类型 = 1,
        龙涎丸 = 0,
        龙之骨 = {次数 = 0, 初血 = 0, 初法 = 0, 初攻 = 0, 初敏 = 0},
        -- 天生技能={"飞砂走石"},
        技能 = {},
        技能格子 = {已开 = 1, 封印 = 6},
        --天生抗性 = {[1]={类型="物理吸收",数值=30}},
        内丹 = {},
        染色 = {},
        装备 = {},
        炼妖 = {}
    }
}
