-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2022-07-27 13:51:21
-- @Last Modified time  : 2024-10-15 00:53:53
--{year =2022, month = 7, day =27, hour =0, min =0, sec = 00}
--年月日 时分秒
local 事件 = {
    名称 = '地煞星',
    是否打开 = true,
    开始时间 = os.time {year = 2022, month = 7, day = 25, hour = 0, min = 0, sec = 00},
    结束时间 = os.time {year = 2025, month = 7, day = 30, hour = 0, min = 0, sec = 00}
}

function 事件:事件初始化()
    self.NPC = {}
end
local _模型 = {1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,60,61,62,63,64,65}
local _种族 = {1,1,1,1,1,1,2,2,2,2,2,2,3,3,3,3,3,3,4,4,4,4,4,4}
local _地图 = {
    {名称 = '地劣星', 称谓= '★',外形 = 2, 数量 = 5, 地图 = {1173, 1203, 1091, 1008, 1090}},
    {名称 = '地恶星', 称谓= '★★',外形 = 2, 数量 = 5, 地图 = {1092, 1118, 1119, 1120, 1121}},
    {名称 = '地囚星', 称谓= '★★★',外形 = 3, 数量 = 5, 地图 = {1140, 1130, 1127, 1129, 1128}},
    {名称 = '地魔星', 称谓= '★★★★',外形 = 6, 数量 = 5, 地图 = {1174, 1177, 1178, 1186, 1187}},
    {名称 = '地周星', 称谓= '★★★★★',外形 = 3, 数量 = 5, 地图 = {1131, 1179, 1180, 1188, 1189}},
    {名称 = '地猖星', 称谓= '★★★★★★',外形 = 4, 数量 = 5, 地图 = {1199, 1181, 1182, 1190, 1191}},
    {名称 = '地轴星', 称谓= '★★★★★★★',外形 = 6, 数量 = 5, 地图 = {1201, 1217, 1183, 1192}},
    {名称 = '地威星', 称谓= '★★★★★★★★',外形 = 5, 数量 = 5, 地图 = {101295}},
    {名称 = '地状星', 称谓= '★★★★★★★★★',外形 = 10, 数量 = 5, 地图 = {101299}},
    {名称 = '地藏星', 称谓= '★★★★★★★★★★',外形 = 11, 数量 = 5, 地图 = {101300}},
}

function 事件:更新()
    for i = 1, 10 do
        for q=1,#_地图[i].地图 do
            local map = self:取地图(_地图[i].地图[q])
            if map then
                for n=1,_地图[i].数量 do
                    local 随机 = math.random(1, #_模型)
                    local X, Y = map:取随机坐标()
                    local NPC =
                        map:添加NPC {
                        名称 = _地图[i].名称,
                        称谓 = _地图[i].称谓,
                        外形 = _模型[随机],
                        种族 = _种族[随机],
                        等级 = i,
                        时间 = 1800,--实际秒数*2
                        脚本 = 'scripts/event/地煞星.lua',
                        X = X,
                        Y = Y,
                        事件 = self
                    }
                end
            end
        end
    end
    -- self:发送系统('#C测试信息,低级地煞星刷新')
    return not self.是否结束 and 900
end

function 事件:事件开始()
    self:更新('我被更新了')
end

function 事件:事件结束()
    self.是否结束 = true
end
--=======================================================
local 对话 = [[没想到我躲在这里，也会被你们发现，休想抓我回去。#4
menu
1|妖孽，受死吧
2|我认错人了
]]
function 事件:NPC对话(玩家, i)
    return 对话
end

function 事件:NPC菜单(玩家, i)
    if i == '1' then
        local r = 玩家:进入战斗('scripts/event/地煞星.lua', self)
        if r then
            self:完成(玩家,self)
            self:删除()
        end
    end
end

--===============================================

function 事件:战斗初始化(玩家 , s)
    local 怪物列表={
        [1]={"地劣星","地狗星","地耗星"},
        [2]={"地恶星","地狗星","地耗星","地刑星","地数星"},
        [3]={"地囚星","地狗星","地耗星","地刑星","地数星"},
        [4]={"地魔星","地狗星","地耗星","地刑星","地数星"},
        [5]={"地周星","地狗星","地耗星","地刑星","地数星"},
        [6]={"地猖星","地狗星","地耗星","地刑星","地数星","地俊星","地僻星"},
        [7]={"地轴星","地狗星","地耗星","地刑星","地数星","地俊星","地僻星","地镇星"},
        [8]={"地威星","地狗星","地耗星","地刑星","地数星","地俊星","地僻星","地镇星","地捷星","地幽星"},
        [9]={"地壮星","地狗星","地耗星","地刑星","地数星","地俊星","地僻星","地镇星","地捷星","地异星"},
        [10]={"地藏星","地狗星","地耗星","地刑星","地数星","地俊星","地僻星","地镇星","地捷星","地异星"}}
    local 种族基础初值 = {
        [1] = {血初值 = 650, 法初值 = 500, 攻初值 = 100,敏初值 = 30},
        [2] = {血初值 = 300, 法初值 = 400, 攻初值 = 300,敏初值 = 60},
        [3] = {血初值 = 450, 法初值 = 900, 攻初值 = 110,敏初值 = 45},
        [4] = {血初值 = 750, 法初值 = 500, 攻初值 = 100,敏初值 = 20},
    }
    local 高级种族技能 = {
        [1] = {{'反间之计', '情真意切', '谗言相加', '借刀杀人', '失心狂乱'},{'催眠咒', '瞌睡咒', '离魂咒', '迷魂醉', '百日眠'},{'作茧自缚', '金蛇缠丝', '天罗地网', '作壁上观', '四面楚歌'},{'蛇蝎美人', '追魂迷香', '断肠烈散', '鹤顶红粉', '万毒攻心'}},
        [2] = {{'魔之飞步', '急速之魔', '魔神飞舞', '天外飞魔', '乾坤借速'},{'妖之魔力', '力神复苏', '狮王之怒', '兽王神力', '魔神附身'},{'夺命勾魂', '追神摄魄', '魔音摄心', '销魂蚀骨', '阎罗追命'},{'红袖添香', '莲步轻舞', '楚楚可怜', '魔神护体', '含情脉脉'}},
        [3] = {{'飞砂走石', '乘风破浪', '太乙生风', '风雷涌动', '袖里乾坤'},{'雷霆霹雳', '日照光华', '雷神怒击', '电闪雷鸣', '天诛地灭'},{'龙卷雨击', '龙腾水溅', '龙啸九天', '蛟龙出海', '九龙冰封'},{'地狱烈火', '天雷怒火', '三味真火', '烈火骄阳', '九阴纯火'}},
        [4] = {{'吸血水蛭', '六翅毒蝉', '啮骨抽髓', '血煞之蛊', '吸星大法'},{'麻沸散', '鬼失惊', '乱魂钉', '失心疯', '孟婆汤'},{'幽冥鬼火', '火影迷踪', '冥烟销骨', '落日熔金', '血海深仇'},{'幽怜魅影', '醉生梦死', '一曲销魂', '秦丝冰雾', '倩女幽魂'}}
    }
    local 低级种族技能 = {
        [1] = {{'反间之计', '情真意切', '谗言相加'},{'催眠咒', '瞌睡咒', '离魂咒'},      {'作茧自缚', '金蛇缠丝', '天罗地网'},{'蛇蝎美人', '追魂迷香', '断肠烈散'}},
        [2] = {{'魔之飞步', '急速之魔', '魔神飞舞'},{'妖之魔力', '力神复苏', '狮王之怒'},{'夺命勾魂', '追神摄魄', '魔音摄心'},{'红袖添香', '莲步轻舞', '楚楚可怜'}},
        [3] = {{'飞砂走石', '乘风破浪', '太乙生风'},{'雷霆霹雳', '日照光华', '雷神怒击'},{'龙卷雨击', '龙腾水溅', '龙啸九天'},{'地狱烈火', '天雷怒火', '三味真火'}},
        [4] = {{'吸血水蛭', '六翅毒蝉', '啮骨抽髓'},{'麻沸散', '鬼失惊', '乱魂钉'},      {'幽冥鬼火', '火影迷踪', '冥烟销骨'},{'幽怜魅影', '醉生梦死', '一曲销魂'}}
    }
    local 列表 = 怪物列表[s.等级]
    local _怪物 = {}
    for i=1,#列表 do
        local 随机 = math.random(1, #_模型)
        local 种族 = s.种族
        local 综合等级 = 20 + s.等级 * 10
        if i == 1 then
            _怪物[i] = {名称 = s.名称, 外形 = s.外形, 等级 = 综合等级 , 血初值 = 种族基础初值[s.种族].血初值 + s.等级 * 50, 法初值 = 种族基础初值[s.种族].法初值 + s.等级 * 20, 攻初值 = 种族基础初值[s.种族].攻初值 + s.等级 * 20, 敏初值 = 种族基础初值[s.种族].敏初值 + s.等级 * 10}
        else
            种族 = _种族[随机]
            _怪物[i] = {名称 = 列表[i], 外形 = _模型[随机], 等级 = 综合等级 , 血初值 = 种族基础初值[s.种族].血初值 + s.等级 * 50, 法初值 = 种族基础初值[s.种族].法初值 + s.等级 * 20, 攻初值 = 种族基础初值[s.种族].攻初值 + s.等级 * 20, 敏初值 = 种族基础初值[s.种族].敏初值 + s.等级 * 10}
        end
        _怪物[i].技能 = {}
        if s.等级 <= 8 then
            local 技能 = 低级种族技能[种族][math.random(1, 4)]
            for n=1,#技能 do
                _怪物[i].技能[n] = {名称 = 技能[n] , 熟练度 = s.等级 * 1000}
            end
        else
            local 技能 = 高级种族技能[种族][math.random(1, 4)]
            for n=1,#技能 do
                _怪物[i].技能[n] = {名称 = 技能[n] , 熟练度 = s.等级 * 1000}
            end
        end
        _怪物[i].抗性 = 取种族抗性(种族,综合等级)
    end
    for i = 1, #列表 do
        local r = 生成战斗怪物(生成怪物属性(_怪物[i]))
        self:加入敌方(i, r)
    end
end

function 事件:战斗回合开始(dt)
end

function 事件:战斗结束(x, y)
end
--===============================================
function 事件:完成(玩家,s)
    if 玩家.是否组队 then
        for _, v in 玩家:遍历队伍() do
            self:掉落包(v,s)
        end
    else
        self:掉落包(玩家,s)
    end
end
local _掉落 = {
    {几率 = 300, 名称 = '神兵礼盒', 数量 = 1, 广播 = '#C谁%s获得了什么#G#m(%s)[%s]#m#n'},
    {几率 = 800, 名称 = '内丹精华', 数量 = 1, 广播 = '#C谁%s获得了什么#G#m(%s)[%s]#m#n'},
    {几率 = 810, 名称 = '血玲珑', 数量 = 1, 广播 = '#C谁%s获得了什么#G#m(%s)[%s]#m#n'},
    {几率 = 820, 名称 = '九彩云龙珠', 数量 = 1, 广播 = '#C谁%s获得了什么#G#m(%s)[%s]#m#n'},
    {几率 = 400, 名称 = '龙之骨', 数量 = 1, 广播 = '#C谁%s获得了什么#G#m(%s)[%s]#m#n'},
    {几率 = 500, 名称 = '随机天书', 数量 = 1, 广播 = '#C谁%s获得了什么#G#m(%s)[%s]#m#n'},
    {几率 = 600, 名称 = '见闻录', 数量 = 1, 广播 = '#C谁%s获得了什么#G#m(%s)[%s]#m#n'},
    {几率 = 780, 名称 = '千年寒铁', 数量 = 1, 广播 = '#C谁%s获得了什么#G#m(%s)[%s]#m#n'},
    {几率 = 770, 名称 = '天外飞石', 数量 = 1, 广播 = '#C谁%s获得了什么#G#m(%s)[%s]#m#n'},
    {几率 = 830, 名称 = '神兽丹', 数量 = 1, 广播 = '#C谁%s获得了什么#G#m(%s)[%s]#m#n'},
    {几率 = 550, 名称 = '高级装备', 数量 = 1, 广播 = '#C谁%s获得了什么#G#m(%s)[%s]#m#n'},
    {几率 = 450, 名称 = '炼妖宝盒', 数量 = 1, 广播 = '#C谁%s获得了什么#G#m(%s)[%s]#m#n'},
    {几率 = 760, 名称 = '盘古精铁', 数量 = 1, 广播 = '#C谁%s获得了什么#G#m(%s)[%s]#m#n'},
    {几率 = 540, 名称 = '指南录', 数量 = 1, 广播 = '#C谁%s获得了什么#G#m(%s)[%s]#m#n'},
    {几率 = 560, 名称 = '高级金柳露', 数量 = 1, 广播 = '#C谁%s获得了什么#G#m(%s)[%s]#m#n'},
    {几率 = 100, 名称 = '神兽碎片', 数量 = 1, 广播 = '#C谁%s获得了什么#G#m(%s)[%s]#m#n'},
}
function 事件:掉落包(玩家,s)
    if 玩家:取活动限制次数('地煞星') > 50 then
        玩家:提示窗口('本日奖励次数已尽,无法继续获得奖励')
        return
    end
    玩家:增加活动限制次数('地煞星')
    local 银子 = 1000 * s.等级
    local 经验 = 10000 * (s.等级 * 0.15)


    玩家:添加银子(银子)
    玩家:添加任务经验(经验, '地煞星')
end
return 事件
