-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-27 13:51:21
-- @Last Modified time  : 2024-08-26 13:35:10
--{year =2022, month = 7, day =27, hour =0, min =0, sec = 00}
--年月日 时分秒
local 事件 = {
    名称 = '城东保卫战',
    是否打开 = true,
    开始时间 = os.time {year = 2022, month = 7, day = 25, hour = 0, min = 0, sec = 00},
    结束时间 = os.time {year = 2025, month = 7, day = 30, hour = 0, min = 0, sec = 00}
}

function 事件:事件初始化()
    self.NPC = {}
end

local _主怪信息 = {
    [1] = {名称 = '龟丞相', 模型 = 2064},
    [2] = {名称 = '泾河龙鬼', 模型 = 2076},
    [3] = {名称 = '夜叉王', 模型 = 2072}
}
function 事件:更新()
    local map = self:取地图(1193)
    for i = 1, #_主怪信息 do
        for _ = 1, 50 do
            local X, Y = map:取随机坐标()
            local NPC =
                map:添加NPC {
                名称 = _主怪信息[i].名称,
                外形 = _主怪信息[i].模型,
                时间 = 7200,
                脚本 = 'scripts/event/城东保卫战.lua',
                X = X,
                Y = Y,
                事件 = self
            }
        end
        self:发送系统('#Y【城东卫战】#G%s#W在#R长安东#G向#R长安城#G发起进攻，唐王下令全体军民誓死抵御来犯之敌#90#G犯我中华者虽远必诛#90', _主怪信息[i].名称)
    end

    return not self.是否结束 and 900000
end

function 事件:事件开始()

end

function 事件:事件结束()
    self.是否结束 = true
end
--=======================================================
local 对话 = [[没想到我躲在这里，也会被你们发现，休想抓我回去。#4
menu
1|妖孽，受死吧
2|我认错人了
]]
function 事件:NPC对话(玩家, i)
    return 对话
end

function 事件:NPC菜单(玩家, i)
    if i == '1' then
        local r = 玩家:进入战斗('scripts/event/城东保卫战.lua' , self)
        if r then
            self:完成(玩家)
            self:删除()
        end
    end
end

--===============================================

function 事件:战斗初始化(玩家, NPC)
    local 等级 = 玩家:取队伍平均等级()
    local _怪物 = {
        { 名称 = NPC.名称, 外形 = NPC.外形, 等级=等级, 血初值 = 2500, 法初值 = 50, 攻初值 = 50, 敏初值 = 300,技能 = {{名称 = '乱魂钉',熟练度 = 8000},{名称 = '冥烟销骨',熟练度 = 8000},{名称 = '血海深仇',熟练度 = 8000},{名称 = '孟婆汤',熟练度 = 8000}} , 施法几率 = 50,是否消失 = false},
        { 名称 = "海龟先锋", 外形 = 2036, 等级=等级, 血初值 = 2400, 法初值 = 50, 攻初值 = 20, 敏初值 = 10,施法几率 = 50,是否消失 = false , 内丹 = {{ 技能 = "万佛朝宗", 转生 = 2, 等级 = 140 }}},
        { 名称 = "海龟先锋", 外形 = 2036, 等级=等级, 血初值 = 2400, 法初值 = 50, 攻初值 = 20, 敏初值 = 10,施法几率 = 50,是否消失 = false , 内丹 = {{ 技能 = "万佛朝宗", 转生 = 2, 等级 = 140 }}},
        { 名称 = "飞鱼先锋", 外形 = 2032, 等级=等级, 血初值 = 2100, 法初值 = 50, 攻初值 = 600, 敏初值 = 100,施法几率 = 50,是否消失 = false , 内丹 = {{ 技能 = "浩然正气", 转生 = 2, 等级 = 140 }}},
        { 名称 = "飞鱼先锋", 外形 = 2032, 等级=等级, 血初值 = 2100, 法初值 = 800, 攻初值 = 20, 敏初值 = 100,施法几率 = 50,是否消失 = false , 抗性 = {连击率 = 80 , 连击次数 = 6} , 内丹 = {{ 技能 = "乘风破浪", 转生 = 2, 等级 = 140 }}},
        { 名称 = "巡海夜叉", 外形 = 2072, 等级=等级, 血初值 = 1800, 法初值 = 50, 攻初值 = 600, 敏初值 = 80,施法几率 = 50,是否消失 = false , 内丹 = {{ 技能 = "浩然正气", 转生 = 2, 等级 = 140 }}},
        { 名称 = "巡海夜叉", 外形 = 2072, 等级=等级, 血初值 = 1800, 法初值 = 50, 攻初值 = 600, 敏初值 = 80,施法几率 = 50,是否消失 = false , 内丹 = {{ 技能 = "隔山打牛", 转生 = 2, 等级 = 140 }}},
        { 名称 = "巡海夜叉", 外形 = 2072, 等级=等级, 血初值 = 1800, 法初值 = 50, 攻初值 = 600, 敏初值 = 80,施法几率 = 50,是否消失 = false , 内丹 = {{ 技能 = "隔山打牛", 转生 = 2, 等级 = 140 }}},
        { 名称 = "龟丞相", 外形 = 2064, 等级=等级, 血初值 = 2300, 法初值 = 50, 攻初值 = 20, 敏初值 = 150,施法几率 = 50,是否消失 = false , 内丹 = {{ 技能 = "凌波微步", 转生 = 2, 等级 = 140 }}},
        { 名称 = "龟丞相", 外形 = 2064, 等级=等级, 血初值 = 2300, 法初值 = 50, 攻初值 = 20, 敏初值 = 150,施法几率 = 50,是否消失 = false , 内丹 = {{ 技能 = "隔山打牛", 转生 = 2, 等级 = 160 }}},
    }
    for i=1,10 do
        local r = {}
        if i ~= 1 then
            r = 生成战斗怪物(生成怪物属性(_怪物[i],'中等',nil,'中级法术'))
        else
            r = 生成战斗怪物(生成怪物属性(_怪物[i],'困难'))
        end

        self:加入敌方(i, r)
    end
end

function 事件:战斗回合开始(dt)
end

function 事件:战斗结束(x, y)
end
--===============================================
function 事件:完成(玩家)
    if 玩家.是否组队 then
        for _, v in 玩家:遍历队伍() do
            
            self:掉落包(v)
        end
    else
        self:掉落包(玩家)
    end
end
function 事件:掉落包(玩家)
    if 玩家:取活动限制次数('城东保卫战') >= 120 then
        玩家:提示窗口('本日奖励次数已尽,无法继续获得奖励')
        return
    end
    玩家:增加活动限制次数('城东保卫战')
    local 银子 = 22222
    local 经验 = 20000 * (玩家.等级 * 0.15)
    --(1+玩家.其它.鬼王次数*1.2)

    玩家:添加参战召唤兽经验(经验 * 1.5, "城东保卫战")
    玩家:添加银子(银子, "城东保卫战")
    玩家:添加经验(经验, "城东保卫战")
    local 奖励 = 是否奖励(2009,玩家.等级,玩家.转生)
    if 奖励 ~= nil and type(奖励) == 'table' then
        local r = 生成物品 { 名称 = 奖励.道具信息.道具, 数量 = 奖励.道具信息.数量, 参数 = 奖励.道具信息.参数 }
        if r then
            玩家:添加物品({ r })
            if 奖励.道具信息.是否广播 == 1 and 奖励.广播 ~= nil then
                玩家:发送系统(奖励.广播, 玩家.名称, r.ind, r.名称)
            end
        end
    end
end

return 事件
