-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-27 13:51:21
-- @Last Modified time  : 2024-08-26 13:36:16
--{year =2022, month = 7, day =27, hour =0, min =0, sec = 00}
--年月日 时分秒
local 事件 = {
    名称 = '天元盛典_万仙方阵',
    是否打开 = true,
    开始时间 = os.time {year = 2022, month = 7, day = 25, hour = 0, min = 0, sec = 00},
    结束时间 = os.time {year = 2025, month = 7, day = 30, hour = 0, min = 0, sec = 00}
}

function 事件:事件初始化()
    self.NPC = {}
end
local _地图 = {1193, 1110, 1194, 1091, 1174}

local _主怪信息 = {
    {
        {名称 = '九天玄女', 模型 = 2129},
        {名称 = '大罗金仙', 模型 = 2098},
        {名称 = '三清道人', 模型 = 2168}
    },

    {
        {名称 = '广寒宫侍女', 模型 = 2128},
        {名称 = '兜率宫弟子', 模型 = 2083}, --巨灵神
        {名称 = '金甲天兵', 模型 = 2061}
    },

    {
        {名称 = '风雨雷电', 模型 = 2127},
        {名称 = '王母侍女', 模型 = 2201},
        {名称 = '四海龙王', 模型 = 2076}
    },

    {
        {名称 = '百花仙子', 模型 = 2096},
        {名称 = '十殿阎罗', 模型 = 2075},
        {名称 = '天罡星', 模型 = 2127}
    },

    {
        {名称 = '六丁六甲', 模型 = 2114},
        {名称 = '九曜十都', 模型 = 2115},
        {名称 = '二十八星宿', 模型 = 2168}
    }
}

function 事件:更新()
    for k, v in pairs(_地图) do
        local map = self:取地图(v)
        local 随机 = math.random(30, 50)
        for _ = 1, 随机 do
            local X, Y = map:取随机坐标()
            local xz = math.random(#_主怪信息[k])
            local NPC =
                map:添加NPC {
                名称 = _主怪信息[k][xz].名称,
                称谓 = '天元盛典',
                外形 = _主怪信息[k][xz].模型,
                时间 = 7200,
                脚本 = 'scripts/event/天元盛典_万仙方阵.lua',
                X = X,
                Y = Y,
                事件 = self
            }
        end
    end
    self:发送系统('#Y【天元盛典】#G天庭举办天界盛典竟有妖怪混入，诸君可以三人及以上组队，速速前往#W长安东、大唐境内、五指山、长寿村外、北俱芦洲#G寻找天庭的万仙方阵捉拿妖怪。')
    return not self.是否结束 and 7200
end

function 事件:事件开始()
end

function 事件:事件结束()
    self.是否结束 = true
end
--=======================================================
local 对话 = [[没想到我躲在这里，也会被你们发现，休想抓我回去。#4
menu
1|妖孽，受死吧
2|我认错人了
]]
function 事件:NPC对话(玩家, i)
    return 对话
end

function 事件:NPC菜单(玩家, i)
    if i == '1' then
        local r = 玩家:进入战斗('scripts/event/天元盛典_万仙方阵.lua' , self)
        if r then
            self:完成(玩家)
            self:删除()
        end
    end
end

--===============================================

function 事件:战斗初始化(玩家 , NPC)
    local 等级 = 玩家:取队伍平均等级()
    local _怪物 = {
        { 名称 = NPC.名称, 外形 = NPC.外形, 等级=等级, 血初值 = math.random(800, 1600), 法初值 = 50, 攻初值 = 50, 敏初值 = math.random(50, 220), 施法几率 = 50,是否消失 = false},
        { 名称 = NPC.名称, 外形 = NPC.外形, 等级=等级, 血初值 = math.random(800, 1600), 法初值 = 50, 攻初值 = 20, 敏初值 = math.random(50, 220),施法几率 = 50,是否消失 = false},
        { 名称 = NPC.名称, 外形 = NPC.外形, 等级=等级, 血初值 = math.random(800, 1600), 法初值 = 50, 攻初值 = 20, 敏初值 = math.random(50, 220),施法几率 = 50,是否消失 = false},
        { 名称 = NPC.名称, 外形 = NPC.外形, 等级=等级, 血初值 = math.random(800, 1600), 法初值 = 50, 攻初值 = 20, 敏初值 = math.random(50, 220),施法几率 = 50,是否消失 = false},
        { 名称 = NPC.名称, 外形 = NPC.外形, 等级=等级, 血初值 = math.random(800, 1600), 法初值 = 50, 攻初值 = 20, 敏初值 = math.random(50, 220),施法几率 = 50,是否消失 = false},
        { 名称 = NPC.名称, 外形 = NPC.外形, 等级=等级, 血初值 = math.random(800, 1600), 法初值 = 50, 攻初值 = 20, 敏初值 = math.random(50, 220),施法几率 = 50,是否消失 = false},
        { 名称 = NPC.名称, 外形 = NPC.外形, 等级=等级, 血初值 = math.random(800, 1600), 法初值 = 50, 攻初值 = 20, 敏初值 = math.random(50, 220),施法几率 = 50,是否消失 = false},
        { 名称 = NPC.名称, 外形 = NPC.外形, 等级=等级, 血初值 = math.random(800, 1600), 法初值 = 50, 攻初值 = 20, 敏初值 = math.random(50, 220),施法几率 = 50,是否消失 = false},
        { 名称 = NPC.名称, 外形 = NPC.外形, 等级=等级, 血初值 = math.random(800, 1600), 法初值 = 50, 攻初值 = 20, 敏初值 = math.random(50, 220),施法几率 = 50,是否消失 = false},
        { 名称 = NPC.名称, 外形 = NPC.外形, 等级=等级, 血初值 = math.random(800, 1600), 法初值 = 50, 攻初值 = 20, 敏初值 = math.random(50, 220),施法几率 = 50,是否消失 = false},
    }
    for i=1,10 do
        local r = 生成战斗怪物(生成怪物属性(_怪物[i] , '困难' , nil , '高级法术'))
        self:加入敌方(i, r)
    end
end

function 事件:战斗回合开始(dt)
end

function 事件:战斗结束(x, y)
end
--===============================================
function 事件:完成(玩家)
    if 玩家.是否组队 then
        for _, v in 玩家:遍历队伍() do
            self:掉落包(v)
        end
    else
        self:掉落包(玩家)
    end
end

function 事件:掉落包(玩家)
    if 玩家:取活动限制次数('天元盛典') >= 120 then
        玩家:常规提示('本日奖励次数已尽,无法继续获得奖励')
        return
    end
    玩家:增加活动限制次数('天元盛典')
    local 银子 = 28000
    local 经验 = 50000 * (玩家.等级 * 0.15)
    --(1+玩家.其它.鬼王次数*1.2)

    玩家:添加参战召唤兽经验(经验 * 1.5, "天元盛典")
    玩家:添加银子(银子, "天元盛典")
    玩家:添加经验(经验, "天元盛典")
    local 奖励 = 是否奖励(2007,玩家.等级,玩家.转生)
    if 奖励 ~= nil and type(奖励) == 'table' then
        local r = 生成物品 { 名称 = 奖励.道具信息.道具, 数量 = 奖励.道具信息.数量, 参数 = 奖励.道具信息.参数 }
        if r then
            玩家:添加物品({ r })
            if 奖励.道具信息.是否广播 == 1 and 奖励.广播 ~= nil then
                玩家:发送系统(奖励.广播, 玩家.名称, r.ind, r.名称)
            end
        end
    end
end

return 事件