-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-27 13:51:21
-- @Last Modified time  : 2024-08-26 13:36:02
--{year =2022, month = 7, day =27, hour =0, min =0, sec = 00}
--年月日 时分秒
local 事件 = {
    名称 = '梨园庙会',
    是否打开 = true,
    开始时间 = os.time {year = 2022, month = 7, day = 25, hour = 0, min = 0, sec = 00},
    结束时间 = os.time {year = 2025, month = 7, day = 30, hour = 0, min = 0, sec = 00}
}

function 事件:事件初始化()
    self.NPC = {}
end
local _地图 = {101386}

function 事件:更新()
    local 模型表={3093,3092,3091,2149,2150,3033}
    local 名称表={"胡巧儿","黄火牛","顶天柱","乐师","舞者","公孙大娘"}
    for k, v in pairs(_地图) do
        local map = self:取地图(v)
        for _ = 1, 80 do
            local 随机 = math.random(1, #模型表)
            local X, Y = map:取随机坐标()
            local NPC =
                map:添加NPC {
                名称 = 名称表[随机],
                外形 = 模型表[随机],
                时间 = 7200,
                脚本 = 'scripts/event/梨园庙会.lua',
                X = X,
                Y = Y,
                事件 = self
            }
        end
    end

    self:发送系统('#Y暮春之时，万物生发。为祈祷风调雨顺古物丰收，慰劳我大唐辛勤的子民们，唐王授意举办这热闹的梨园庙会，特邀请我大唐子民前去庙会游玩，欣赏那世代相传的民间曲艺以及玩乐风俗。')

    return not self.是否结束 and 900000
end

function 事件:事件开始()

end

function 事件:事件结束()
    self.是否结束 = true
end
--=======================================================
local 对话 = [[我们的庙会热闹吗,来一起玩啊#89
menu
1|大胆妖孽,我一眼就看出你不是人
2|挺好玩的
]]
function 事件:NPC对话(玩家, i)
    return 对话
end

function 事件:NPC菜单(玩家, i)
    if i == '1' then
        local r = 玩家:进入战斗('scripts/event/梨园庙会.lua' , self)
        if r then
            self:完成(玩家)
            self:删除()
        end
    end
end

--===============================================

function 事件:战斗初始化(玩家 , NPC)
    local 等级 = 玩家:取队伍平均等级()
    local _怪物 = {
        { 名称 = '瑶姬', 外形 = 2179, 等级=等级, 血初值 = 2500, 法初值 = 50, 攻初值 = 200, 敏初值 = 300, 施法几率 = 70 , 技能 = {{名称 = '乱魂钉' , 熟练度 = 8000} ,{名称 = '冥烟销骨' , 熟练度 = 8000} ,{名称 = '血海深仇' , 熟练度 = 8000} ,{名称 = '孟婆汤' , 熟练度 = 8000} } , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 10 , 抗火 = 10 , 抗混乱 = 70 , 抗昏睡 = 70 , 抗封印 = 70 , 抗遗忘 = 70 , 物理吸收 = 30} },
        { 名称 = '玲珑使者', 外形 = 2100, 等级=等级, 血初值 = 2000, 法初值 = 50, 攻初值 = 200, 敏初值 = math.random(150, 220),施法几率 = 60 , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 10 , 抗火 = 10 , 抗混乱 = 70 , 抗昏睡 = 70 , 抗封印 = 70 , 抗遗忘 = 70 , 物理吸收 = 30} },
        { 名称 = '宝莲使者', 外形 = 2096, 等级=等级, 血初值 = 2000, 法初值 = 50, 攻初值 = 200, 敏初值 = math.random(150, 220),施法几率 = 60 , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 10 , 抗火 = 10 , 抗混乱 = 70 , 抗昏睡 = 70 , 抗封印 = 70 , 抗遗忘 = 70 , 物理吸收 = 30} },
        { 名称 = '仙女', 外形 = 2150, 等级=等级, 血初值 = 1800, 法初值 = 50, 攻初值 = 200, 敏初值 = math.random(150, 220),施法几率 = 6 , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 10 , 抗火 = 10 , 抗混乱 = 70 , 抗昏睡 = 70 , 抗封印 = 70 , 抗遗忘 = 70 , 物理吸收 = 30} },
        { 名称 = '仙女', 外形 = 2150, 等级=等级, 血初值 = 1800, 法初值 = 50, 攻初值 = 200, 敏初值 = math.random(150, 220),施法几率 = 60 , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 10 , 抗火 = 10 , 抗混乱 = 70 , 抗昏睡 = 70 , 抗封印 = 70 , 抗遗忘 = 70 , 物理吸收 = 30} },
        { 名称 = '侍女', 外形 = 2128, 等级=等级, 血初值 = 2000, 法初值 = 50, 攻初值 = 200, 敏初值 = math.random(150, 220),施法几率 = 90 , 技能 = {{名称 = '失心狂乱' , 熟练度 = 6000} ,{名称 = '谗言相加' , 熟练度 = 8000} ,{名称 = '借刀杀人' , 熟练度 = 8000} } , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 10 , 抗火 = 10 , 抗混乱 = 70 , 抗昏睡 = 70 , 抗封印 = 70 , 抗遗忘 = 70 , 物理吸收 = 30} },
        { 名称 = '侍女', 外形 = 2129, 等级=等级, 血初值 = 1500, 法初值 = 50, 攻初值 = 200, 敏初值 = 350,施法几率 = 80 , 技能 = {{名称 = '阎罗追命' , 熟练度 = 9000}} , 抗性 = {抗风 = 10 , 抗雷 = 10 , 抗水 = 10 , 抗火 = 10 , 抗混乱 = 70 , 抗昏睡 = 70 , 抗封印 = 70 , 抗遗忘 = 70 , 物理吸收 = 30} },
    }
    for i=1,7 do
        local r
        if i == 1 or i == 6 or i == 7 then
            r = 生成战斗怪物( 生成怪物属性( _怪物[i] , '困难' ) )
        else
            r = 生成战斗怪物( 生成怪物属性( _怪物[i] , '困难' , nil , '低级法术' ) )
        end
        self:加入敌方(i, r)
    end
end

function 事件:战斗回合开始(dt)
end

function 事件:战斗结束(x, y)
end
--===============================================
function 事件:完成(玩家)
    if 玩家.是否组队 then
        for _, v in 玩家:遍历队伍() do
            self:掉落包(v)
        end
    else
        self:掉落包(玩家)
    end
end

function 事件:掉落包(玩家)
    if 玩家:取活动限制次数('梨园庙会') >= 120 then
        return
    end
    玩家:增加活动限制次数('梨园庙会')
    local 银子 = 33333
    local 经验 = 30000 * (玩家.等级 * 0.15)
    --(1+玩家.其它.鬼王次数*1.2)

    玩家:添加参战召唤兽经验(经验 * 1.5, "梨园庙会")
    玩家:添加银子(银子, "梨园庙会")
    玩家:添加经验(经验, "梨园庙会")
    local 奖励 = 是否奖励(2004,玩家.等级,玩家.转生)
    if 奖励 ~= nil and type(奖励) == 'table' then
        local r = 生成物品 { 名称 = 奖励.道具信息.道具, 数量 = 奖励.道具信息.数量, 参数 = 奖励.道具信息.参数 }
        if r then
            玩家:添加物品({ r })
            if 奖励.道具信息.是否广播 == 1 and 奖励.广播 ~= nil then
                玩家:发送系统(奖励.广播, 玩家.名称, r.ind, r.名称)
            end
        end
    end
end

return 事件